{"cid": "Ugyk_07ZRk4B96roa8l4AaABAg", "text": "Try this for size Dave. https://www.youtube.com/watch?v=qASFh0YfFpY", "time": "2 weeks ago", "author": "Robert Jones", "channel": "UCfk7YtisFKiFUKZDCOxeVfg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSuTm_Ogz2KIGSUqeOf4mWcfMQgE7sX1mAbfA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwR37kvD08-3MyVFZV4AaABAg", "text": "All this talk about shifting energy sources, but I thought the real problem was over consumption of cows, and the methane they produce.  Or am I wrong?", "time": "3 months ago", "author": "prky cck", "channel": "UC-7LH5J73SmgUdSfOsVXfww", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLT7oQ_dsb5eRGgIABLt3M41OBW_QEx27avYHw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwYC6XGh5ecBeSqAbp4AaABAg", "text": "Eu adoro seus programas desde que eu era um estudante no início dos anos 60 minha mãe me ensinou que este lindo planeta e as maravilhas do universo e todas as maravilhosas infra-estruturas que sustentam e tornam nossas vidas tão maravilhosas não estavam aqui por acaso. Sempre soube que os ecossistemas foram criados. e que o dono do planeta que tanto investiu no planeta em breve resolverá as questões. Tem algo aqui no link abaixo (uma série de filmes e palestras) que os amantes da natureza podem assistir que explica não só a impossibilidade de a teoria da evolução, mas também como esses ecossistemas testificam brevemente sobre a sabedoria de um criador todo-poderoso. Seu nome foi expurgado da Bíblia pelas várias igrejas que o representam erroneamente. Mas 31 vezes o livro de Ezequiel diz: \"Então as nações terão que saber que eu sou Jeová\". Eu sei que não é popular para a sociedade europeia educada de hoje acreditar em qualquer coisa, exceto na evolução. Mas quem criou as moléculas, as células dos átomos e quem as programou para obedecer e criar todas as criaturas grandes e minúsculas, todas as sementes que fornecem uma abundância infinita de alimento para todos ... Pare e pense que É IMPOSSÍVEL para esses poderosos blocos de construção da vida vir de lugar nenhum .. e David, eu sei que seus programas não iriam ao ar se você também não se curvasse e fizesse um ato de adoração à teoria da evolução .. www.jw.org", "time": "3 months ago", "author": "Norman Longstaff", "channel": "UCzd4jsKYkY786oCSsEjuSpg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLT_Qb9xgPBXCfUZJ7f6nqMHniZ-SSGINORkkudk=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugzey9z_qEdiQT49FQh4AaABAg", "text": "CO2 at 0.04% is a 2,500th of the atmosphere. That means to warm the climate by just 1\"C carbon dioxide molecules must capture 2500\"C of heat energy. That is bonkers. It also breaks all the laws of thermodynamics. \n\nMethane is 0.00017% of the atmosphere so its even more bonkers.\n\nHowever, the climate is changing. This is because of deliberate geoengineering programmes, in particular ozone thinning away from the poles. Though largely unreported ozone thinning effect is directly observable, this summer you will see a unnaturally bright sun just as we did last year. Under these conditions the pain felt when looking at the sun is not only from the increase in visible light but the much larger increase in infrared. \n\nClimate change is a programme to force change in accordance with the implementation of Agenda 21 /2030. Current events demonstrate this transition is well underway and will involve massive population cull through injected nanotech (re transhumanist programme). Agenda 21 also sees the permanent loss of all property rights with the introduction of universal basic income (ref NESARA/GESARA) and has/is being promoted by The World Economic Forum. \n\n'You will own nothing and you will be happy' WEF\n\nIn a depopulated world the surviving brainwashed and controlled population will be confined to mega cities. Carbon limits will be used to restrict consumption and liberty. Meanwhile the re-greened wilderness will be the exclusive playground of the ultra rich elite posing as conservationists. \n\nThe CO2 hoax amounts to the theft of the world and the enslavement of humanity by a parasitic few. \n\nWelcome to the future!\n\n_______\n\nI have included a debunking of 'accumulated heat' as it is so often used to explain how trace elements, so called 'greenhouse gasses', can warm the planet. \n\nAccumulated heat whilst sounding a reasonable explanation of how heat can build up is rather nothing more than gobbledygook. In fact it shows those using such arguments do not even understand what heat is. \n\nWhen we measure temperature we are measuring the heat energy a thing is losing. In short heat is a measurement of flow, the transfer of heat energy and this will always be in the direction towards the colder. For this reason a thing can never 'accumulate heat' in the way those advocating CO2 climate change describe. The temperature of a body is the measure of heat output, it can never be greater than the measure of heat input. Output = input. When a thing is warmed it is heated to an equivalent of the heat input. If this input is not maintained it will cool. Those that propose that heat can build up to be hotter than the total measure of heat input at a given time either do not understand what heat is or are being deliberately misleading. To illustrate, an object being heated by a flame can never become hotter than that flame, it's temperature cannot rise inexorably to the temperature of the sun for instance. Heat cannot be accumulated. When we think about it common sense tells us this must be the case. \n\nNASA and even Nobel Prize winning physicists have expounded 'accumulated heat' as the explanation how CO2 is able to warm the atmosphere. They claim that over hundreds of years CO2 has captured heat energy and this heat has 'accumulated' to produce a serious warming effect. As I have just explained, this is totally impossible and fundamentally violates all the laws of thermodynamics. That respected scientists should support such uneducated, unthinking nonsense is disturbing and only reflects that in terms of being able to think clearly about a subject they have no facility or inclination. These are the Dark Ages of science. Belief has outweighed logic or any critical thought. It tells us that we should not unquestioningly accept anything we are told, that experts can be fools. \n\n(NB: be aware of attempts to discard thermodynamics by talking about biology. \nEg. 'It only takes a drop of arsenic to kill a person.'\nThis would be somewhat desperate, muddled thinking. Clearly biological processes based on the reaction of a cell are not the same as the laws of physics/thermodynamics). \n\nAlso note there are many other basic contradictions in the CO2 climate hoax (eg that CO2 is highly soluble and is washed out extremely quickly in rainfall; that CO2 levels fluctuate drastically seasonally showing it is not a gas that accumulates; that climate change models deliberately ignore infrared in direct sunlight were they to do so the whole hypothesis falls apart as it means 50% incoming heat energy captured by CO2 will be lost (radiated) back out to space; that the anything that captures energy from direct sunlight will reduce surface temps - this is why clouds immediately reduce surface temps; that the earth loses heat extremely quickly as shown by the fact nights are always colder; that heat cannot be trapped in oceans as described as they are more 'energy dense' than the adjacent air; that increasing biomass increases CO2 because it increases the carbon in cycle; that correlation is not causation; that there is extremely dodgy Victorian science/politics behind Ice Ages which is never questioned or examined - eg mammoths despite claims otherwise are not adapted to cold but rather appear to be cold temperate animals similar to highland cattle, their blood is not antifreeze as claimed, they have no sebaceous glands, hair is long but sparse - even yaks being hairier, mammoth remains as far south as Mexico; that Milankovitch Cycles mean that the Southern Hemisphere is currently in the middle of it's Ice Age; that the hypothesis that burning of forest subsequent to Ice Ages resulted in warming is logically inconsistent as 'no new carbon' has been introduced into cycle this all being carbon already in cycle and in any case would be washed out almost immediately; that CO2 levels are at a geological low; that the oxygen cycle is intertwined with the carbon cycle and dependent on it; that life is carbon based and CO2 is essential; that a halving of CO2 levels would result in the extinction of nearly all plant species - problematic as it in turn means theorised measures of atmospheric CO2 during Ice Ages are unlikely to be correct - contrary there was a proliferation of megafauna; that the so called 'proofs' showing CO2 is able to capture radiant heat energy only prove the opposite and how very minor this is - that atmospheric concentrations of 0.04% CO2 thermal effect would be far too fractional to even be measured; that comparisons to other planets eg Venus/Mars prove CO2 does not capture the proportion of energy claimed and maybe this is why these comparisons are done less and less; that in order to explain vastly higher concentrations of CO2 in the geological past the sun is deemed to have increased its output this despite losing solar mass (gravitational mass) as fuel, this in turn meaning that the orbits of all the planets are all moving away from the sun - such hypothesis where solar activity is used to exactly compensate for holes in the CO2 climate theory is to ignore other evidential explanations of stars such as the 'electric universe theory'; that the geological archive shows periods of millions of years when CO2 and temperature were heading in opposite directions... etc). \n\nThe green industry is extremely big business pushed by the same multinationals involved in fossil fuels. In that respect their so called 'opposition' is a theatrical pretence for public consumption. Indeed if the petrochemical industry wanted to debunk CO2 climate change they could very easily pointing out that such narratives are in direct violation of the established laws of thermodynamics or basic common sense... yet they do not. It should be pointed out that the green agenda is the mainstream - promoted by media and corporate interest, Extinction Rebellion an elaborate Deep State psyop funded by George Soros and founded by Gail Bradbrook a corporate/Deep State stooge who previously liased with the UK cabinet to push 5G with local authorities. \n\nGreen policies are a method to promote 'hyper capitalism', taxes, insane industries (eg electric cars, wind farms, carbon capture etc) and the confiscation of basic freedoms. Dependent on rare earth metals that are incredibly destructive to the environment and polluting these green industries/electric vehicles and energy production actually are far worse than fossil fuels. THERE IS NO SAVING IN CO2 PRODUCTION. Neither are these rare earth materials present in sufficient quantities to mean anything other than rationing of the services associated with their use and necessitate vastly reduced human population (ref Iron Mountain Report, Agenda21, Wildlands Project, WEF Great Reset etc). In short the green revolution/sustainability represents the exact opposite, it is the accelerated trashing of the planet for corporate greed and corporations have been very successful in mobilizing the public behind this scam. \n\nThe carbon hoax is the theft of the world by an hyper wealthy elite who care very little about the environment and see the human race as idiots to be kept in ignorance and contained. \n\nThe damaging effects of green energy were highlighted by Ukcolumn news service on 25th Jan 2021. https://m.youtube.com/watch?v=xmUhZ2Q6Ddo\n\nI am aware that this information will be hard to assimilate. Nobody likes to think they are being duped and led into supporting the destruction of the very things they care about. \n\nThe figures quoted in this comment are all checkable.", "time": "3 months ago", "author": "Doobidoo", "channel": "UCyC0Af0-EE9uid0PaZRR0iQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQAZt03SaZXwqDp6Xho5pVQD_62KeEITfeI=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxOGGPF8dRRpJxQaWJ4AaABAg", "text": "So humans are changing the world... ???? ... LOL...\n\nNothing worse than the gate being open on the Zoo pen ; discovery of another real world without meaning; apes trying to be intelligent !\n\n Would you like a banana ???", "time": "4 months ago", "author": "Vito Amos", "channel": "UC5UhPUkux5PV--yw75xGdDA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTeR-NF-n_lfJ_dKygpX0FU0w8HT1f6RZuv1npq0g=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzZEXuuKbli12DCB-Z4AaABAg", "text": "lol what a dream worl", "time": "4 months ago", "author": "Jeffy Jeffy", "channel": "UCntu0y3QwIEufpFp4JXit6A", "votes": "0", "photo": "https://yt3.ggpht.com/sFe_KggFlOXckK8MXyTTnkz5pT1jOcU9pR55ZogvhTiCGKvmlUELgel0RsiBD3w0MGEu28vDuw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzIJH9SchuTnKpqA814AaABAg", "text": "Some more facts for you Sir David. \nhttps://www.youtube.com/watch?v=Qi7n8VvHHyk", "time": "4 months ago", "author": "Robert Jones", "channel": "UCfk7YtisFKiFUKZDCOxeVfg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSuTm_Ogz2KIGSUqeOf4mWcfMQgE7sX1mAbfA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxGvhf40h_QGkr8V0N4AaABAg", "text": "bilge", "time": "4 months ago", "author": "razz b", "channel": "UCG144RQOTG0rfj5DVM6jCmw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRYPRb_Bbzfxi1j-17EvLw6WQQ0Zx0_1xXYEw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgykuL8Ng9qLo6jMHtV4AaABAg", "text": "#Climatechange is real. No one believes in climate change more than me for we all have seen climate change from the three major Ice-ages recorded in history to the subsequent warming periods (which were the Medieval warming period in the Roman warming period). However, Anthropogenic global warming is a complete hoax. Carbon dioxide in the atmosphere has nothing to do with creating global warming.  CO2 Is currently 400 ppm. That is one carbon-dioxide molecule for every 2500 parts of atmosphere. Humans contribute only a scant 16 ppm which is 4% of the total CO2 produced in a year. CO2 only holds heat for a few seconds and there is not enough to drive climate- it is thermodynamically impossible and yet we are told it is true. Lastly, carbon dioxide will increase only after temperatures rise and conversely CO2 levels drop as  temperatures cool.  In other words,  CO2 levels are influenced by heat or the lack there of and therefore does not drive climate but follows climate. #globalwarming #climatechange", "time": "5 months ago", "author": "Sensei Kurt on the #Harpazzo / #Rapture", "channel": "UClj5S7b1CP1_QpXGtAz3AQA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLTwdqJ5Rw_6zSRDhmHGP63ouV-g7oJM7X0TvW7eyg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugxm2EgLxaG7E--IZS94AaABAg", "text": "China is finally doing some good.  See video ... \"China Tackles Climate Change\"", "time": "5 months ago", "author": "ClimateCraze", "channel": "UCpNje5Hgfp0VGL0u2uQmRQg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSGstks5TnRJLOlB-U8WP18ojqVcxooXXz56QNm=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugw7-7Vp73Dw1pAeLC94AaABAg", "text": "I learned it from lea forst Name Latif niyamiti*", "time": "5 months ago", "author": "Abdul latif Niyamati", "channel": "UCVoqsjIeUuod5v7htnHwpxA", "votes": "2", "photo": "https://yt3.ggpht.com/VkHD6vpSIPN_a9MmZcFBUkeBtWRjguDIzo6JDWHUHqtlxMuGQ6QLDBwo5J7fB2cIwubfZaHVJYQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugw9dwMLLWT5Grza3lB4AaABAg", "text": "We need to help I am only 8 I want atleast 1 kid in my life  people we need to help and it's not just me it's for everyone", "time": "5 months ago", "author": "curryisyacure", "channel": "UCARvlBhI5NM_nGFQCkIkz2w", "votes": "4", "photo": "https://yt3.ggpht.com/8auB66b3HgoAksmnMIhHb7p4WpCsYr46tY6fPLByImltRU5o8xSyBETryrO7fMxEzl_gPXU2iyM=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwbcMUZxMXWZu6-HVZ4AaABAg", "text": "The only way you can reverse this damage is by reducing the human population..............   you live on a planet which is a limited space, whether you like it or not that is the truth............. And like all limited spaces you cannot endlessly put something into them..................\n\n What's amazing to me. I never had a good education. I've never been to colleges or universities. In fact I've never had much schooling at all........... So I am classed by you lot out there as ignorant, uneducated, stupid, easily confused, don't understand anything.     that's what you look at me as been, yet\" I have bags of common sense. I have the ability to grasp reality. This is because I never went through this educated system and came out the other end totally brainwashed into thinking I can have endless growth in a space that is not endless..  Well  your well educated politicians believe that they can that's why they based their policies on endless growth and call it economic growth. and  the majority of people vote for them so you must think the same thing.\n\n. Every human being on this planet practices that basic law of physics, every single day of their life, that proves that  they cannot endlessly put something into something that is not endless......... You recognise all the limited spaces in your daily life............., except for the one you rely on for your existence your planet. All of a sudden that limited space is endless space and you can put an endless amount of people into it............. and that's what's coming from the mouth of people who have been through this well educated system.............  so it looks like I am not the stupid one.  you lot are.", "time": "5 months ago", "author": "Joe Wood", "channel": "UCGiPtbrpny6RarpkTdrfz2g", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLS63NstucXB0MVoeIK6xdTFv10Y25HdWiVl8hqH6A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyVEMJWgvsjnfo7C0J4AaABAg", "text": "People saying the earth has gone through climate change before are correct but we are the reason the climate is changing at the moment. Usually when the earth experiences climate change it happens over a long period of time to give life a chance to adapt. However we are not giving our self’s that chance. Humanity is better of not existing.", "time": "7 months ago", "author": "Thomas Van der Lugt", "channel": "UC9-z1sIw18TJfHMVEsqr-iQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLS-3u02jGaGkGJItXmz9f4FXqGRPkEgmLASDQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgztJhyDw5OVRAWaXVZ4AaABAg", "text": "Friends & families: pressuring me on having a car. \n\nMe an intellectual: Cars are one of the problems of climate change. 1. Production of cars 2. endless consumers. 3. crowded and polluted areas.\n\naside from that, Imagine every family and every individual has car and after a timeline of their lives, these cars will be trash.\n\nWhen I open this kind of topic on my friends and families they really don't care but their convenience. \n\nWe people are endangering other lives on earth. We are the intelligent parasites.", "time": "8 months ago", "author": "Jom", "channel": "UCz6rzAVCCdkrV7QrdSuAHKQ", "votes": "5", "photo": "https://yt3.ggpht.com/ytc/AKedOLRnoQoecAkVdebmtHGDzq9uW3S8Oqpi1ZTzRFmUkQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyTjthQ5o3UsboFx854AaABAg", "text": "It’s Yousaf", "time": "8 months ago", "author": "alt_smiley", "channel": "UCdc3BIr-oT9p8njqYYtld0g", "votes": "0", "photo": "https://yt3.ggpht.com/QYq0fEV6IW5ZFDH5aGsG2EdGf8xDNMMKVkkSgcD0TXF1vnZA97SXXx8M-Fop7WQdxf00n9VN=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxMSy5z9RvkBrPKKtd4AaABAg", "text": "Lol ishaq", "time": "8 months ago", "author": "alt_smiley", "channel": "UCdc3BIr-oT9p8njqYYtld0g", "votes": "0", "photo": "https://yt3.ggpht.com/QYq0fEV6IW5ZFDH5aGsG2EdGf8xDNMMKVkkSgcD0TXF1vnZA97SXXx8M-Fop7WQdxf00n9VN=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyX4ab1DGS5MJgn4EF4AaABAg", "text": "i love nature", "time": "8 months ago", "author": "Wilton Farm", "channel": "UCSTPUYkYY2udPdMBUiQdUqw", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLQ2L9KOcHQ30fWoxo2BBHLeXNqbCuRdSXn4PA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugxpdf0T733ChnpiZWV4AaABAg", "text": "Greta was right and its obvious pathetic greedy people who dont like change attack genuinely good caring people who want to help the planet and peoples future. David attenborough has travelled the world, he has seen it with his  own eyes and this man doesn't lie when it comes to nature", "time": "8 months ago (edited)", "author": "Brian Lloyd", "channel": "UC3Wu8TkvJx8rpLwEIedU3Yw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRGLB3xlEkKLtXOa4zNFtZNY38AuXr3P07IU1hk8w=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyvT-rwGFnN61RxnhJ4AaABAg", "text": "ITS NOT A BIG DEAL before u @ me just listen to what i have to say. this has happened before, naturally, we were not involved and had worse conditions! and nature found a way to get rid of it. WE DONT NEED TO WORRY! and if by chance u didn't know,  trees turn co2 into oxygen so... you know.... WE ARE FINE", "time": "8 months ago (edited)", "author": "Crafts For You", "channel": "UC2khK2bRPgMtGlxeOfCluEw", "votes": "0", "photo": "https://yt3.ggpht.com/vIR_bA-kXUBj5RUARhdLMYOrl2zYZY6DRcryYHL2RUTQGzHwv18uFDoAvRf4J54xMiZmghFbkQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugw9dwMLLWT5Grza3lB4AaABAg.9MkaJv62ITH9NC6lbDKIJ5", "text": "Please see the video ... \"Climate Change and the Garden of Eden\" ... and all will be well.", "time": "5 months ago", "author": "ClimateCraze", "channel": "UCpNje5Hgfp0VGL0u2uQmRQg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSGstks5TnRJLOlB-U8WP18ojqVcxooXXz56QNm=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyX4ab1DGS5MJgn4EF4AaABAg.9JAqKAzNTxZ9NC7DJeMrRS", "text": "Great nature video ... \"Seeing is believing\"", "time": "5 months ago", "author": "ClimateCraze", "channel": "UCpNje5Hgfp0VGL0u2uQmRQg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSGstks5TnRJLOlB-U8WP18ojqVcxooXXz56QNm=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyvT-rwGFnN61RxnhJ4AaABAg.9IoNNhYTXFq9KBCDDB7owU", "text": " @Jiddy  preach king 😨😨😨", "time": "7 months ago", "author": "ewe", "channel": "UCYRfa-AzUC1PqtT54eumAhg", "votes": "0", "photo": "https://yt3.ggpht.com/zD7-yEeTF_7pJ93zvsKRySWi7XnCgpNbfU_6g81q_d4h3OXEMCRuLhRZvwEJXmezTpsA_HAtVEA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzLZ-nuZRjlZjvqcLh4AaABAg", "text": "why\nwhat do we have to do with water rising why", "time": "8 months ago (edited)", "author": "intern :D", "channel": "UCb1ghdVI7_qLdFRWZlgmaDA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTVWWrste0GGXjd4OPcMs1ibTsbND3DkYRRBnAiZA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyyBM5WwhkV__lkSlZ4AaABAg", "text": "Boris, Biden, ken Jong un, whoever pleas save our planet !!!!!!!", "time": "9 months ago", "author": "Rowan Wightman", "channel": "UCzm5_uhXh7bWqL-isu1xX_w", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRZiemYjfJc002Azgm3W8cm8-x8enTag1He0ywilg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugza0dJt94jaKg56xl14AaABAg", "text": "I love the simplistic formula of these moronic broadcasts. Get a sanctimonious celeb with no idea about science to whine on about natural events whilst studiously avoiding the provision of empirical evidence for the doom message. It is the blind leading the blind", "time": "9 months ago", "author": "Bertie Blue", "channel": "UCGyI5Vb4RPWfeWdBtlPgRbw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRJ_rTYSBHULVC-ghq9rnZ1UyiarxWjT_gMe7aJ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzckqBxT_yFs6IL7Pt4AaABAg", "text": "This guy needs a carer.", "time": "10 months ago", "author": "Matt H", "channel": "UCSWKYt1H0vVJ8uhAyh1X6bA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLTfSWmZ8aP5QkLWBfABXzAQVA8lP4aWCi2z27QrAQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgylCMkBs40fJCYpirx4AaABAg", "text": "YOU ARE THE TRUE SCIENCE DENIERS. CO2 SPIKES TO 390 PPM BUT NO SPIKE IN GLOBAL TEMPERATURE.\n35 years of failed and fake climate change predictionS!  News flash: 2020  THE ICE IS STILL ON THE NORTH AND SOUTH POLES AT NORMAL LEVELS (NASA PHOTOS). THE GLACIERS ARE NOT COOPERATING (NASA PHOTOS)!THE al gore POLAR BEARS ARE STILL THERE (ALASKA WILDLIFE SURVEY). THERE IS NO FAMINE, CROP FAILURES, MEGA FIRES, FLOODING, DROUGHT,  GLOBAL catastrophe  AND DEATH LIKE YOU FOOLS ASSURED US WOULD HAPPEN BY 2020 (LOOK OUTSIDE YOUR DOOR).  FLORIDA, SAN FRANCISCO, AND ENGLAND ARE NOT UNDER WATER LIKE YOU ALL SAID THEY WOULD BE.  IN FACT THE OCEAN HAS BEEN RISING AT A STEADY  2.8 MM A YEAR SINCE LINCOLN..STILL 2.8 MM A YEAR NO CHANGE IN THE RATE OF INCREASE LIKE YOU ALL  STILL LIE TO US ABOUT HOW YOU ARE MEASURING SEA LEVELS (NATIONAL TIDE GAGE DATA).  SAY WHAT YOU WANT AND KEEP PREDICTING THE SAME  BULLSHIT BUT YOUR PREDICTIONS HAVE ALL FAILED FAILED FAILED.... YOU CANNOT ESCAPE FROM THAT FACT!! YOU COME UP WITH COMPLEX IDEAS USING JUNK SCIENCE AND SCARE TACTICS YEAR AFTER YEAR OF WHAT IS GONNA HAPPEN AND STILL NOTHING HAPPENS EXCEPT YOU DEMANDING OUR MONEY, PROPERTY AND RIGHTS (HOW DARE YOU)!! ...WHEN ARE WE ALLOWED TO NOT BELIEVE YOU AND CALL YOU THE SOB'S that YOU REALLY ARE...!!!!  👀", "time": "10 months ago", "author": "BRIAN ROGERS", "channel": "UCXVH_RNoAwjkKE6ocZ0KVfA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQSMLfP_qH29yVJGGwSOaUlbaNYLG8ImxXlTo62=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwxeUr-0qzw-i2MDQV4AaABAg", "text": "David Attenborough is a climate alarmist and a compulsive liar.much of his footage on climate change has been shown to be faked and totally incorrect...Attenborough should be given another award which says, King of fools\"", "time": "1 year ago", "author": "Benjamin Falzon", "channel": "UCnagNKYVUcSW1oP950d4tEw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSyr9uho9309iO5LZJ57TPp__6CEcR_n7kaEQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwyxiGi2fElMxKlZ3Z4AaABAg", "text": "laughed my ass of when i say greta thunberg", "time": "1 year ago", "author": "zein_ion", "channel": "UCnpkx9tk8kkXpzxRuQi5YTg", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLTI7C3N3A3_TlL8vVv6DXrJbvsxOX9u3xh1FlT0WA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugzps3zMeDDzYdRspu94AaABAg", "text": "your right", "time": "1 year ago", "author": "Hello", "channel": "UCUsHd5zdVtA4LudT44cjzHQ", "votes": "0", "photo": "https://yt3.ggpht.com/wU4x8bOz212vS6dkNpCDAhOd-aSsyeSFbt_zTOp3VpJA5MmtbSqq3Z5ivDlNLLTp-QP2wCqZ_Q=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwXkzR3iZzHiyEydo94AaABAg", "text": "Middle class liberal sophistry at its very best.xx", "time": "1 year ago", "author": "acidsunrise", "channel": "UCZNt4IES-rh5Q9tau_bLq5w", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQ29hpIJumxibZEDAXvnjhuAOxxTm_u8W0fEw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugzi9IjQYskGyaFILS94AaABAg", "text": "Have you watched this? https://www.youtube.com/watch?v=T--ufvHXENg", "time": "1 year ago", "author": "compelthemtocome luke1423", "channel": "UCJa5FZFzfkqIOaP8Z6eayJQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSXshuvfvS6tVluuVK5mT6IxSxlAJeRncKg8Blk=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx6ONvXNkunYbImZRh4AaABAg", "text": "Pure alarmist bunk. Please watch my film, it will change your life. https://youtu.be/aRdqYRS3GMo", "time": "1 year ago", "author": "Malcolm Shaw", "channel": "UCcqO-ivwNFJBOCKxVqaYtJw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRL67z-GW_22pLxzMD6bYCnIu0HopUCQfyyUUA0KA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxxegI2tr2o4vYMjz14AaABAg", "text": "CORONA is the answer....", "time": "1 year ago", "author": "Murtaza Simari", "channel": "UC9NiymgzIdV5YoYdSyZnpzA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSozGvz219rTbnkUrx7GMRmNvKfz4XUMw25xQSp=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugyozqapfr5EezUGVJ94AaABAg", "text": "You are disgusting Attenborough what are you going to say when mixed up children of which there is a hell of a lot more than when we were young start committing suicide because they think there's no hope because you with the BBC have been lying to them, crying on TV showing an Albatross feeding its chick with lumps of plastic you well know that that's perfectly normal its helps grind up their food in the stomach usually its floating pumice they use but plastic does the job just as well they will either regurgitate the plastic later or it will come out with their droppings and you know that if you did not what kind of  wild life man are you, pathetic, then there's the Walruses committing suicide by throwing themselves of cliffs because somehow their upset by climate change, what the BBC did not show was the polar bears chasing them when the truth was out the BBC choose another narrative that the Polar bears were only chasing them because they were driven to it by starvation because of climate change and polar bear numbers are dwindling but the reason they went after walruses is because they are thriving in the Arctic the inuit are saying there's too many its become dangerous for the inuit to hunt now, starving polar bear one photo told a big lie, Attenborough has been caught his cred now is out the window by real environmentalist like Patrick Moore a co founder of Greenpeace, Patrick shows the film of Attenborough crying over the Pelican chick disgusting fraud, those kids blood will be on your hands I used to love watching his programs since I was a child but now I have nothing but contempt for him plus he's still lying today.", "time": "1 year ago", "author": "Joe Black", "channel": "UCx2Or5mc6utsRANkF4JbQsQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTdXfoQfeBk4WqlAFx3ss5qIbA_zR9xPjXfDNZ_0Q=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyXw23sU0nmxz8nIAh4AaABAg", "text": "Where is the evidence that switching energy sources will not have detrimental consequences to the climate?\nIt is naive beyond belief to think that a sudden change will not shock the climate.", "time": "1 year ago (edited)", "author": "petegiant", "channel": "UCkIebgkKG2JEc1JH-dviRqA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQDa093EK3hwOR_DyN5uygTAwFQC7IeuzF6EQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzDmEvMeWIIdiX9WlJ4AaABAg", "text": "The bible says that God will eventually Judge the world . There is no scenario where the weather destroys the earth . Climate change is just that ..a change in climate . We don't destroy the earth in the end , God does when He decides.", "time": "1 year ago", "author": "MrBazinthenow", "channel": "UC3fFA_dKh0TJLmvTHU5m2TA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTutUM9iZY601iOeLTbK2FH1l7pVVyuNR58vQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugz1im1GZMmbo560VNV4AaABAg", "text": "wrong.... and not even close...  Firstly the reason our climate changing is well, well known, Any one who reads cuneiform texts  from Assyria, Babyon, Hittite and Egyptian texts can tell you why, how the climate is changing, and.....its not by Man!!!!  Any amuture astronomy can also tell you why... yet Astronomy isnt taught in schools or collages anywhere in the world!!\ni will leave a few links explaining real facts!!!\nits called....   Vernal heliacal rising / Earth percession\n\n1, The Earth wobbles on its Axis.\n2, As the Earth wobbles back and forth... the Equator line moves UP AND DOWN!!... are you stupid you dont see it!!\n3, The Earth wobbles from 23 degrees to 0 degrees\n4,  Each complete cycle takes around 2500yrs its called an Age.\n5,  We are leaving the Age of Pisces and entering the Age of Aquarius\n6,  2500yrs / 23 = 1 degree of Earth tilt for every 110yrs\n7, 1900 - 2010 the Earth tilted 1 degree thus shifting the weather and movining the seasons..\n8 The Ancients were well awear of this fact and recorded it MANY TIMES IN STONE IN TEXTS!!\n\nHowever the goverment cant tax us on the movement of the Earth, so instead tell us we are to blame so they can enforce a tax system thats an inexhaustible income for them... The Earth wll continue to move on its axis and in 148yrs the earth will be at 0 degree at its hottest.. then the earth will move and reset brnging in far colder weather, and the goverments will blame you and increase taxs... Google earth percession!!!!!\n\nwant to learn why and how the ancients recorded seasons watch here https://www.youtube.com/watch?v=rUmZ3u_Ufr4&t=345s\nwant to learn how and why the ancients recorded Earth percession, the 2600y cycle of Ages to the 5000y cycle watch here https://www.youtube.com/watch?v=SFfMYFJDBg0", "time": "1 year ago (edited)", "author": "Its my Bike", "channel": "UC-Ok7soKqPnlf60Pc9eQv8g", "votes": "1", "photo": "https://yt3.ggpht.com/ePU03doEMttgx6gs9imfl4fc1otdwydxg7R1egAbbp-z9MWQZfM5qFvqGDZYeNN-f5GE5CgqcUw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx1m9ILbTh5Xv0Dthx4AaABAg", "text": "What a load of shite.. climate has been changing for billions of years. Sun gets hot, Earth gets hot. Sun gets cold, Earth gets cold... it's nothing to do with anything else.\nDavid Bellamy was correct.", "time": "1 year ago", "author": "mulli mulli", "channel": "UCOqYGnwpZ1fxN4ytQmL60Xg", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLRm8oQOxjHyUyfmY8Apok7MLM1wg55cAX-NGxeY=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxOp_MGQdjfBfP7x-F4AaABAg", "text": "CO2 reduction Will not stop climate change , but it Will maybe help to live a more healthy life . The emergency signal in Europa will only Hurt thé lower class working People by charge them with more taxes . Thé leading figures are getting rich with their acting scripted by europe dictate.", "time": "1 year ago", "author": "nico Bike tec", "channel": "UC3hQXJNw8eifoKVWRpkUpPA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLR1c2AAuvoBiLTeJX4V7nNLURqTvHR4VVspaw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgykUIZRbIWUKHIThNt4AaABAg", "text": "https://youtu.be/Z9W7_iDAdiY", "time": "1 year ago", "author": "Carmina Montoya", "channel": "UCd4WeUahWbYelQ2-ktyG-gg", "votes": "4", "photo": "https://yt3.ggpht.com/ytc/AKedOLRDi5Xm2yCGXqDsM6urbA7qwoI_tCoY_LCSdA=s176-c-k-c0x00ffffff-no-rj", "heart": true}
{"cid": "UgxX4Ju_oIbdku1sLmB4AaABAg", "text": "I've enjoyed  and respected   Attenborough in the past.  Sadly  now I think he  has lost it there are other scientists with  opposite  views  and to me  seeing the  silly tricks  used  fake graphs  part truths  obvious economic  fallacies  I just don't believe it .Water vapour is the major  green house gas  Almost every day I see  the sky covered criss crossed with  \" vapour  trails \"  which persist and coat the sky day and night  with a warming blanket.  I would like to see a clear winter sky when  the temperature  could drop and Gods creation could be seen  Then occasionally there are no  \"vapour trails\"  and its cold  Where  have all the  creators   of vapour trails gone ?", "time": "1 year ago", "author": "David Cook", "channel": "UCQcWNhx5CvnWHLxNIjqiFcg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRgz5S8KNNdnMOy31UuBRYala0HBqDa8_3jFw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzLZ-nuZRjlZjvqcLh4AaABAg.9IjXx-BzvkF9IoNPD443c8", "text": "ikr", "time": "8 months ago", "author": "Crafts For You", "channel": "UC2khK2bRPgMtGlxeOfCluEw", "votes": "0", "photo": "https://yt3.ggpht.com/vIR_bA-kXUBj5RUARhdLMYOrl2zYZY6DRcryYHL2RUTQGzHwv18uFDoAvRf4J54xMiZmghFbkQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzLZ-nuZRjlZjvqcLh4AaABAg.9IjXx-BzvkF9Jebi1AIFK0", "text": "melting the ice caps you fucking spanner", "time": "8 months ago", "author": "meme meme", "channel": "UCpEAfyIjwNy5B7xgYjwwBiQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQmReUpT0HmL5flJGa2PWkZPOifcSmsUCSAAKYpwg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzLZ-nuZRjlZjvqcLh4AaABAg.9IjXx-BzvkF9Jej2S1edze", "text": " @meme meme   you are gay and give up trying to save the ice caps  just let it linger", "time": "8 months ago", "author": "intern :D", "channel": "UCb1ghdVI7_qLdFRWZlgmaDA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTVWWrste0GGXjd4OPcMs1ibTsbND3DkYRRBnAiZA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzLZ-nuZRjlZjvqcLh4AaABAg.9IjXx-BzvkF9KDO_0wICk0", "text": " @Endative   i am not racist ima millionare", "time": "7 months ago", "author": "intern :D", "channel": "UCb1ghdVI7_qLdFRWZlgmaDA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTVWWrste0GGXjd4OPcMs1ibTsbND3DkYRRBnAiZA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzLZ-nuZRjlZjvqcLh4AaABAg.9IjXx-BzvkF9KDkRtAIxcg", "text": " @Endative  bruh why u asking first u", "time": "7 months ago", "author": "intern :D", "channel": "UCb1ghdVI7_qLdFRWZlgmaDA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTVWWrste0GGXjd4OPcMs1ibTsbND3DkYRRBnAiZA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzLZ-nuZRjlZjvqcLh4AaABAg.9IjXx-BzvkF9KE3aoTqXbp", "text": " @Endative   I AINT", "time": "7 months ago", "author": "intern :D", "channel": "UCb1ghdVI7_qLdFRWZlgmaDA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTVWWrste0GGXjd4OPcMs1ibTsbND3DkYRRBnAiZA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyyBM5WwhkV__lkSlZ4AaABAg.9INdM2j7ewC9NCAlLZVyQd", "text": "John Kerry new video does that ... \"The Millimeter Tidal Wave\"", "time": "5 months ago", "author": "ClimateCraze", "channel": "UCpNje5Hgfp0VGL0u2uQmRQg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSGstks5TnRJLOlB-U8WP18ojqVcxooXXz56QNm=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzckqBxT_yFs6IL7Pt4AaABAg.9Gbz-1hP2V09NCB0L-7nGU", "text": "He should follow Kerry's example video ... \"The Millimeter Tidal Wave\"", "time": "5 months ago", "author": "ClimateCraze", "channel": "UCpNje5Hgfp0VGL0u2uQmRQg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSGstks5TnRJLOlB-U8WP18ojqVcxooXXz56QNm=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgylCMkBs40fJCYpirx4AaABAg.9GIBeeUJxIs9HRWy30mlqW", "text": "OK first when Co2 spiked to 390 PPM the temperatures didn't rise because the oceans absorbed the heat and the co2 (not good for them ). So if you did a little research you would have got that. Second yes ice is still there and polar bears are still there, but there is a difference between \"there\" and \"will be there in the future\".Just because something exists today it doesn't mean it will in the future. There are 2 white rhinoceroses in the world, that doesn't mean they will be there in the future. About the sea level rise, it's increasing, it's just 2.88mm now, it's going to go up. Lastly yes i agree that the models may be faulty and haven't got much right but just because they may be wrong, it doesn't mean they will be wrong in the future. If you were on the titanic and someone told you that the boat may be heading to the ice berg but they weren't sure, would you try to redirect it. Inaction is always worse.", "time": "10 months ago", "author": "Kunal Kashyap", "channel": "UCfLF49PBpSdvTuU5CnYn2xA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLS6KQebqtBs3xskAh1B4OdrGIMCpnCcUm-XAe_qMQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwyxiGi2fElMxKlZ3Z4AaABAg.9D_LKwQNQpz9NC7cx3eOSu", "text": "Climate Czar video does too ... \"The Millimeter Tidal Wave\"", "time": "5 months ago", "author": "ClimateCraze", "channel": "UCpNje5Hgfp0VGL0u2uQmRQg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSGstks5TnRJLOlB-U8WP18ojqVcxooXXz56QNm=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwyxiGi2fElMxKlZ3Z4AaABAg.9D_LKwQNQpz9NUk8b0Y3Vv", "text": "I laughed at your spelling mistakes lol what’s so funny about Greta?", "time": "5 months ago", "author": "Georgia Crossley", "channel": "UCW38o_3NnZfXg8etpEDl41w", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSnYyogFX8NvVLSn8G6v3DejiIjXirUqHaIBQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzDmEvMeWIIdiX9WlJ4AaABAg.95ESUx_4-tq95FLhGTNRhx", "text": "But you are blatantly ignoring the possibility of devils play. Devils temptation. The devil laid traps even for Jesus! Denial of climate change is the ultimate trap set by the devil! After all God tasked us humans to look after the flora, fauna and 🌎 🙏🏿", "time": "1 year ago", "author": "The Conclave", "channel": "UCQz8yu0o16KOhmiljz_aVeQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLTNsWjvlAiDh99z_sR9KmxDell9w-12ko_lVmLhiQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzDmEvMeWIIdiX9WlJ4AaABAg.95ESUx_4-tq95FTG5_cud2", "text": " @The Conclave  There are no verses in the bible where the earth is destroyed by natural causes ,or caused by mankind . The bible is clear that it is God who destroys the earth to make a new heaven and earth. \n\neter 3:10 ESV \n\nBut the day of the Lord will come like a thief, and then the heavens will pass away with a roar, and the heavenly bodies will be burned up and dissolved, and the earth and the works that are done on it will be exposed.\n\n2 Peter 3:7 ESV \n\nBut by the same word the heavens and earth that now exist are stored up for fire, being kept until the day of judgment and destruction of the ungodly.\n\nMalachi 4:1 ESV \n\n“For behold, the day is coming, burning like an oven, when all the arrogant and all evildoers will be stubble. The day that is coming shall set them ablaze, says the Lord of hosts, so that it will leave them neither root nor branch.\n\nRevelation 21:1 \n\nThen I saw a new heaven and a new earth, for the first heaven and the first earth had passed away, and the sea was no more.\n\n. In Genesis when there was a Global flood this was not caused by plastic bags and fossil fuels . God caused this to happen .", "time": "1 year ago (edited)", "author": "MrBazinthenow", "channel": "UC3fFA_dKh0TJLmvTHU5m2TA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTutUM9iZY601iOeLTbK2FH1l7pVVyuNR58vQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzDmEvMeWIIdiX9WlJ4AaABAg.95ESUx_4-tq95FTgNLvVP9", "text": " @The Conclave  2 Peter 3:10-12 \n\nBut the day of the Lord will come like a thief, and then the heavens will pass away with a roar, and the heavenly bodies will be burned up and dissolved, and the earth and the works that are done on it will be exposed. Since all these things are thus to be dissolved, what sort of people ought you to be in lives of holiness and godliness, waiting for and hastening the coming of the day of God, because of which the heavens will be set on fire and dissolved, and the heavenly bodies will melt as they burn!", "time": "1 year ago", "author": "MrBazinthenow", "channel": "UC3fFA_dKh0TJLmvTHU5m2TA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTutUM9iZY601iOeLTbK2FH1l7pVVyuNR58vQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzDmEvMeWIIdiX9WlJ4AaABAg.95ESUx_4-tq95FUP9LfRhn", "text": " @The Conclave  Yes we are to tend to the fields and animals . It's good to take care of resources and this is Gods creation  . But this is not the same as the ' climate change ' hysteria.  This is coming from Evolutionary thinking.  That there is no God . Its all natural and everything is just a chemical reaction . They see that its finely tuned but dont see who has done this and who is in control of the earth . Sure we can make the food we eat and the waters we use miserable to use , but this is not how things end. God destroys and finishes things in the end .", "time": "1 year ago", "author": "MrBazinthenow", "channel": "UC3fFA_dKh0TJLmvTHU5m2TA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTutUM9iZY601iOeLTbK2FH1l7pVVyuNR58vQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzDmEvMeWIIdiX9WlJ4AaABAg.95ESUx_4-tq9HRVVh9QYUH", "text": "OK please don't bring god into science. Thats just the worst thing you can do.", "time": "10 months ago", "author": "Kunal Kashyap", "channel": "UCfLF49PBpSdvTuU5CnYn2xA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLS6KQebqtBs3xskAh1B4OdrGIMCpnCcUm-XAe_qMQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugz1im1GZMmbo560VNV4AaABAg.93teHgAJlYl96Omq6yfqt2", "text": "This is far more relevant to the situation apparently and I wasn't even told this - don't recall it being taught at primary school either. It's typical though - as is the case with another example, my fascination in archiving railway heritage, it is one of those things that are classed as specialised subjects for specialists not to exploit, at least at large, to the general public; that perception ought to be turned around more prominently. Quite a lot of people, including supposed experts in the world's issues, would benefit. As for extinction of species, again a far more direct and personal explanation that is lack of love is far more worth in value than any overreaching scientific detail can ever elaborate. And don't get me started on the whole meteorite collision riff; I never quite believed that anyway. Samuel F.", "time": "1 year ago", "author": "samuel Farris", "channel": "UCR8VbEVtZDzqDdnxjYzsF8g", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTYVyDVb4J_4alBSOR-IltbaXwFOw6-iHWpzrG2=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugz1im1GZMmbo560VNV4AaABAg.93teHgAJlYl9HRW0SkVhdA", "text": "Ok taking your point about the milankovitch cycles, one thing you missed is that the Earth should be cooling. The milankovitch cycle last for about 100,000 years, in that 10,000 the Earth heats and the rest 90,000 it cools. We already finished the current cycles years of heating, so why is the temperature going up???", "time": "10 months ago", "author": "Kunal Kashyap", "channel": "UCfLF49PBpSdvTuU5CnYn2xA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLS6KQebqtBs3xskAh1B4OdrGIMCpnCcUm-XAe_qMQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx1m9ILbTh5Xv0Dthx4AaABAg.92qDPnYEBTv9INi8_DJOtV", "text": "What a fool", "time": "9 months ago", "author": "Laurence Smith", "channel": "UCFEgmNGAak8HOsWJdRDKzQQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSb65SBDJ8ZNhPTEJOL_oExmNFLpzw1oKzyV5z2Vw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx1m9ILbTh5Xv0Dthx4AaABAg.92qDPnYEBTv9INjzscXo-4", "text": " @Laurence Smith  who?", "time": "9 months ago", "author": "mulli mulli", "channel": "UCOqYGnwpZ1fxN4ytQmL60Xg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRm8oQOxjHyUyfmY8Apok7MLM1wg55cAX-NGxeY=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx1m9ILbTh5Xv0Dthx4AaABAg.92qDPnYEBTv9INkLTUXP16", "text": " @mulli mulli  quite clearly and obviously, you.", "time": "9 months ago", "author": "Laurence Smith", "channel": "UCFEgmNGAak8HOsWJdRDKzQQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSb65SBDJ8ZNhPTEJOL_oExmNFLpzw1oKzyV5z2Vw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx1m9ILbTh5Xv0Dthx4AaABAg.92qDPnYEBTv9INm7ApwGat", "text": " @Laurence Smith  oh rude! \nOK well,  I'd be interested to hear what your thoughts are on the subject of climate change.. assuming you're not a nincompoop and have something worthwhile to say", "time": "9 months ago", "author": "mulli mulli", "channel": "UCOqYGnwpZ1fxN4ytQmL60Xg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRm8oQOxjHyUyfmY8Apok7MLM1wg55cAX-NGxeY=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx1m9ILbTh5Xv0Dthx4AaABAg.92qDPnYEBTv9ISCtBk5_bB", "text": " @Laurence Smith  👈🏻 quite clearly and obviously a dirty little Troll", "time": "9 months ago", "author": "mulli mulli", "channel": "UCOqYGnwpZ1fxN4ytQmL60Xg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRm8oQOxjHyUyfmY8Apok7MLM1wg55cAX-NGxeY=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzFgxO5HsqLt_XXD4B4AaABAg", "text": "Look at a film with facts in rather than a propaganda one. No wonder all the kids are scared!!", "time": "1 year ago", "author": "zoe lane", "channel": "UCNNdoLd0WSDZ1Ga_vr6sntQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTRK2oK55tgQZN-bYpU6diEZRgM9_VOmkeGxQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyyHtjLyOLcOmYus0V4AaABAg", "text": "So evidence that the climate is changing but yet again.. no evidence that it's being changed by Man. This isn't a video claiming polution is caused by man.. which it is.. It's frustrating really. I so wanna see the real evidence and the counter arguments laid out.. ... :)", "time": "1 year ago", "author": "keith newby", "channel": "UCQIrVMKeZAN51mMVNZvuFHQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSlx4m6BkMNxDKI6EWMG8V0FwXv-yLXCCsIhcrdfw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxZLpTZsWzliug8vPJ4AaABAg", "text": "2:48 AHAHAHAHAH! My goodness, what a dream world!", "time": "1 year ago (edited)", "author": "Ritternkreis", "channel": "UCsVBAnREx10_lWJ8COz7J4Q", "votes": "4", "photo": "https://yt3.ggpht.com/ytc/AKedOLQ9IzEZAV28YfpGNcKcU7qu8Q1y3cnvsm2SNA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx8CubHE6iN5nx-JvJ4AaABAg", "text": "I understand the sentiment but they do realize that solar and wind can't meet our needs and furthmoore they are made with refined goods.", "time": "2 years ago", "author": "dave Embury", "channel": "UCQNBCkY_fYPdASHOFXHea7w", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQOQWErcA2aqUAnVffggJSxPN1HNm2G6McWzA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugy6hoNgqJ5YpXIXqBx4AaABAg", "text": "BULLSHIT .... DAVID BELLAMY CALLED YOU OUT AND YOU SACKED HIM", "time": "2 years ago", "author": "Vasili", "channel": "UCjdSpEX3-kjwmUgWiohucBQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTm1_oUsdxn-hPY9kNuuFBXuRTYgPMaV_TZhqgEjg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzedbdTMRWY4sf3QFt4AaABAg", "text": "Some people are doing quite well out of this hoax: https://climatealarmism.news/2018-03-13-how-al-gore-became-carbon-billionaire-profiting-climate-fear.html", "time": "2 years ago", "author": "James Chambers", "channel": "UCxMPH2LtSh9rk2LtmOHn42Q", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTRAKtXG2YikmjGogiQd3-uO2f6NAGOb6cTMQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwBwsjorXT5C_EI6Md4AaABAg", "text": "Scary dramatic video.... I didn't see many charts though? No facts other than it is going to happen and how bad it is going to be. Oh and of course the message is to stop burning oil. So other than sound really scary and dramatic didn't say much to me.", "time": "2 years ago", "author": "Roy Mackey", "channel": "UCz1BFYxehEQiSUqydWORPEw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRARxoFmklyPw41NE-0pjvmkv4d7HQx8kvHP8sP=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgykQmlOOw4kWnbP1YJ4AaABAg", "text": "earths natural cycle, it heats and cools itself and has been doing so for billions of years. Dont get me started about the ozone layer as it repairs itself and has never looked so good since scientists first discovered it. FACT", "time": "2 years ago", "author": "im Conspire", "channel": "UCPAbYkIfeL9cgN14VamlbWQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLTWwEqJ1bfLyH5wZvstStooqpGR1RHoTkx07kbO=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgycMVZnnXBYFVJA2ll4AaABAg", "text": "This is crap! watch this https://www.youtube.com/watch?v=JmtytPiTZAo", "time": "2 years ago", "author": "Don Brock", "channel": "UChMj2IPK70TGa4Dz8JpfnJg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTvNhu-xKPakB_V9o_I4MAp_CbmQkgxDn2qPhKM=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugyb95dNWQ5WWwI4sUp4AaABAg", "text": "Who would have thought that sound leadership could be sort in aspergers and (now) dementia. Climate activism is quite the consortium of phrenic lurgy. What next- schizophrenia? Oh, wait,...", "time": "2 years ago", "author": "modvs1", "channel": "UCg0TffMKnF_-Q7tEjQhh7MQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLS3DzNch9lZE3d2Isckl-mWaGHhV0dWaUu-DF6y=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwfQsc53j-3Y4ZlRSR4AaABAg", "text": "Long on fear, short on facts. Proof or just this bald assertion.\nClimate change is fear porn.", "time": "2 years ago", "author": "misterkel", "channel": "UCf9iiPITcS4Fs4yD5k8HsVg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQ7VhzanHIMcHIYYc9BBJEhby61SqhAWpf53CPY=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugyqa9I6vTzAWfPqmH14AaABAg", "text": "sir david attenborough still silent on: \r\nThe illegal hunting of foxes.\r\nBadger culling.\r\nDeer hunting.\r\nWind turbines killing thousands of birds and bats each year.\r\nThe continued felling of trees to make way for the 5G network.\r\n5G shown to be killing wildlife.\r\nFracking wrecking wildlife habitats, releasing tonnes of methane\r\ninto the atmosphere and killing wildlife.\r\n\r\nHe doesn’t care, never has and never will.", "time": "2 years ago", "author": "John Williams", "channel": "UCO05uG9TVgrzU8941N8uAyg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRWTR_nkK9XSilc60zL60ElcfQgrK6-iRY_R-RK=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxcWelItor-VI704Bd4AaABAg", "text": "They need to start hitting all the big cooperate companies cause they are causing the largest portion of the pollution by mass productions on a daily basis. This is the result of greed. We cut trees down and produce C02 and such a insane rate we are literally committing global suicide. The more we cut trees down the less trees there are clean the air of C02 and the oceans become more polluted then you add the all the cars and industrials spewing out C02 by the millions each day all over the world... if you have a child born today your thinking about their future not your own.", "time": "2 years ago (edited)", "author": "Holy Gucamole", "channel": "UCAsqprmK70Z6kQCOIwD-Ldw", "votes": "4", "photo": "https://yt3.ggpht.com/ytc/AKedOLSaumEpawoMy_6CgK5kE-1kZsdVkAMhpTApivQi=s176-c-k-c0x00ffffff-no-rj", "heart": true}
{"cid": "UgwvQIx3zhfi6KYsCvt4AaABAg", "text": "Sir David Attenborough is a nutcase.", "time": "2 years ago", "author": "timobrienwells", "channel": "UCeWcCZwsjSYs_Z6e4SMoKGg", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLRAiaV-uqQSs003Kfu0LgzlPzGsgq8KfthDFQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugz5xLoiBx9F4Ki5ua14AaABAg", "text": "I will just go ahead and say it, BULLSHIT!!!LoL", "time": "2 years ago", "author": "xslayer14", "channel": "UCYCQFGo8V7cbch8UoMlqQyg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTqBOENIIT6LUVCHm6TbIdwzyFaU3a-pG57Ktu7=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwfU2xOr9pVm3lQWHt4AaABAg", "text": "I like David A. I love his nature documentaries. But he is NOT a god, and many seem to believe. And these are NOT facts, in the assertions of man made climate change. If only people would look at the non climate alarmists, and their documentaries and commentaries AS WELL!! People would get an entirely different picture. \nOne fact, scientist who argue that man-made climate change is not a big factor, frequently lose their funding by political governments, and therefore their income. You ONLY get funding if you argue for man-made climate change.  That opens up for world wide psuodo science.\nAs for using CHILDREN to demonstrate and be the voice. OMG!!! Children are NOT as educated, or wise. They are children, who will listen to the loudest voice, whether the voice is right, or wrong. They need to learn to read and write, then learn objective thinking, which comes with experience and wisdom development. Talk about making an issue emotional, rather than intellectual insight.\n\n\nSide comment. Oh, what about the polar bears, which was predicted 20 years ago to become extinct. Oh yeah, their population has INCREASED 50% since then. It only took a ban on hunting them, the real real for the initial decline. The alarmists are not advertising that FACT!!   There are soooo many more examples... but now I'm waffling!!", "time": "2 years ago", "author": "Andrew Trevenna", "channel": "UCFlWvpG4ZLagcXB-olWeJdQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLTWlQ051Dl7_KAH6JGX9w0fsYtabI5FbZ0L9ATogg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxEDirkwL5rwgTPhwt4AaABAg", "text": "Better skip the 'Sir' in front of your name. You've been bought by the climate church. Soon we will all see it was the biggest hoax ever, just to get lots of tax money from us. A disgrace!", "time": "2 years ago", "author": "Meng Anak", "channel": "UCCbJPS7LB3RFEZn-peyUOwQ", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLTkBWzhGQt1xuSQlm2-Zn_RhEutXch5T7wNd6Oo=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwtauypNWBdXf57lIt4AaABAg", "text": "Where can we watch the full hour-long program?", "time": "2 years ago", "author": "dbadagna", "channel": "UCEVEsOLJ5NFpEJe7N5nbNhA", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLTog0RO_gEb7qZI8tXsFo2hdFe0jxKu8mCegQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxqZ34wCRVhmM-t2zF4AaABAg", "text": "biggest lie ever.... the real problem is, the grand solar minimum", "time": "2 years ago", "author": "bbruce995", "channel": "UCE5Nb--3VGQNGsrF00Ow7rw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRQhQWTDW8YvO9QzSUX9AYa_Xo1hD-lYpfNRQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxZmm06UHfuORl-HrN4AaABAg", "text": "Biggest load of propaganda BS - contrary to actual to FACTS..... with ZERO evidence that CO2 is the cause of any measurable warming.....  nor evidence that warming is occurring anywhere near these “scientific” models..... nor evidence that 1.5 degrees warming would actually be bad anyway (as previous history has shown warming is good compared to cooling)..... And finally, bleeding hearts about “poor, developing countries” being the first to suffer...... while they deny them the ability to develop and prosper with coal.", "time": "2 years ago", "author": "Alan Beasy", "channel": "UCOv9_1hBE7Vzo0Nz5MCJEKg", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLQAyBGA6pN4EDZUtm6AgJCG3nI1TfVlxQxxtQnMeg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyyHtjLyOLcOmYus0V4AaABAg.91D4mmK0fF791D6Y8JMO9x", "text": "https://www.news18.com/news/buzz/11000-scientists-declare-climate-emergency-across-the-globe-warn-of-unavoidable-human-suffering-2375457.html\n\nIn the end of the day, gotta stop global warming.", "time": "1 year ago", "author": "The Conclave", "channel": "UCQz8yu0o16KOhmiljz_aVeQ", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLTNsWjvlAiDh99z_sR9KmxDell9w-12ko_lVmLhiQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxZLpTZsWzliug8vPJ4AaABAg.90iC58PlZ2A91c990A0kK1", "text": "Cake ... or Death?", "time": "1 year ago", "author": "Gerhard Faessler", "channel": "UCtkGEQW3mn6MN2jzbctQhhw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLTcYMN6jhjhAx5bSW-z8QVKTAwKl-P9URlinDBpOA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxZLpTZsWzliug8vPJ4AaABAg.90iC58PlZ2A9NC6t0A_-dr", "text": "Attendborough finally got it right in this video ... \"Climate Change and the Garden of Eden\"", "time": "5 months ago", "author": "ClimateCraze", "channel": "UCpNje5Hgfp0VGL0u2uQmRQg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSGstks5TnRJLOlB-U8WP18ojqVcxooXXz56QNm=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxZLpTZsWzliug8vPJ4AaABAg.90iC58PlZ2A9QjiUlEARTm", "text": "Ohhhhhh what a clueless troll!", "time": "2 months ago", "author": "Aaron E", "channel": "UCSGPQVrQ89wcLW-vHbzCaXQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLTFOGWMcfuaZ-JFIVav1JFhQBaI_2jN603Sshtp=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxZLpTZsWzliug8vPJ4AaABAg.90iC58PlZ2A9QjwCDdJ-1A", "text": " @Aaron E  Agree.  He's needs an education ... https://www.youtube.com/watch?v=iBQs1Jk4aUE", "time": "2 months ago", "author": "ClimateCraze", "channel": "UCpNje5Hgfp0VGL0u2uQmRQg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSGstks5TnRJLOlB-U8WP18ojqVcxooXXz56QNm=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx8CubHE6iN5nx-JvJ4AaABAg.90840m3DRkZ9236gdFYoL8", "text": "You do realize that solar energy can be stored in a battery. Hydro energy, wind energy, and electric cars can help us transition into the new era they are talking about in this video. We have the technology but we don't have the political power because of President Trump's administration that continues to receive money from the lobbyists of the fossil fuel industry. The green new deal plan has been drafted but not been put into action...https://youtu.be/Z9W7_iDAdiY", "time": "1 year ago (edited)", "author": "Carmina Montoya", "channel": "UCd4WeUahWbYelQ2-ktyG-gg", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLRDi5Xm2yCGXqDsM6urbA7qwoI_tCoY_LCSdA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx8CubHE6iN5nx-JvJ4AaABAg.90840m3DRkZ9NCB5WvR-nX", "text": "That's why the CCP knows better.  See video ... \"China Tackles Climate Change\"", "time": "5 months ago", "author": "ClimateCraze", "channel": "UCpNje5Hgfp0VGL0u2uQmRQg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSGstks5TnRJLOlB-U8WP18ojqVcxooXXz56QNm=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwBwsjorXT5C_EI6Md4AaABAg.9-mITLMU2O79IoNuWQNKr2", "text": "its is happening but its not a problem", "time": "8 months ago", "author": "Crafts For You", "channel": "UC2khK2bRPgMtGlxeOfCluEw", "votes": "0", "photo": "https://yt3.ggpht.com/vIR_bA-kXUBj5RUARhdLMYOrl2zYZY6DRcryYHL2RUTQGzHwv18uFDoAvRf4J54xMiZmghFbkQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgykQmlOOw4kWnbP1YJ4AaABAg.9-MKciopOQE9-N4WZ51Wtv", "text": "I don't think anyone is denying that; what they're saying is that the current heading is happening at an accelerated rate.", "time": "2 years ago", "author": "Craig Williams", "channel": "UCX3IP2mSm6mw5Ti4H0Qd9Eg", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLSyKKBwRIutFQYWVGxCpHAAxAhz6MYlGrwZ1OJFVQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgykQmlOOw4kWnbP1YJ4AaABAg.9-MKciopOQE9-OYREaHuM5", "text": " @Craig Williams  im ok with that. We are heading in the right direction but it wont happen over night. as they increase the price of oil and gas the more people will get on board, its called greed, to your pocket and theres. i love a good debate. thanks for the reply", "time": "2 years ago", "author": "im Conspire", "channel": "UCPAbYkIfeL9cgN14VamlbWQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTWwEqJ1bfLyH5wZvstStooqpGR1RHoTkx07kbO=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgykQmlOOw4kWnbP1YJ4AaABAg.9-MKciopOQE929edlTmowZ", "text": "Literally says man-made in the video, it's not natural, animals can't adapt so fast ant entire species are currently dying out.\n\nYeah ozone hole is recovering because we prohibited the gases that destroys it.", "time": "1 year ago (edited)", "author": "h t", "channel": "UC24tHCd_b-0pAHxQ3G0Tbhw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSShWjj_nVDrgXwhOv4r_zQfgP-yIDWhhlF25dhLeg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwfQsc53j-3Y4ZlRSR4AaABAg.9-HWkRG3kmk96--9DOL0Kl", "text": "Maybe if you watched the actual 57 mins long documentary you would see the reality and get actual the facts that you're looking for lmao", "time": "1 year ago", "author": "Antoine Dagenais Lalande", "channel": "UCrkojtL1NaO-w9piMWLyM7A", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRHY9gNkAzdpB2rflXSVktG7ngAA-oPiA1kDGY7oAQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugyqa9I6vTzAWfPqmH14AaABAg.9-ESUBLQC-69-I0ET4EJsg", "text": "Seems harsh,why not be positive,share your answers.", "time": "2 years ago", "author": "bettytigers", "channel": "UC-xZS2a-ngzPCC6lHp_a40A", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRdlYNwNsl1HW1-bO7HIroHOysXCt7-r-PRlEAo1g=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugyqa9I6vTzAWfPqmH14AaABAg.9-ESUBLQC-69-wC0Xreoka", "text": " @bettytigers  he cant be positive because he cam see him for what he is a bbc mouthpiece... how many airmiles have he done in 50 years him and his entire film crew...\n\n\nHYPOCRITICAL", "time": "2 years ago", "author": "Vasili", "channel": "UCjdSpEX3-kjwmUgWiohucBQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTm1_oUsdxn-hPY9kNuuFBXuRTYgPMaV_TZhqgEjg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugyqa9I6vTzAWfPqmH14AaABAg.9-ESUBLQC-6929fQd68DnD", "text": "5G, lol.", "time": "1 year ago", "author": "h t", "channel": "UC24tHCd_b-0pAHxQ3G0Tbhw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSShWjj_nVDrgXwhOv4r_zQfgP-yIDWhhlF25dhLeg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxcWelItor-VI704Bd4AaABAg.8zjnW1E2OHM929fGKTfdSJ", "text": " @Cowardly Custard  Yeah, they don't care, 1 in 5 CEO is a psychopath.", "time": "1 year ago", "author": "h t", "channel": "UC24tHCd_b-0pAHxQ3G0Tbhw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSShWjj_nVDrgXwhOv4r_zQfgP-yIDWhhlF25dhLeg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwfU2xOr9pVm3lQWHt4AaABAg.8yqJTtMNzXK8zHOgZR1bRy", "text": "It is a fact that the fossile gas industry have agitators, that try to turn the picture around for economical reasons, just like the tobacco industry. Those people are totally irresponsible!!", "time": "2 years ago", "author": "Johannes Ostenfeld-Rosenthal", "channel": "UCrlO96FP_ggwD83YkpANg_g", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLT1IElAc_f43hNvNtWL-Y4ViUpNfnQraS3jfORQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwfU2xOr9pVm3lQWHt4AaABAg.8yqJTtMNzXK9-wCgyUpmWx", "text": " @Johannes Ostenfeld-Rosenthal  you need to provide proof or its just you spouting fake ttuths", "time": "2 years ago", "author": "Vasili", "channel": "UCjdSpEX3-kjwmUgWiohucBQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTm1_oUsdxn-hPY9kNuuFBXuRTYgPMaV_TZhqgEjg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxEDirkwL5rwgTPhwt4AaABAg.8ykIiaXL-eA929fXK5JQmc", "text": "You're a disgrace, you ingnorant fool.", "time": "1 year ago (edited)", "author": "h t", "channel": "UC24tHCd_b-0pAHxQ3G0Tbhw", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLSShWjj_nVDrgXwhOv4r_zQfgP-yIDWhhlF25dhLeg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwtauypNWBdXf57lIt4AaABAg.8ydy8bjK2z-8yexl0wgnDM", "text": "https://iview.abc.net.au/show/climate-change-the-facts", "time": "2 years ago", "author": "The Conclave", "channel": "UCQz8yu0o16KOhmiljz_aVeQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTNsWjvlAiDh99z_sR9KmxDell9w-12ko_lVmLhiQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwtauypNWBdXf57lIt4AaABAg.8ydy8bjK2z-8yfIDWou9Mc", "text": "Thank you, when I go to that page and click \"Play,\" I receive this error:\n\n\"Video Player Error\nSorry, there has been a technical error with this video stream. This issue has been logged with our technical team for investigation.\"", "time": "2 years ago", "author": "dbadagna", "channel": "UCEVEsOLJ5NFpEJe7N5nbNhA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLTog0RO_gEb7qZI8tXsFo2hdFe0jxKu8mCegQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwtauypNWBdXf57lIt4AaABAg.8ydy8bjK2z-920ivzXPx4q", "text": " @dbadagna  Yes, I wonder why it's so hard to access this documentary which is very important. Please let me know if it is streaming anywhere else. I can't access it either.", "time": "1 year ago (edited)", "author": "Carmina Montoya", "channel": "UCd4WeUahWbYelQ2-ktyG-gg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRDi5Xm2yCGXqDsM6urbA7qwoI_tCoY_LCSdA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwtauypNWBdXf57lIt4AaABAg.8ydy8bjK2z-96--TmGnjaN", "text": " @Carmina Montoya  if you are in the UK, you can watch it online in the BBC's website", "time": "1 year ago", "author": "Antoine Dagenais Lalande", "channel": "UCrkojtL1NaO-w9piMWLyM7A", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRHY9gNkAzdpB2rflXSVktG7ngAA-oPiA1kDGY7oAQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxZmm06UHfuORl-HrN4AaABAg.8yWEgM4RqOW9HRX5UaGaaW", "text": "Co2 is a green house gas so it does trap heat...... so temperatures are rising. Do research you'll find a bunch of proof that temperatures are rising.", "time": "10 months ago", "author": "Kunal Kashyap", "channel": "UCfLF49PBpSdvTuU5CnYn2xA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLS6KQebqtBs3xskAh1B4OdrGIMCpnCcUm-XAe_qMQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxZmm06UHfuORl-HrN4AaABAg.8yWEgM4RqOW9HS5wB2EmIK", "text": " @Kunal Kashyap    Define “green house gas”.  Claiming CO2 is a “green house Gas” is a presumption that it actually causes warming.  I do not agree that the data shows temperatures have risen at all in the past 20 years, but even if they have, there is zero evidence that CO2 makes any measurable difference.  Then you ignored every other point.", "time": "10 months ago (edited)", "author": "Alan Beasy", "channel": "UCOv9_1hBE7Vzo0Nz5MCJEKg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQAyBGA6pN4EDZUtm6AgJCG3nI1TfVlxQxxtQnMeg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxZmm06UHfuORl-HrN4AaABAg.8yWEgM4RqOW9HS7o7mYTD7", "text": " @Alan Beasy  Okay. Green house gas is a gas that traps and radiates infrared radiations of long wave length. Second if you didn't already know this, almost all gases composed of 3 or more atoms trap infrared heat and let me check the number of atoms in Co2. hmm...\n1 atom of Carbon + 2 atoms of oxygen so 3 atoms. If you don't believe it then you are not only denying climate science you are denying chemistry. Thus: Co2 does cause warming. Thus an increase in Co2 causes an increase in warming.\n\n\nEdit: By my last statement don't understand that an increase in Co2 almost definitely means an increase in warming. There are other factors.", "time": "10 months ago (edited)", "author": "Kunal Kashyap", "channel": "UCfLF49PBpSdvTuU5CnYn2xA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLS6KQebqtBs3xskAh1B4OdrGIMCpnCcUm-XAe_qMQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxZmm06UHfuORl-HrN4AaABAg.8yWEgM4RqOW9HTk-Hp6iZu", "text": " @Kunal Kashyap    Okay.  This is the sort of ignorance that feeds the stupidity of climate alarmism.  What you wrote is meaningless crap that tells me you don’t understand a thing about physics and you just repeat other crap from people who also understand nothing.\n\nYou wrote: “........ traps and radiates infrared radiations of long wave length....”\n\n1. Infrared radiation (IR) is one frequency band in the whole electromagnetic spectrum. IR is called “long wave” because it has a lower frequency than visible light. Heat gets trapped in a glass house because high frequency (short wave) UV radiation from the sun can pass through glass.  UV is absorbed by soil, plants and water in the glasshouse.... which warms them.  They re radiate heat as IR, but that heat cannot escape because it is long wave radiation cannot pass through glass.\n2. CO2 is not a glass lid over the earth. CO2 does not “trap” IR.  \n3. CO2 absorbs IR, but can only absorb a small part of the IR spectrum it receives.\n4. CO2 has a very low heat capacity.....which means it quickly reaches full capacity.  Once it reaches full capacity, everything that is received is reradiated and passes by on its journey into space.  This is called equilibrium - CO2 retains IR for only about 0.0001 Seconds.\n5. Some molecules can absorb more heat than others.                                     (The number of atoms has nothing to do with it.)                                          CO2 and H2O both have three atoms, but the heat capacity of water vapour is 1.996 kJ/kgK while CO2 is only 0.844 kJ/ kg K\n6. With 1% to 4% of water vapour in the atmosphere compared to 0.04% of CO2, water vapour has between 50 to 200 times the heat absorption capacity of CO2 in the atmosphere.....which is the major factor for retaining sufficient warmth necessary to maintain life close to the surface of the earth.\n7. Without water vapour storing some heat energy, all the IR radiation would escape too quickly through the transparent atmosphere (99% nitrogen and oxygen).  We sense water vapour as *humidity*.\n8. The storage of this heat energy is essential for driving the convection currents that produce our weather patterns and for the viability of life.\n9. The major role of CO2 in the carbon cycle is providing plant food.....absorbing heat is minuscule and insignificant.\n10. The reason air is hot near the surface of the earth is always because the earth is heating the air above it.  But CO2 is not stopping the heat escaping.  The temperature drops about 6.5 degrees every kilometre up.  So on any day where the temperature is 40 degrees at ground level it will be zero freezing point just 6km up..... but up beyond that, it is generally the same temperature globally.  Commercial air craft fly in -30 to -60 degrees only 10km up.... the death zone..... only the height of Mt Everest.\n\n\nWater vapour and CO2 are *gases*.......a gas is not a solid - so it cannot be a lid.....  and even if it was, it covers less than 1% of the roof area.\n\nYou do not need to be a brilliant scientist to understand that.\n\n* Each molecule of CO2 is surrounded by over 2400 molecules of non-heat trapping nitrogen, oxygen and argon, making it impossible to form a ‘blanket’ as you are told - especially at high altitudes where wind speeds can reach 200 mph.\n* Did you know that in commercial green houses, they pump in extra CO2 to make the plants grow faster? (2000ppm) They do not open the roof of the glass house because they KNOW the CO2 will not trap heat.......the heat AND the CO2 will escape within minutes.\n* If you take away only a few sheets of glass from a green house, 100% of the warm air will escape. What chance if 50% of the glass was removed?   \n\nSo if CO2 is said to be like the glass roof of a green house, 99.96% of the glass is missing. (because CO2 is only 0.04% of the atmosphere.)\n\nThere is no \"trapping\" of heat at all.\n\n————————————-\nFinally:\nDo you have any idea of how much CO2 humans produce?\n\n* The IPCC agrees that annual human inflow of CO2 to the atmosphere is 4.6ppm and natural CO2 inflow is 98ppm.....  ie 4.5% vs 95.5%\n\nThis inflow is recycled continually otherwise CO2 would have risen to over 1,200 ppm in the past 10 years.\n\n* The increase in CO2 since 1750 is from 280ppm to 410ppm.\nThat is 130 increase in 260 years.\n\nIt is impossible for human CO2 to be responsible for all this this increase because there is no difference between human CO2 and natural CO2\n\n* Using IPCC annual inflow figures above, natural CO2 inflow has caused 95.5% of the 130ppm increase = 124ppm.\n* Human CO2 inflow has caused 4.5% of the 130ppm increase = 5.85ppm.\n\n* The increase since 1750 is 32% of the current total.\n* Human CO2 inflow has resulted in 1%.  (6 ppm)\n* Natural CO2 inflow has resulted in 31% (124 ppm)\n\n———————————-\nAnother way of looking at the same question:\n\n* Natural CO2 production is 3,560 GT per year\n* Human production is only        36GT per year\n\nSo 98.9% of CO2 is natural, while 1.1% is human.\n\n ————————————\nTherefore in summary:\n1. CO2 cannot trap heat\n2. There is not enough even if it could (only 0.041% of atmosphere)\n3. Humans have contributed only 1.1% of that 0.041%\n4. 1.1% of 0.041% = about 0.00045% of atmosphere (0.0000045)\n——————————-\n\nIt is insane ignorance or deliberate deception if any “scientists” claim that CO2 is the cause of any climate changing.", "time": "9 months ago (edited)", "author": "Alan Beasy", "channel": "UCOv9_1hBE7Vzo0Nz5MCJEKg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQAyBGA6pN4EDZUtm6AgJCG3nI1TfVlxQxxtQnMeg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugz8goCQhQn5Zc-8hdB4AaABAg", "text": "Pure propaganda coined with scare tactics-- with cherry-picked graphics.  I am a research meteorologist that has specialize in climate much of my career.  This is so grossly distorted. I like how they state the models differ (from each other) slightly -- and yet don't admit how much the models differ  from REALITY!  They are making very poor forecasts!  Try watching talk by Dr. Neil Frank (former Director of NHC) at https://www.youtube.com/watch?v=LVkUKNOPI3g", "time": "2 years ago", "author": "Stanley Goldenberg", "channel": "UCo9kbeK6F5NvOF9aF6CeqeQ", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLS1nMnAeftThOXlAMahE-UAz_vGo5xYEsm4q_4M=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugzqr-jxDsfezdFAJ0x4AaABAg", "text": "Bullshit, plain and simple.", "time": "2 years ago", "author": "dobrodave123", "channel": "UC-Y82F6AlL7pLteA232ItJg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSiRj_R39cSMFa0latLTyJ0Y-fXbi24MqPmNlv2vw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyQRe7BPI4yMeFhECF4AaABAg", "text": "400 ppm is trace... do the math", "time": "2 years ago", "author": "Sensei Kurt on the #Harpazzo / #Rapture", "channel": "UClj5S7b1CP1_QpXGtAz3AQA", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLTwdqJ5Rw_6zSRDhmHGP63ouV-g7oJM7X0TvW7eyg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgznXXHsbvHu8Uuc-7t4AaABAg", "text": "Just how much CO2 is optional for climate stability", "time": "2 years ago", "author": "Sensei Kurt on the #Harpazzo / #Rapture", "channel": "UClj5S7b1CP1_QpXGtAz3AQA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLTwdqJ5Rw_6zSRDhmHGP63ouV-g7oJM7X0TvW7eyg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugw_fsWQaYp9F3Wf33h4AaABAg", "text": "It's got The Facts in the title...wish there were more facts in the video. This just looks like a commercial.", "time": "2 years ago", "author": "hipp0stratus", "channel": "UC1rhhA0AmUdwIgGXf6vkqrQ", "votes": "4", "photo": "https://yt3.ggpht.com/ytc/AKedOLRE3vKNN2go2rz7Zva_njgMI1-hE8HcrNakkJVc=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxG3-byBhbzhI_wShF4AaABAg", "text": "For god sake save these people.this area should be protected .this is a crime .https://youtu.be/jCqCV58RL7o", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugzd0i2UlpUX-Z2MTKl4AaABAg", "text": "Tribal leader killed in brazil https://youtu.be/pFjU5a41Nx0", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyouihABGW2m9qcE1V4AaABAg", "text": "Save the indigenous tribes of North Brazil before its to late why isn't some one helping them .tribal leaders killed last week  by miners .hardly a word about it .save the amazon rain forests from destruction. Where is the un .Brazil have gone back on their agreement since they got a new president. No one can do nothing .", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "27", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": true}
{"cid": "UgxtFWpbnts_CBniOil4AaABAg", "text": "It's very easy to put all these images together and blame c02 .in 1912 an iceberg  hit the titanic which was further south than it should have been. Was c02 the cause of that .not likely.", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzMVESx7fYphyvxn_B4AaABAg", "text": "It's very easy to put all these images together and blame c02 .in 1912 an iceberg  hit the titanic which was further south than it should have been. Was c02 the cause of that .not likely.", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx8hi0VM9zGnudrl6J4AaABAg", "text": "This is all propaganda. .c02 is only 0.04% in  the atmosphere. We're going  into a solar minimum  it's going to get colder nor warmer.we have no effect on the climate the sun does.", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxqdGfvTo0cAeM6zBB4AaABAg", "text": "Piers corbyn weatheraction.com", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyjVPf7G-scvRqa-yN4AaABAg", "text": "Since the 60s 'Act now!' has lead to choosing a new (more favorable baseline) and stating: 'We've ten years left to do something.' Well children those 10 years? They have come and gone! - Thanks for the fish and so long.", "time": "2 years ago", "author": "JZ's Best Friend", "channel": "UCH-_s5tlPnZdNOVTRsiKOfA", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLSBZQ2WUvCVL9ijnnpcAXEfHqsqvUHoAxmcBRh7=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugzfb5NFwj8y1ch6IDl4AaABAg", "text": "You want me to listen to some overpaid posh bloke who takes his wages from people who have a lot less than him? A posh bloke who condones putting old age pensioners in prison if they don't pay the licence fee? I don't think so. Been a lovely summer so far this year.", "time": "2 years ago", "author": "graham biggs", "channel": "UCBO4vgVLmUQwETkxL3Um6mA", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLQela19H4n745dksaYLIFc2noDU6H9pxYIcEKYA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzNVE3zdY_7kW1_dtl4AaABAg", "text": "5G The Global Human Experiment Without Consent \nhttps://childrenshealthdefense.org/child-health-topics/known-culprit/electromagnetic/5g-the-global-human-experiment-without-consent/?utm_source=mailchimp&fbclid=IwAR3xXAiWLmHsMdorNgbj-xacaxyylRVnxOPQcqhOUtV7nFoT1v72nF6p8xU", "time": "2 years ago (edited)", "author": "Love Love", "channel": "UC8WG8VTgMlTS89jf7oJZ8Hw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLT2j_1qMGBTdNyewtmer4aKXygHmNhW-ARhkg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx7JIs9JaUFX_l5CZF4AaABAg", "text": "Don't just believe what you see in the media, research facts....\n\nWhat has 5G got to do with Extinction Rebellion, Climate alarmism, the Internet of Things and a Technocracy smart grid? The lie of climate change due to man made carbon emissions is being promoted as a global problem requiring a global solution. The solution being offered by the globalists via Extinction Rebellion and the UN's agenda 2030, Sustainability and Green New Deal is a technocratic control grid which will manage all resources via a new energy based economy and a carbon/social credit smart grid which uses the Internet of Things. It is being promoted as saving the planet but it is actually a global technocratic tyranny which has nothing to do with saving the planet but everything to do with consolidating power and control. All of this requires 5G. This is why 5G technology which has yet to be proven safe is being rushed out across the globe and it is also why no false or infiltrated environmental group will oppose it. \r\nhttps://www.globalresearch.ca/extinction-climate-c…/5674688… \r\nhttps://nowhere.news/…/extinction-rebellion-clearing-the-…/…", "time": "2 years ago", "author": "Love Love", "channel": "UC8WG8VTgMlTS89jf7oJZ8Hw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLT2j_1qMGBTdNyewtmer4aKXygHmNhW-ARhkg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwHbWy5N5qk8GOV1614AaABAg", "text": "If they were so worried about the climate all planes would be grounded. Instead it's increasing.", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwRRy5GEMT4BJ4aMqp4AaABAg", "text": "Ok, before I put a shotgun in my mouth and pull the trigger with my to", "time": "2 years ago", "author": "Simon Allen", "channel": "UCDTp4jQSFWC57YMlwOH8Ylw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSiz6athkkC6UFfHFAhT3qVZPYZPnOP2vXvQA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugy26gmmw5rvgoBQbIN4AaABAg", "text": "Why are we still running around in gas guzzlers ? Why are we still cutting down rain forests? \nWe really are a brainless race . \nWake up ffs. It’s not rocket science....", "time": "2 years ago", "author": "and11rew09", "channel": "UCBUAos5uDcfmP9UedLbtGYA", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLRlAP2aAKHvb5S4s-iQaOpcOjRV342JrNfFCg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzyG50ILVQF7x_rSdB4AaABAg", "text": "David Attenborough ,biggest carbon footprint of any human being ever, fucking hypocrite", "time": "2 years ago", "author": "Chris Hodge", "channel": "UCze7fCfPSRTklau_ZMCyJwA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSJjGwJgF45-yflr7fd6CvZTjlKqu9X_60tMw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgznXXHsbvHu8Uuc-7t4AaABAg.8yM8QbLfopS929f5KQbhu-", "text": "Lower than 400ppm.", "time": "1 year ago", "author": "h t", "channel": "UC24tHCd_b-0pAHxQ3G0Tbhw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSShWjj_nVDrgXwhOv4r_zQfgP-yIDWhhlF25dhLeg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgznXXHsbvHu8Uuc-7t4AaABAg.8yM8QbLfopS930zAfPI0-F", "text": "Plants love CO2... let's pump more out there and get a greener planet", "time": "1 year ago", "author": "mulli mulli", "channel": "UCOqYGnwpZ1fxN4ytQmL60Xg", "votes": "5", "photo": "https://yt3.ggpht.com/ytc/AKedOLRm8oQOxjHyUyfmY8Apok7MLM1wg55cAX-NGxeY=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgznXXHsbvHu8Uuc-7t4AaABAg.8yM8QbLfopS93QiqXCcvRb", "text": "Below 150ppm and all plants start to die off..", "time": "1 year ago", "author": "Bart Vanseer", "channel": "UCp2PlHOTN_-JW-89L7bXx5Q", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLTbHlHBzL2vqxHdzCoFYsexilZ0yS5flWz2POe7fw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgznXXHsbvHu8Uuc-7t4AaABAg.8yM8QbLfopS94Lzv_Aq3Jf", "text": "the real question is: how much until it starts to de-stabilize?", "time": "1 year ago", "author": "Динко Киров", "channel": "UC3zdD0RXNyNeQLnT3z_ilfw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLS6DuFXUALxwvMjkRnVrykjUfH4ewT8kfK0aJfzcA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgznXXHsbvHu8Uuc-7t4AaABAg.8yM8QbLfopS9GKu39H1--8", "text": " @mulli mulli  Plants actually do... when there was a lot of Co2 in the atmosphere millions of years ago we had enormous plants, ferns as tall as the trees and so on.", "time": "10 months ago", "author": "xv12commander", "channel": "UCBgz4K7xZyD5hMgfahD7xBg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLTgQxlhuSeEOtTx3JW-7nTlKmC0GcsCARJ2e_dqrA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgznXXHsbvHu8Uuc-7t4AaABAg.8yM8QbLfopS9IoNcX6d7AO", "text": " @Динко Киров  IT WON'T", "time": "8 months ago", "author": "Crafts For You", "channel": "UC2khK2bRPgMtGlxeOfCluEw", "votes": "0", "photo": "https://yt3.ggpht.com/vIR_bA-kXUBj5RUARhdLMYOrl2zYZY6DRcryYHL2RUTQGzHwv18uFDoAvRf4J54xMiZmghFbkQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgznXXHsbvHu8Uuc-7t4AaABAg.8yM8QbLfopS9IoNeEih1-W", "text": " @Динко Киров  oops capitals", "time": "8 months ago", "author": "Crafts For You", "channel": "UC2khK2bRPgMtGlxeOfCluEw", "votes": "0", "photo": "https://yt3.ggpht.com/vIR_bA-kXUBj5RUARhdLMYOrl2zYZY6DRcryYHL2RUTQGzHwv18uFDoAvRf4J54xMiZmghFbkQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgznXXHsbvHu8Uuc-7t4AaABAg.8yM8QbLfopS9IoV7QnYnml", "text": " @Crafts For You  my point exactly. now stop replying to old comments.", "time": "8 months ago", "author": "Динко Киров", "channel": "UC3zdD0RXNyNeQLnT3z_ilfw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLS6DuFXUALxwvMjkRnVrykjUfH4ewT8kfK0aJfzcA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgznXXHsbvHu8Uuc-7t4AaABAg.8yM8QbLfopS9NCArM4LyMG", "text": " @mulli mulli  You'll my video ... \"CO2 is coming to get you\"", "time": "5 months ago", "author": "ClimateCraze", "channel": "UCpNje5Hgfp0VGL0u2uQmRQg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSGstks5TnRJLOlB-U8WP18ojqVcxooXXz56QNm=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgznXXHsbvHu8Uuc-7t4AaABAg.8yM8QbLfopS9NCAweNDu7S", "text": "CO2 has nothing to do with the climate.  See video ... \"CO2 is coming to get you\"", "time": "5 months ago", "author": "ClimateCraze", "channel": "UCpNje5Hgfp0VGL0u2uQmRQg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSGstks5TnRJLOlB-U8WP18ojqVcxooXXz56QNm=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgznXXHsbvHu8Uuc-7t4AaABAg.8yM8QbLfopS9NCK9eGRB0D", "text": " @ClimateCraze  good upload 👌", "time": "5 months ago", "author": "mulli mulli", "channel": "UCOqYGnwpZ1fxN4ytQmL60Xg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRm8oQOxjHyUyfmY8Apok7MLM1wg55cAX-NGxeY=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgznXXHsbvHu8Uuc-7t4AaABAg.8yM8QbLfopS9NCQce2Dwhh", "text": " @mulli mulli  Thanks.  Here's my tribute video to Attenborough ... \"Climate Change ruined the Garden of Eden\"", "time": "5 months ago", "author": "ClimateCraze", "channel": "UCpNje5Hgfp0VGL0u2uQmRQg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSGstks5TnRJLOlB-U8WP18ojqVcxooXXz56QNm=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgznXXHsbvHu8Uuc-7t4AaABAg.8yM8QbLfopS9NCX-lTC7vo", "text": "h t And how exactly do you know that? If you actually studied the Volstagg Ice core samples you would see that our levels of CO2 in the past were as much as 2500 ppm...", "time": "5 months ago", "author": "Sensei Kurt on the #Harpazzo / #Rapture", "channel": "UClj5S7b1CP1_QpXGtAz3AQA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTwdqJ5Rw_6zSRDhmHGP63ouV-g7oJM7X0TvW7eyg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgznXXHsbvHu8Uuc-7t4AaABAg.8yM8QbLfopS9NCYN7yK5t4", "text": "Динко Киров CO2 levels are trace and have nothing to do with a climactic thermostat. Humans contribute at the most 15 ppm which is absurd to think that such small concentrations candy actually do anything to the climate especially since CO2 holds heat for only three seconds", "time": "5 months ago", "author": "Sensei Kurt on the #Harpazzo / #Rapture", "channel": "UClj5S7b1CP1_QpXGtAz3AQA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLTwdqJ5Rw_6zSRDhmHGP63ouV-g7oJM7X0TvW7eyg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgznXXHsbvHu8Uuc-7t4AaABAg.8yM8QbLfopS9NCYTDel6MK", "text": "No one believes in climate change more than me and no one believes in global warming more than I... however Anthropogenic global warming is a hoax.", "time": "5 months ago", "author": "Sensei Kurt on the #Harpazzo / #Rapture", "channel": "UClj5S7b1CP1_QpXGtAz3AQA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTwdqJ5Rw_6zSRDhmHGP63ouV-g7oJM7X0TvW7eyg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgznXXHsbvHu8Uuc-7t4AaABAg.8yM8QbLfopS9NCdouArZFW", "text": " @Sensei Kurt on the #Harpazzo / #Rapture  Ditto.  Excellent science.  Glad to meet you.  You are welcome to my climate alarmism videos.  They are being shadow-banned on YouTube, but best seen on NewTube.  Just search for User: ClimateCraze.", "time": "5 months ago", "author": "ClimateCraze", "channel": "UCpNje5Hgfp0VGL0u2uQmRQg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSGstks5TnRJLOlB-U8WP18ojqVcxooXXz56QNm=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugw_fsWQaYp9F3Wf33h4AaABAg.8y2mhU1HRuZ8yCyFEPAT5j", "text": "Well, it is a trailer. Watch the documentary.", "time": "2 years ago", "author": "Ondrej Krump", "channel": "UCjMP_dLo0VPCL3Rh5M93MbA", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLQ5Uz4xtz33jIP-FLxgacIY6pS99U-zo1J_Z9mg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugw_fsWQaYp9F3Wf33h4AaABAg.8y2mhU1HRuZ8yDrdPm1YFW", "text": " @Ondrej Krump  Ah, so it is a commercial. Still not enticing, but hopefully the documentary itself offers more value.", "time": "2 years ago", "author": "hipp0stratus", "channel": "UC1rhhA0AmUdwIgGXf6vkqrQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRE3vKNN2go2rz7Zva_njgMI1-hE8HcrNakkJVc=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugw_fsWQaYp9F3Wf33h4AaABAg.8y2mhU1HRuZ96--NB9yt-r", "text": " @hipp0stratus  it does; it's actually really well done. I highly suggest watching it whenever you can. It's only 57mins long too, so it won't take too much time of your day:)", "time": "1 year ago", "author": "Antoine Dagenais Lalande", "channel": "UCrkojtL1NaO-w9piMWLyM7A", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRHY9gNkAzdpB2rflXSVktG7ngAA-oPiA1kDGY7oAQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyouihABGW2m9qcE1V4AaABAg.8y-tSxR2I7F8y0Eb0PqsGe", "text": "The new Brazilian president is basically the Brazilian version of Trump. God I hate him...", "time": "2 years ago", "author": "Christian V-H", "channel": "UC4Q-CKAKkrA6PTQp60uTNow", "votes": "4", "photo": "https://yt3.ggpht.com/ytc/AKedOLQN7dB_golS9tvn6cB5OvxmvASgKa2f3pi7GjYNnw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyouihABGW2m9qcE1V4AaABAg.8y-tSxR2I7F920e75zNurR", "text": "Nothing is done because money is king and the fossil fuel industry has too much power and too much money. They use lobbyists in Washington so that environmental laws are pushed aside .... Fossil fuel lobbyists do the same worldwide. Corruption is ubiquitous and leading to our world's demise.", "time": "1 year ago (edited)", "author": "Carmina Montoya", "channel": "UCd4WeUahWbYelQ2-ktyG-gg", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLRDi5Xm2yCGXqDsM6urbA7qwoI_tCoY_LCSdA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyouihABGW2m9qcE1V4AaABAg.8y-tSxR2I7F920eTA0vMCW", "text": "https://www.theguardian.com/environment/2019/oct/11/google-contributions-climate-change-deniers", "time": "1 year ago", "author": "Carmina Montoya", "channel": "UCd4WeUahWbYelQ2-ktyG-gg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRDi5Xm2yCGXqDsM6urbA7qwoI_tCoY_LCSdA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyouihABGW2m9qcE1V4AaABAg.8y-tSxR2I7F9LNtxqPhGvG", "text": "Brazil don't give a sh*t. Corrupt since they won the FIFA world cup.", "time": "6 months ago", "author": "Jake l", "channel": "UCJhesD-0suQqFxhf3TJ1-oQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRB4L9cBLVIcCjSRbD-5YmLtOU36VFxUjVBoh3f=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx8hi0VM9zGnudrl6J4AaABAg.8xvq3PYVMfL8y-r0OhHcLd", "text": "\"It's going to get colder not warmer\"\nIs it really, though? What about desertification in Africa? What about this summer's two intense heatwaves in Europe? What about deadly wildfires in California? What about ice sheets melting in Antarctica?\nAll evidence is pointing to the Earth getting warmer - and it is due to GHG emissions from human industrial activity.", "time": "2 years ago", "author": "Christian V-H", "channel": "UC4Q-CKAKkrA6PTQp60uTNow", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQN7dB_golS9tvn6cB5OvxmvASgKa2f3pi7GjYNnw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx8hi0VM9zGnudrl6J4AaABAg.8xvq3PYVMfL8y-sIn6xN7e", "text": " @Christian V-H  https://youtu.be/eKbp_8f0Lm4", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx8hi0VM9zGnudrl6J4AaABAg.8xvq3PYVMfL8y-se8TIlVC", "text": " @Christian V-H  stop cutting down the rain forests in Brazil and killing tribal leaders in a land grab .where is the un when there is a real problem.", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx8hi0VM9zGnudrl6J4AaABAg.8xvq3PYVMfL8y-tnlK8pre", "text": " @Christian V-H  give Africans electric power  .it's racist not allowing Africa to develop .these are real problems Africa has coal they could easily power it's own country if they got the help but no keep Africa poor .the climate isn't the problem these are the real problems.", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx8hi0VM9zGnudrl6J4AaABAg.8xvq3PYVMfL8y-ucTGRQzf", "text": " @DERMOT HENRY  \"The climate isn't the problem these are the real problems\". Yes, I agree, power shortages, poverty and poor living conditions are all serious issues - but these issues will be made so much worse by the climate crisis", "time": "2 years ago", "author": "Christian V-H", "channel": "UC4Q-CKAKkrA6PTQp60uTNow", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQN7dB_golS9tvn6cB5OvxmvASgKa2f3pi7GjYNnw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx8hi0VM9zGnudrl6J4AaABAg.8xvq3PYVMfL8y-vVWqxqsk", "text": " @Christian V-H  bull", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx8hi0VM9zGnudrl6J4AaABAg.8xvq3PYVMfL8y0BSqCluwM", "text": " @DERMOT HENRY  I would agree with you on that, but then that would make both of us wrong.", "time": "2 years ago", "author": "Christian V-H", "channel": "UC4Q-CKAKkrA6PTQp60uTNow", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQN7dB_golS9tvn6cB5OvxmvASgKa2f3pi7GjYNnw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx8hi0VM9zGnudrl6J4AaABAg.8xvq3PYVMfL8yWWBsn11Jg", "text": " @Christian V-H  at this moment, africa is greening due to the grand solar minimum, go research it, there are no intense heat waves except for those out of season because the seasons and places that get hot are changing,  ice sheets are growing in antarctica, the evidence is manipulated, they put sensors in parking lots and where it will register hotter, if you want accurate temps, you must put them away from populations and parking lots  youtube John L Casey, suspicious observers and adapt 2030 for more real information than govt propaganda", "time": "2 years ago", "author": "bbruce995", "channel": "UCE5Nb--3VGQNGsrF00Ow7rw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRQhQWTDW8YvO9QzSUX9AYa_Xo1hD-lYpfNRQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyjVPf7G-scvRqa-yN4AaABAg.8xvjsv_O9YF9236UgGmq6F", "text": "yeah it has been going on since the 60s but here is why you believe it is fake...https://youtu.be/Z9W7_iDAdiY", "time": "1 year ago", "author": "Carmina Montoya", "channel": "UCd4WeUahWbYelQ2-ktyG-gg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRDi5Xm2yCGXqDsM6urbA7qwoI_tCoY_LCSdA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugzfb5NFwj8y1ch6IDl4AaABAg.8xvPj03SOxm8y00R-d8apc", "text": "The scientific evidence is concrete regardless who you hear it from", "time": "2 years ago", "author": "Nathan Stone", "channel": "UCWQDizGgq4O0o4GRjSZJz9w", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLT0LbED713iJWuaO68r6UQZtXw1v104YXIsUNDhur0=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugzfb5NFwj8y1ch6IDl4AaABAg.8xvPj03SOxm8y33qFmWWHX", "text": " @Nathan Stone  Yes I know. I've seen the concrete evidence saying climate change is man made. I've also seen concrete evidence that it's not. So I look at WHO is saying what. I would no more take the word of screeching Leftists and plastic professors than I would take dietary advice from a Sumo or a vegan. Fossil fuels will run out soon enough. The world wont end before then. Stop panicking.", "time": "2 years ago", "author": "graham biggs", "channel": "UCBO4vgVLmUQwETkxL3Um6mA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQela19H4n745dksaYLIFc2noDU6H9pxYIcEKYA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugzfb5NFwj8y1ch6IDl4AaABAg.8xvPj03SOxm9-wCElnNsRy", "text": " @Nathan Stone  no it ain't what evidence", "time": "2 years ago", "author": "Vasili", "channel": "UCjdSpEX3-kjwmUgWiohucBQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTm1_oUsdxn-hPY9kNuuFBXuRTYgPMaV_TZhqgEjg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwHbWy5N5qk8GOV1614AaABAg.8xUXDr4CBzS8xVQAGw5lII", "text": "How's they? It's flight companies and governments who increase the number of flights.", "time": "2 years ago", "author": "The Conclave", "channel": "UCQz8yu0o16KOhmiljz_aVeQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLTNsWjvlAiDh99z_sR9KmxDell9w-12ko_lVmLhiQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwHbWy5N5qk8GOV1614AaABAg.8xUXDr4CBzS8xVQoeTbl_Q", "text": " @The Conclave  the climate change saviours.they never mention aeroplanes.its all a scam.", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwHbWy5N5qk8GOV1614AaABAg.8xUXDr4CBzS8xVz3cY_XGh", "text": " @DERMOT HENRY  https://www.theguardian.com/money/2019/jun/09/flight-airline-travel-rail-family-environment\nThere is even a trending word for that today. \nBut as any activist, they have to go for the low hanging fruit first. Like sustainable diet, daily transport, etc.\nAttacking the public on airtravel could in turn make the public go defensive and redicule their movement, also considering there is no real alternative out there today, apart from in few countries.", "time": "2 years ago", "author": "The Conclave", "channel": "UCQz8yu0o16KOhmiljz_aVeQ", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLTNsWjvlAiDh99z_sR9KmxDell9w-12ko_lVmLhiQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwHbWy5N5qk8GOV1614AaABAg.8xUXDr4CBzS8xvqd9dqbBS", "text": " @The Conclave  I hear the price of flights is goin up  to save the planet 😂yes everyone  cashing in on the money.", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugy26gmmw5rvgoBQbIN4AaABAg.8xEbR8GGI3f8xEdbeZvdu1", "text": "Sadly the guys selling US our oil and cars have huge pulls in the government, ensuring them that they can continue their wrong ways. However, in the end, consumer demands force the right change.", "time": "2 years ago", "author": "The Conclave", "channel": "UCQz8yu0o16KOhmiljz_aVeQ", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLTNsWjvlAiDh99z_sR9KmxDell9w-12ko_lVmLhiQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugy26gmmw5rvgoBQbIN4AaABAg.8xEbR8GGI3f8xvijSCWA8i", "text": "@and11rew09: Didn't we all believe that the trees grow into the sky? It doesn't matter if you ride a bike and/or sleep under the open sky. It's the evolution of the human species (and it's conflict with its habitat) that brought us to the point we're at.", "time": "2 years ago", "author": "JZ's Best Friend", "channel": "UCH-_s5tlPnZdNOVTRsiKOfA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSBZQ2WUvCVL9ijnnpcAXEfHqsqvUHoAxmcBRh7=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugy26gmmw5rvgoBQbIN4AaABAg.8xEbR8GGI3f932-pJEhjOH", "text": "Pump more CO2 out .. the trees love it. Let's promote more CO2 and have a greener planet", "time": "1 year ago", "author": "mulli mulli", "channel": "UCOqYGnwpZ1fxN4ytQmL60Xg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRm8oQOxjHyUyfmY8Apok7MLM1wg55cAX-NGxeY=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg", "text": "Rubbish all a scam", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwhoGtb7HiJkrvG_A94AaABAg", "text": "RUBBISH, RUBBISH AND MORE RUBBISH. WE WERE TOLD SEA LEVELS WOULD RISE 1 TO SIX FEET BACK IN THE 80s ,ACTUAL RISE IS BARELY 1mm per YEAR IN THE NORTHERN HEMISPHERE AND NO RISE AT ALL IN THE EQUATORIAL REGION IN THE LAST 50 TO 70 YEARS ,FACT!!!!\nIN FACT WE ARE ABOUT TO ENTER A SOLAR COOLING PERIOD. \nAS FOR CO2 which makes up 0.04% of our atmosphere is NOT AT ALL TIME HIGHS, IN FACT MOST PLANT LIFE WOULD DIE WITH LEVELS BELOW 0.015% and would barely grow below 0.018% FACT.  CO2 is the building block for LIFE.\nYOU IDIOTS FALLING FOR THE BIGGEST LOT OF BULL SHIT IN MANS HISTORY, SHAME ON YOU!", "time": "2 years ago (edited)", "author": "Robert Day", "channel": "UCzuGdZElBtDFWR_Mkwp55lg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQEcEBPKC5V7bwTVpDa2XlYj84o83QzuTglUmMhNA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyC8GPGZcI36qixc_J4AaABAg", "text": "People need to know that volcanos is the bad guy here, not human. One volcano explosion is equal to all humans climate-impact during 50 years, so fix a solution about volcanos", "time": "2 years ago", "author": "Triborn", "channel": "UCevuqKivh7jJjnsiYabUlvA", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLScOghLKuN9rlfvcS0WyjF-prVf8Od1IUEpytkdXQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwPcjBkmh5JRuy_I1l4AaABAg", "text": "In his nature documetaries Dave always slips in a comment to the effect that the man made global warming- the new age cannard-   will in some way negatively impact, say on some seabird rookery or some other animal.\nThis assumption is to garner support to reduce alleged emissions by extra funding for things like windmills and other measures like roof panels or carbon sequestration.\nGood try Dave!", "time": "2 years ago", "author": "peter shaw", "channel": "UCQ-Ct0D16daO3dbPpAV-SCg", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLR5sAzRU9bY-KKqsKuYpfCY9p0h_B3iTmQm=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzIZH3CccLv0lmQv194AaABAg", "text": "You're doomed because the USA is the greediest nation on the planet!! A racist and a bully!!", "time": "2 years ago", "author": "roberto tamayo", "channel": "UCE6b-Pwf-ZTeeig451PjkAg", "votes": "5", "photo": "https://yt3.ggpht.com/ytc/AKedOLSAci7TqYomUh-HXaBsbftnQOGUBIJZE2pj0w=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwnKYyhDS2Ub28KF_54AaABAg", "text": "\"... it may not seem obvious.....\"\nExactly, because your Vooddoo science is just that... a load of bull.... And no, not even the BS in the field can cause as much harm as the hot air coming forth from these alarmists.", "time": "2 years ago", "author": "bolandboertjie", "channel": "UCVXK3HPAVAPel8Hha8VpWVg", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLRKjPtgoNhlEVgkmk6xNv_Lhr8kDPfF2vdGOw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugxfhnwf7_meEM2tPyJ4AaABAg", "text": "A nice alarmist propaganda film devoid of any level headed cohesive scientific argument.  Using a child too,  just like the Nazis did before and during the second World war along with the same model of propaganda,  shameful.\nAs  a scientifically trained person  I would encourage all people to view arguments both for and against.  Then and only then make upp your own minds.  Start by trying Fred Goldberg's \"Can Humans Cause Global Warming with CO@ Emissions?\" on YouTube.", "time": "2 years ago", "author": "aeroearth", "channel": "UCruebI1PdzjPXw_6CDrQZBQ", "votes": "4", "photo": "https://yt3.ggpht.com/ytc/AKedOLS1Yil7GYn3SWC2dvZPM7pFMHzrYMpAsLeX0Q=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyAIEasaY3FrZm0XlV4AaABAg", "text": "It's the best documentary I've ever seen on the climate crisis. Especially in these times of social change (FridaysForFuture aso.) it's a pity that you can't see this documentation (at least in Germany) because of licensing reasons. You can't even find it on paid providers like Netflix, AmazonPrime or Maxdome. The possible influence of this documentation is thus greatly reduced.", "time": "2 years ago", "author": "Lukas Diehl", "channel": "UCG1UpXi9uTLMY3YUDXtCX8A", "votes": "16", "photo": "https://yt3.ggpht.com/ytc/AKedOLSNqY3tDlDT1CGJbkW77nMrmpqgDT4aSUoNuPW-4Q=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-8xEbYIehc-w", "text": "DERMOT HENRY go back to sleep", "time": "2 years ago", "author": "and11rew09", "channel": "UCBUAos5uDcfmP9UedLbtGYA", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLRlAP2aAKHvb5S4s-iQaOpcOjRV342JrNfFCg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-8xElTSeVdIN", "text": "If there was an emergency  you cars would be confiscated all the planes would be grounded. Can't you see .", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-8xFDvNtkBUT", "text": "Governments make so  much money from fuel tax . They will be the last ones to put a stop on burning it .", "time": "2 years ago", "author": "and11rew09", "channel": "UCBUAos5uDcfmP9UedLbtGYA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRlAP2aAKHvb5S4s-iQaOpcOjRV342JrNfFCg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-8xvkPFHwSvw", "text": "Oh look, an Irish troll.", "time": "2 years ago", "author": "JZ's Best Friend", "channel": "UCH-_s5tlPnZdNOVTRsiKOfA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSBZQ2WUvCVL9ijnnpcAXEfHqsqvUHoAxmcBRh7=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-8xvknEcowUu", "text": " @JZ's Best Friend  oh I see you channel has no content that's strange you must be government", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-8xvosAcNkGR", "text": " @DERMOT HENRY  Oh look, an paranoid Irish troll.", "time": "2 years ago", "author": "JZ's Best Friend", "channel": "UCH-_s5tlPnZdNOVTRsiKOfA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSBZQ2WUvCVL9ijnnpcAXEfHqsqvUHoAxmcBRh7=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-8xvpUWXwFyh", "text": " @JZ's Best Friend  at least I'm not alarmist", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-8xvrtszvL3w", "text": " @DERMOT HENRY  Oh look, a paranoid Irish self-claimed-not-alarmist troll.", "time": "2 years ago", "author": "JZ's Best Friend", "channel": "UCH-_s5tlPnZdNOVTRsiKOfA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSBZQ2WUvCVL9ijnnpcAXEfHqsqvUHoAxmcBRh7=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-8xvsc9vfG05", "text": " @JZ's Best Friend  ah I see a climate denier.no mention of the medieval  warm period .maybe that never happened.", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-8xw-4HPeIYd", "text": " @DERMOT HENRY  I decided not to harass you anymore. I'm neither denier, nor advocate. I'm just passing through. Interesting topic though: One the one hand there the CC-advocates who say we're doomed (within five years to one hundred) and the CC-deniers, who say we're not and therefor we can continue screwing up things the way we do.\nThat shouldn't even be a point of discussion. Just wait and see and in the mean time, just go on doing what you're doing. There's nothing that can't be changed anyway according to the CC-advocates.\nFrom an Irish person I would have expected to be more in favor of CC, having the Atlantic (the main heat carrier) on your doorstep, rather than being against it. Well, whatever, doesn't matter anyway. If you're here in five years, and I'm in Ireland by then, I'll buy you a descend drink, whatever they drink in Ireland.", "time": "2 years ago", "author": "JZ's Best Friend", "channel": "UCH-_s5tlPnZdNOVTRsiKOfA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSBZQ2WUvCVL9ijnnpcAXEfHqsqvUHoAxmcBRh7=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-8xw0MeRS2Ui", "text": " @JZ's Best Friend  it's not climate change i have an issue with its the man made c02 blame game which   when you look at data it goes up and down and doesn't correspond with the temperatute.s as for the drink yes I would have a drink with you .I don't take things personally as I see you don't either .so cheers to your good health.", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-8xw5TxE72KI", "text": " @DERMOT HENRY  You have a point about the correlation between temperature and CO2. But I'd like to share a little bit of science on the subject. It takes the CO2 about 10 years to have any effect on the climate. So you should compare current °C with CO2 data from 2008. However, this does not apply to CH4, SO4, H2O. - Drink plan noted. You never know ;-) I've never been to Ireland, but it nurtured Spike Milligan (okay, I know, he's born in India) and Dave Allen, so it can't be a bad idea to visit the place.", "time": "2 years ago", "author": "JZ's Best Friend", "channel": "UCH-_s5tlPnZdNOVTRsiKOfA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSBZQ2WUvCVL9ijnnpcAXEfHqsqvUHoAxmcBRh7=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-8xw9VBJEysA", "text": " @JZ's Best Friend  I disagree with your time scale there there is a few hundred years of a time lag between c02 being released  from the oceans  and it doesn't affect  the temp so no thanks for the science lesson", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-8xwBTXdbxea", "text": " @DERMOT HENRY  Did I mention 'oceans' somewhere? Whatever, If there's no CC for you, then there's no CC for you. If there's CC for me, then there's CC for me. This is such a pointless discussion: if the place heats up, then we all die; if it doessn't, well then we all die regardless, albeit a bit later. ps: The stuff released from the ocean, and having a fast effect, is more likely to be CH4, but who cares? - psps: time scale is not mine, it's from people who are a whole lot smarter than I am.", "time": "2 years ago", "author": "JZ's Best Friend", "channel": "UCH-_s5tlPnZdNOVTRsiKOfA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSBZQ2WUvCVL9ijnnpcAXEfHqsqvUHoAxmcBRh7=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-8xwCkk47aiR", "text": " @JZ's Best Friend  well yes and smarter than me .we're looking at diferent data so we have diferent perspectives. Just a thing to think about data is being adjusted  to suit cc.it has being proven in Australia that data was adjusted to suit the warming.another thing is there is trillions of dollars spent on this.", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-8xwD7-OndJX", "text": " @JZ's Best Friend  https://youtu.be/brKUa-iGOFk", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-8xwH-apn-8o", "text": " @JZ's Best Friend  https://youtu.be/OK6k3w21EFQ", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-930zc_q4bBL", "text": "Plants love CO2 ... they need it to survive and thrive. Let's pump more of it out there and make the planet greener!", "time": "1 year ago", "author": "mulli mulli", "channel": "UCOqYGnwpZ1fxN4ytQmL60Xg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRm8oQOxjHyUyfmY8Apok7MLM1wg55cAX-NGxeY=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwzdRQm3vVzei-dwB54AaABAg.8wj7r94zdR-9IoO6t-yRtK", "text": "it is happening but we don't need to do anything and we are WAY overreacting", "time": "8 months ago", "author": "Crafts For You", "channel": "UC2khK2bRPgMtGlxeOfCluEw", "votes": "0", "photo": "https://yt3.ggpht.com/vIR_bA-kXUBj5RUARhdLMYOrl2zYZY6DRcryYHL2RUTQGzHwv18uFDoAvRf4J54xMiZmghFbkQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyC8GPGZcI36qixc_J4AaABAg.8wangcXGYrV8wauGDrRsbB", "text": "When you have an equation with many variables, you tweak the variables you can control. Your solution is like praying to God for solution to solve the climate crisis.", "time": "2 years ago", "author": "The Conclave", "channel": "UCQz8yu0o16KOhmiljz_aVeQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTNsWjvlAiDh99z_sR9KmxDell9w-12ko_lVmLhiQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyC8GPGZcI36qixc_J4AaABAg.8wangcXGYrV8wbIzEGXnQm", "text": " @The Conclave  So? Bill Gates and some other rich people has a plan,  google it", "time": "2 years ago", "author": "Triborn", "channel": "UCevuqKivh7jJjnsiYabUlvA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLScOghLKuN9rlfvcS0WyjF-prVf8Od1IUEpytkdXQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyC8GPGZcI36qixc_J4AaABAg.8wangcXGYrV9HRV99XIvVv", "text": "What are you talking about, there is so much wrong in that comment. Human activities emit 60 or more times the amount of carbon dioxide released by volcanoes each year. So please don't just say anything.", "time": "10 months ago", "author": "Kunal Kashyap", "channel": "UCfLF49PBpSdvTuU5CnYn2xA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLS6KQebqtBs3xskAh1B4OdrGIMCpnCcUm-XAe_qMQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwPcjBkmh5JRuy_I1l4AaABAg.8w_Vg7vnwRK8wa3nqsGeJX", "text": "Sure, but isn't that the right thing to do lol?\nUnless of course if you belive global warming is a fabricated myth.", "time": "2 years ago", "author": "The Conclave", "channel": "UCQz8yu0o16KOhmiljz_aVeQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLTNsWjvlAiDh99z_sR9KmxDell9w-12ko_lVmLhiQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwPcjBkmh5JRuy_I1l4AaABAg.8w_Vg7vnwRK8waPf4mnXt2", "text": " @The Conclave  it sure is", "time": "2 years ago", "author": "peter shaw", "channel": "UCQ-Ct0D16daO3dbPpAV-SCg", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLR5sAzRU9bY-KKqsKuYpfCY9p0h_B3iTmQm=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwPcjBkmh5JRuy_I1l4AaABAg.8w_Vg7vnwRK8yWVZvD5qSw", "text": " @The Conclave  we are in a grand solar minimum, the only thing that controls the weather on this planet, is that massive yellow ball, its called the sun.. and right now, its going to sleep, if you dont prepare now, you will be in serious trouble... youtube John L Casey, adapt 2030, suspicious observers for real science on the subject", "time": "2 years ago", "author": "bbruce995", "channel": "UCE5Nb--3VGQNGsrF00Ow7rw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRQhQWTDW8YvO9QzSUX9AYa_Xo1hD-lYpfNRQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgzIZH3CccLv0lmQv194AaABAg.8wS0A_sGW5k8xviJx6jy-H", "text": "@robert tamayo: it's too late now for the blaming game.", "time": "2 years ago", "author": "JZ's Best Friend", "channel": "UCH-_s5tlPnZdNOVTRsiKOfA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSBZQ2WUvCVL9ijnnpcAXEfHqsqvUHoAxmcBRh7=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwnKYyhDS2Ub28KF_54AaABAg.8vyN9cA0-OK8vyOPcXa7JM", "text": "You can call it propaganda if the information is biased or wrong. But it isn't, unless you are a climate change denier or have money in the fossil fuel industry.\n\nHere are evidences provided by NASA: https://climate.nasa.gov/evidence/\n\nUN reports: https://www.un.org/en/sections/issues-depth/climate-change/\n\nUN mass extinction report: https://www.un.org/sustainabledevelopment/blog/2019/05/nature-decline-unprecedented-report/\n\nYou could choose to cry all of the above as false, but then we are not having an intellectual debate, just a bigoted argument.", "time": "2 years ago", "author": "The Conclave", "channel": "UCQz8yu0o16KOhmiljz_aVeQ", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLTNsWjvlAiDh99z_sR9KmxDell9w-12ko_lVmLhiQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwnKYyhDS2Ub28KF_54AaABAg.8vyN9cA0-OK8yWWW1ikgOE", "text": " @The Conclave  why do you continually call people \"climate change deniers\"? we dont deny the climate changes, it always has, we need proof of the warming, and over the last 50 years, it has not warmed, do your own research, like i said before, we are in a grand solar minimum, our sun is going to sleep, it does this every 200-400 years, its a cycle and it always happens, prepare now , or you will be in serious trouble, in prepare now, i mean, build a greenhouse, save seeds and can food", "time": "2 years ago", "author": "bbruce995", "channel": "UCE5Nb--3VGQNGsrF00Ow7rw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRQhQWTDW8YvO9QzSUX9AYa_Xo1hD-lYpfNRQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugxfhnwf7_meEM2tPyJ4AaABAg.8v_mqa6qswa8vb0F9W6HO-", "text": "You can call it propaganda if the information is biased or wrong. But it isn't, unless you are a climate change denier or have money in the fossil fuel industry.\n\nHere are evidences provided by NASA: https://climate.nasa.gov/evidence/\n\nUN reports: https://www.un.org/en/sections/issues-depth/climate-change/\n\nUN mass extinction report: https://www.un.org/sustainabledevelopment/blog/2019/05/nature-decline-unprecedented-report/\n\nYou could choose to cry all of the above as false, but then we are not having an intellectual debate, just a bigoted argument.", "time": "2 years ago (edited)", "author": "The Conclave", "channel": "UCQz8yu0o16KOhmiljz_aVeQ", "votes": "6", "photo": "https://yt3.ggpht.com/ytc/AKedOLTNsWjvlAiDh99z_sR9KmxDell9w-12ko_lVmLhiQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugxfhnwf7_meEM2tPyJ4AaABAg.8v_mqa6qswa8vzNwbNYfRP", "text": "aeroearth it's the BBC mate, they can't tell us what the weather will be like in 5 days time accurately and they can't even decide on what a woman is but they're going to tell you that reducing the gas that plants breathe is \" green\" because they think we are morons and that's because we are because we still let them force us to pay for this dogshit.", "time": "2 years ago (edited)", "author": "mmtot", "channel": "UCeIR0s9tbTLyl-lDOdxrryw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLROPnJBLjWU2T0EmuIShq6XM5He2VXAFS0h2Mk5=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugxfhnwf7_meEM2tPyJ4AaABAg.8v_mqa6qswa8xUWllmd_Vn", "text": "Climate is always changing  and always will.piers corbyn  has a scientific paper about c02 that it does not cause global warming and to this day no scientist  can dispute his findings. Or even challenge him in a debate.so much for real science.", "time": "2 years ago", "author": "DERMOT HENRY", "channel": "UCE200hW-PU-zkzYCZyxKxag", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNz39C3o5WY_YktmLUZuL5H-iB61A-XJFR1e-NXA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyAIEasaY3FrZm0XlV4AaABAg.8vH5rPdTx5B8yCyTgJIRmL", "text": "we should petition the BBC to make it public on youtube and other similar sites for free. It is very much in public interest. In the meantime, check out Czech uloz.to website to find a copy.", "time": "2 years ago", "author": "Ondrej Krump", "channel": "UCjMP_dLo0VPCL3Rh5M93MbA", "votes": "4", "photo": "https://yt3.ggpht.com/ytc/AKedOLQ5Uz4xtz33jIP-FLxgacIY6pS99U-zo1J_Z9mg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyAIEasaY3FrZm0XlV4AaABAg.8vH5rPdTx5B8yVMqc7Koow", "text": "'Climate crisis'.  :)", "time": "2 years ago", "author": "dobrodave123", "channel": "UC-Y82F6AlL7pLteA232ItJg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSiRj_R39cSMFa0latLTyJ0Y-fXbi24MqPmNlv2vw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyAIEasaY3FrZm0XlV4AaABAg.8vH5rPdTx5B92AfE_WvvDP", "text": "Yes! I have subscriptions to all of those and I cannot find this documentary. Only yesterday I saw for the first time CBSN is reporting on this climate crisis and consulting anchors at the BBC. I really hope that this starts to be spoken about seriously. This is a crisis! It's already been declared a climate emergency in the UK but President Trump refuses to do so in the US...", "time": "1 year ago", "author": "Carmina Montoya", "channel": "UCd4WeUahWbYelQ2-ktyG-gg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRDi5Xm2yCGXqDsM6urbA7qwoI_tCoY_LCSdA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyAIEasaY3FrZm0XlV4AaABAg.8vH5rPdTx5B9NC7OWSEbKM", "text": " @dobrodave123  The John Kerry video will help ... \"The Millimeter Tidal Wave\"", "time": "5 months ago", "author": "ClimateCraze", "channel": "UCpNje5Hgfp0VGL0u2uQmRQg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSGstks5TnRJLOlB-U8WP18ojqVcxooXXz56QNm=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyAIEasaY3FrZm0XlV4AaABAg.8vH5rPdTx5B9NC7WxXg6ZB", "text": "Here is proof with this video ... \"Proof Humans Cause Climate Change\"", "time": "5 months ago", "author": "ClimateCraze", "channel": "UCpNje5Hgfp0VGL0u2uQmRQg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSGstks5TnRJLOlB-U8WP18ojqVcxooXXz56QNm=s176-c-k-c0x00ffffff-no-rj", "heart": false}
