{"cid": "Ugyy0mlBXVQ3wOiEOIt4AaABAg", "text": "Please Do A Piece on Michael Jackson\r\nHi,\r\nI’m writing to you because Last Week Tonight as opposed to other such shows actually cares about issues rather than chasing the headlines. It has been 11 years since Michael Jackson passed away yet to this day what the common consensus is that he is a taboo subject for many. I recall you guys once did a piece on Public Shaming. Michael Jackson was a genius, an abused child. He was strange. He was one of the few major stars from the 80s who came out of the 80s without a heroine addiction. He in his own way did many, Many strange things, but so do most other superstars. And more than others he actually cared. About children, about the earth. About the issues we are discussing to this day. While Icons like Freddy Mercury, Elvis Pressley, Prince, Beetles and many more are known for their good works, Michael is known for the something which he has repeatedly been acquitted for. It’s the truth that anyone looking for will find instantly but due to the “where there is smoke there is a fire” narrative, even 11 years after his death, the new media treats him like a criminal. All his trial pages are open for the public to read. He WAS weird. Making a ranch called neverland, hanging out with children. Trusting people he shouldn’t. But I urge you please cover him, hear beyond the noise like you guys often do. The most successful African American Artist of all time was a humble man child, who respected women, loved children and cared about our environment. He was not a heroine junkie, a private man who did not share his disease even all the way back in 1993 even though he was accused of wanting to become a “White Man”. He was eccentric. Hanging out with animals and caring about them.  https://theobjectivestandard.com/2020/02/justice-for-michael-jackson/\r\nThis article covers multiple sources, some of which I had read previously. Michael Jackson was a multi talented millionaire pop star, who was not an alcoholic, was a caring father, a filial son, Treated women with respect, cared about the planet and it’s beings. The press that constantly kept DASHING him, had found a way to subvert their guilt. All those years of calling him a “Jacko”, “monkey” and many more hurtful things was justified if he was a paedophile. They NEEDED him to be guilty. Such a man cannot exist in Hollywood. Such public shaming had allowed and to this day allows Michael to be a victim to all this slander. Please do a piece, if not one that exonerates him then one that once and for all cements the fact the Michael Jackson, the greatest pop star, the first African American Idol was a paedophile. Not through unknown sources or flimsy headlines but through concrete proof. A news echoing in a closed chamber will not reach anyone, most fans who what to know the truth know it, other people will read the headlines but not the explanations. It’s about time the general public knows. Please do a piece on Michael, the blatant mistreatment by the media,  The systematic racism he faced during his trials. Please don’t let the first African American Singer be remembered for the things he did not do, He was weird, weird enough to annoy Freddy Mercury with Bubbles feedbacks, weird enough to let kids crack raw eggs over Michael Jackson, Weird enough to play water balloons with children. But he was not a paedophile and the world needs to acknowledge that. He was in no way a “Perfect Human” but he tried his best to live right and we should not punish him for doing that. \r\nOn this year please exonerate this Black man, the Justice System has done it two decades ago, it’s about time everyone else does. \r\nPlease do a piece on Michael Jackson.\r\n\r\n#spreadtheawareness #justiceformichael #hedeservedbetter", "time": "7 months ago", "author": "Plumikii Ryu", "channel": "UCY0YVH8TbnYIZpoEQWBwQFA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSOveCLuz-z0TgK9MVtrn-hcUPVSOsWzb45Sxmq=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyhBbJOyOKFId8s-_94AaABAg", "text": "Want to help save the planet?  Here are 6 things every individual can do to save the Earth:\n1.  Go VEGAN (food, clothes, accessories, toiletries, furniture etc.)\n2.  Consume products LESS and become an INFORMED consumer.  \n   -  Don't buy anything new (except if necessary, like medicine or contact lenses).  You can buy basically everything USED or make it yourself.  \n   -  Do your RESEARCH before buying anything.  Many products are destroying the environment via the extraction of raw materials, the production process, transportation etc.  Also production lines are full of human labor abuses.  Do your RESEARCH if you must buy something.  Remember, your purchase of a product acts to support that company and everything that went into that product.\n   - If you don't know 100% how a product was made at each and every step, then do NOT buy the product.  You could be unknowingly supporting the extinction of orangutans in Indonesia (ex. palm oil) or the destruction of the Amazon Rainforest (ex. beef).  No joke.  Stop buying products unless you are 100% informed.  Don't be selfish.  You  don't need most products.  Buy it used at eBay/Craigslist/Goodwill or make it yourself instead of contributing to the destruction of the planet.\n          - Check if the product has any certifications, such as:  RainforestAlliance, FairTrade, RSPO - Roundtable on Sustainable Palm Oil, USDA Organic etc.\n   - Stop buying via Amazon!!!  It has rampant human rights abuses that have been clearly reported on many times, including abuses and neglect during COVID-19.  In addition, despite some of its 'climate pledges', Amazon has a terrible negative impact on the environment.  Think factories, energy-usages, packing for all of those boxes, carbon emissions for the trucks that deliver them etc.  If you buy via Amazon you are supporting human rights abuses and environmental degradation.  Do you really need that product?  Just buy it used or at least directly form the actual company.  Don't be selfish, be responsible.\n3.  Go plastic and packaging free.  Don't buy anything with non-compostable packaging, or that's made of non-environmental material.  If you do, make sure it's recyclable and recycle it properly.\n4.  ADOPT and REDUCE family sizes.  Humans have overpopulated the world and are destroying the environment as a result.  The human population is almost at 8 billion.  We need to intelligently and voluntarily work to get our numbers down to at least half of that.  It is a very personal issue, but please consider adopting children instead of creating new children.  If having biological children, consider smaller family sizes.  \n   - Donate money and/or volunteer at organizations that support women's rights and literacy.  On average, women's illiteracy rates are inverse to the number of children they have.  I.e. the number of children a woman has decreases as she becomes literate and more educated.  Here are some ideas:  Room to Read, World Literacy Foundation, Malala Fund, UNICEF, Campaign for Female Education (CAMFED), Afghan Institute of Learning, Invest in Girls, Educate Girls, AGE Africa, Asante Africa Foundation, She’s the First, Forum for African Women Educationalists (FAWE).\n5. VOTE and become politically informed.  Make sure to stay politically informed and pressure your local, state and national representatives to support issues and legislation that save and protect the environment and species.  VOTE during elections.\n6. Use only RENEWABLE energy and use LESS of it.  \n   - Stop flying unless absolutely necessary (and buy carbon offsets if you do).  Walk, bike, ride a velomobile, use public transportation instead of gas-powered cars.\n   - See if your energy company has an option for you to buy green energy or support green energy initiatives.\n   - Install your own renewable energy sources, like solar panels.\n   - Be conscious throughout your day and use as little energy as possible.  Ex. instead of turning on the heat, just wear a few more layers and close the windows.\n\nWe can save the planet if everyone just does their part.  Everyone please act!\n\nCheck out this presentation for more information on human impacts on the environment and what you can do to help:  https://www.youtube.com/watch?v=YP83Qz6TabM", "time": "9 months ago", "author": "OneWorld22", "channel": "UCfImtdq6CFl50380Elm_JWQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRoKjqlAUENtjQv-dK3Ll8625J9dn8IP1lcekWyjw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx6Qw-L73Clk_rD3H54AaABAg", "text": "who's watching in 2020", "time": "1 year ago", "author": "Fredrick Akuamoah", "channel": "UCLd-gn04L8mipumCAyCBuUg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSHg_ddVeke8Hx5lv6aPLYu4OWAb10uIX_7saCjiA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgwX2Ulhm2zElb5-nT14AaABAg", "text": "I'm watching last week tonight from 5 years ago cause there is no new episode this week!", "time": "1 year ago", "author": "Mateusz Makowski", "channel": "UCrtjYjZN7qK0KJmCiHi5ktQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQyTn2r-UPOyyIvzuwGW8qQKiwfGy8HBHPs0It37A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyOk_B3Jbx82h_Yusx4AaABAg", "text": "Watching this in 2019 as the Amazon burns feels depressing, hahah", "time": "2 years ago", "author": "JustAskJesse", "channel": "UCxm5Me20kaQANlyx9MLBqMA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQ3OVfKMrDzkFse0FQfwkdjQ8TR4lnBWXg39Vw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxqSRFOaUQFbXJFw-94AaABAg", "text": "Watching this in 2019... its crazy in the future people are denying climate change", "time": "2 years ago", "author": "Cliona Oregan", "channel": "UCFv4Z_4nE4TnIxXZwj-cwWQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRHYR5hXHtB_0V0hlkzAlFar2FmtEkTXXAtFSP3d4s=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx6B9mtEaSjRPIaOvh4AaABAg", "text": "Still watching and laughing in 2019 (5 years later) where nothing has changes and things have gone from bad to shitty!\n\nYeeey", "time": "2 years ago", "author": "ramun dashuhn", "channel": "UC9E0Uym_J1_4Dx6fp-_5ngw", "votes": "16", "photo": "https://yt3.ggpht.com/ytc/AKedOLS2Smk9GIkOr0XQ4nybTTxjOBUb-2L5pdev9OKy=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyXm3huhaWx_em33iF4AaABAg", "text": "Wait, \nIs he missing a tooth or am I just crazy?", "time": "2 years ago", "author": "Ayla Porter", "channel": "UCQk1GC-dpsPZ5FmyZfaQBEA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQD8I3Vel_0GKBZYEUFXxc8GnXyYYBO6LrOjGXnhQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyREbntOP0JcQOfhrV4AaABAg", "text": "I love this show", "time": "2 years ago", "author": "Hlelo Hokolo", "channel": "UCUx35K4r5BuVKdvPdfisx0A", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSkn2fAyZA37CEmfZNAMhSaOVGj76SILyapsAhuQ1w=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxOX4jczNy9Ubag0P94AaABAg", "text": "IT'S ALMOST 2019 AND IT'S SO MUCH WORSE. AAAAHHHHHHHHH", "time": "2 years ago", "author": "Gabby L", "channel": "UC2rSPSRnlJO9QlfnYQ1ffLQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSqBCUGTsd6D7CxPGPB3ggP8yDmi2VL5Pqr02IimA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugxu4kGWfspXRm5SeDx4AaABAg", "text": "\"You don't need peoples opinions on a fact\" words to live by.", "time": "3 years ago", "author": "Rennis Tora", "channel": "UC7gXZAPn3lMsWhZLIzk-h3g", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRdBNlghx8zE1xs-N7uURPq0swdjPxNI4tLqE6i=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgxKlYbvwD4NkcbhtYx4AaABAg", "text": "Whether you believe in climate change or not, there is a thing called poison in the air, water and earth from fossil fuel that is better remedied by cleaner alternative energy.", "time": "3 years ago", "author": "Duly Noted", "channel": "UCDUmaMbWZtVL3a8D5Eol3jw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQUBb_HRNGoLut9RHxIv_XY3hc5AjbBSdG6_9vh_w=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugzuv7y28uX6tIUx5kZ4AaABAg", "text": "The zeal and aggressiveness of climate believers in insisting it's a fact and irrefutable is the most obvious clue that this is politics not science.", "time": "3 years ago", "author": "Danioton", "channel": "UCsGpPg98skS5oKgC5jFv5Dg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLR_wpy53wyxfNSMYPeOcB4CFMA5GLIFdDgFIg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghteFwVPz1J7HgCoAEC", "text": "Couldn't commit to a like button but I do agree with the segment.", "time": "4 years ago", "author": "Red H", "channel": "UCwnGIbjElXEKXf6naCz1MoA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQjP-r0xJxiVu_LJgOxgNzq3uUItOdOW2JbpS-O=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiW4Kg4l-vxOngCoAEC", "text": "CLIMATE CHANGE IS FAKE", "time": "4 years ago", "author": "Ринат Хамиров", "channel": "UCth1000frvDoE0AjvCQjNRQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRykJsHWvQidm_sPI985MgmizofZ-AGCXVCSQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgguUp1g4cpu6ngCoAEC", "text": "But are there owls in hats? A quick google search tells me that, yes. Yes, there are. On another note, I have a new favorite google search.", "time": "4 years ago", "author": "Ghostfield", "channel": "UCslXHDoepI2tDpNrzOZl_GQ", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLT7P1GmWHuVruDE1_4pOQJ7MiryieSagush9XzxFQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggwcxDMjI6XsHgCoAEC", "text": "Oh how naive we were!  To think it didn't matter what so many of the American citizens believed about the copious, irrefutable evidence of climate change, when they would \"elect\" a Tamarin to run the freaking country only 2.5 years later!  RIPEPA :\"(", "time": "4 years ago", "author": "Nicole G", "channel": "UCdn-GxxOhvGshvETyaM7bFw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLROxMNhtonWidtgS4Eqi1OG6VDLQCVnfQGo7TFq=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiHxt3vgnID4ngCoAEC", "text": "WHahahahahaa THANK YOU!!!", "time": "4 years ago", "author": "Luoarnamsk", "channel": "UCI1ujymGFfooI095enpDCVQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSRCtSfIKg_kUFi5fCBqF_aVoOCI83uSjB9pQj64w=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugh0LoZyd_OCP3gCoAEC", "text": "Even if I wouldn't believe in the facts proving climate change at all (which I actually do), this whole issue would still boil down to a simple question: What if we believe the one side yet the other one is correct? If we fight the climate change at worst be burn some money to increase lokal life conditions even if global \"consequenzes\" don't occur - sounds like a fine deal to me. If we believe the climate change to be nonsence and are wrong, we're fucked.", "time": "5 years ago", "author": "DaijDjan", "channel": "UCJ44vCx5I1_AMiGg-HF7o-A", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLShHDA-jEjLzY7XRMWZkgPkGEDJfX46BFEkFmxl=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiH5DE-88OM3XgCoAEC", "text": "Lots of smart comments here I see..\nClimate change is a 100 per cent fact. The global temperature is rising. But not today's nor tomorrows human actions will change it in a meaningful way as it is a natural process of this planet much above modern human ability to affect. People should read and learn more, not just see selves as center of all. \n\nIts gonna be a bumpy ride.", "time": "5 years ago", "author": "Janis Logins", "channel": "UC0YYeNhuRIJoG5tV79BK8fw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQqIm3DLvQ0zeWtVsRrf7GsmaMuga43qTDcPY3EmQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugx6B9mtEaSjRPIaOvh4AaABAg.8wZNxRVwsa59RwTbCvcJcR", "text": "Oh 2019 😔 how good we didn’t know we had it", "time": "1 week ago", "author": "Lillian Keairns", "channel": "UCa76T56Xq8cyPqs3H3GnbHQ", "votes": "1", "photo": "https://yt3.ggpht.com/8ejaht6yioNHxuJbh10k_hxdFk4JjXv2z79VYH-KvdJ9tbq7ZaagokOZaIPvf3xp3XsNrZG2JQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgyXm3huhaWx_em33iF4AaABAg.8qhrdOYQKvb9Caqp3nvKBq", "text": "He is british. It is mandatory for child registration", "time": "1 year ago", "author": "Don'tSpikeMyDrink", "channel": "UCpVY-zvBy3X2jFRtzTJFKaA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTp9xTUd6V6FxXb4BXr9kq2ONorb9R7Nq5JxmFuoA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugh0LoZyd_OCP3gCoAEC.8Ge4uPh-rxp8L16gcofdE7", "text": "Basically Pascal's Wager of Climate Change.", "time": "4 years ago", "author": "Koro Sensei", "channel": "UCsq--vOQsfn4DdiSkdF8BSg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLR1ye2Yai0f8E1ydvq0VCef6tZAAd1JYFVAw_rd=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiH5DE-88OM3XgCoAEC.8FTLV4-vqC48L16cYm3yDD", "text": "I disagree. While the Milankovitch Cycle is a significant contributor to rising temperatures, human activity (deforestation, fossil fuel consumption, etc) is still, by far, the biggest culprit.", "time": "4 years ago", "author": "Koro Sensei", "channel": "UCsq--vOQsfn4DdiSkdF8BSg", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLR1ye2Yai0f8E1ydvq0VCef6tZAAd1JYFVAw_rd=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ughx4aMYrrb0EngCoAEC", "text": "Ehhh fuck 'em", "time": "5 years ago", "author": "Maxie Jay", "channel": "UC4YbUYiTZ4j_3epmKXHpLkQ", "votes": "12", "photo": "https://yt3.ggpht.com/ytc/AKedOLSdrk8BYxVekfHQVQW62ie8HWfy45VUmQVbfR-n6g=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugj86TEpTtjdCXgCoAEC", "text": "@LastWeekTonight", "time": "5 years ago", "author": "LACM", "channel": "UCs3eu5lKASyepHsnZZC1zQQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSD7vccnedXCoT-zLo-di7RP37XXcSIta5PYQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugh8dvD3HodYGHgCoAEC", "text": "@LastWeekTonight", "time": "5 years ago", "author": "LACM", "channel": "UCs3eu5lKASyepHsnZZC1zQQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSD7vccnedXCoT-zLo-di7RP37XXcSIta5PYQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgieplI8r62cnngCoAEC", "text": "15 is not bigger then 5 what's next are your \"owls\" real", "time": "5 years ago", "author": "fantage20012", "channel": "UCNt9aQmlFOW-_qc8-ZeaKCQ", "votes": "34", "photo": "https://yt3.ggpht.com/ytc/AKedOLSn06VZBBpv48nntGjDfa-_sfQxjWukCHdyxpkz=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugin60eFJmrE1ngCoAEC", "text": "How many people actually care about climate change John, I mean actually care", "time": "5 years ago", "author": "Will Morrison", "channel": "UCusKcj9CJm4gpTK7zPwm5Jg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQNIGQGxzuv-mASinFgqtl5io-z4XPBgkW5Hw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugif2kdGYKneG3gCoAEC", "text": "If they where willing to listen to reason we wouldn't be having this debate in the first place. It's like talking to someone who thanks 911 was a conspiracy or UFOs. OK  OK UFOs might be real and Bigfoot but that's it.", "time": "5 years ago", "author": "Mr Dr Prof Patrick", "channel": "UCEcUb5jvpJUE9nTl_J2brxg", "votes": "7", "photo": "https://yt3.ggpht.com/ytc/AKedOLRFgONLpF92FCiWBm1QOcoFzbhjjcaDDqfVRZRE=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiiYRjINpncYHgCoAEC", "text": "I love your comments and I think you are HOT! Tend to agree with you... However... If Americans don't acknowledge the issue. They will not take action and be part of the solution. So yes! It's important to address that the fact that 1 in 4 are skeptical", "time": "5 years ago", "author": "Jeshica Vargas", "channel": "UCTw0RO6ELFnoW5efHVo-jXg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSR_S7qaYZWtgDlcgFDVUG7A9DgGzeqokBuVU-X4A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgheFsSBS4w_sXgCoAEC", "text": "But why do some people still claim that global warming is an unproven theory and not fact?", "time": "5 years ago", "author": "AB", "channel": "UCLIAzC1TIGqus_Yz32Tt8OQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTtSmk-dH1FeMVSMltbUTjh8MfJb5nGKZ2O6gkaQX0=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugj4066KvHxYkngCoAEC", "text": "Politics are amazing. We trust people to make up problems and then pretend to fix them... Oh and we pay them immensely well.... We shouldn't be worried about climate change, we need an attitude change... We are living the real version of the movie In Time.", "time": "5 years ago", "author": "Atlantis Morissette", "channel": "UCxh-UBSKLddpRvgwqXL7pOw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTKl_AJr7AoV9XxPic-YUqAcpLhvNNje7aWw9Mh8Sc=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiwK8aMw9H7kXgCoAEC", "text": "Earth? Must be some backwater planet around some no-name star. I've never heard of it.", "time": "6 years ago", "author": "Guarding Dark", "channel": "UCTg_svdtftUsaWkRplhxp9Q", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRvu9lKZrMaNaiiQF2w6riq5mI2JQF_hhUSNRW87g=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggRasrigTp3CHgCoAEC", "text": "Here's a better question:\n\nIf the era of the dinosaurs had intense heat and humidity, followed by the Ice Age, where every living thing got scrotal frostbite, which then thawed out and became the climate we know today, what's to say this isn't another one of Mother Earth's wild menstrual mood swings, instead of humans having such an damning impact on it? I'm not saying that we aren't partially to blame for the current state of global affairs, but I highly doubt that we're capable of enacting change in the 800 or so years we've been spewing gasses into the atmosphere, when the same changes took thousands, if not millions, of years to do the same thing.", "time": "6 years ago", "author": "sergeantassassin3", "channel": "UCtlbRx67joeYYWx1DVX712g", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLSrxg3xfCmaui1pllgvmGw3kgXGkaj5lc0Gv441=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgirTEe0_6QgdXgCoAEC", "text": "\"That blue thing Bruce Willis is always trying to save\"", "time": "6 years ago", "author": "Joia Simonson", "channel": "UCvGiaSzHTVxzLnbPmLc1WLA", "votes": "5", "photo": "https://yt3.ggpht.com/ytc/AKedOLTTpzdT3cw8IrHnT8JUqc_hLMZbzEcBs4aVB8rx=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghQrIDGuU9quXgCoAEC", "text": "Climate change should not be a skeptical subject but let's be real, itis very much over exaggerated, it's kind of natural you know in a way and blaming humans for every single aspect of climate change is retarded. All of the continents once made up Pangaea.", "time": "6 years ago", "author": "ominira mars", "channel": "UCAlHxHZhb4PrOGGY_hOJ_LQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQToM0PWuU7zywVIsx3na6q1X6fYqlaTWWzLSaOSMA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghRgCPk8mF4Q3gCoAEC", "text": "LIES! Climate change is a result of all you lefty liberal types all conspiring on an international level and with immense intricacy, going as far as to fake extremely compelling evidence, with the agenda of...\n\n... of...\n\nBUT ANYWAY, right wing media oligarchies with vested interests in doing nothing about alleged climate change such as ties to major oil companies are CLEARLY the reliable source of information. \n\nShowed you, damn commies. Next you'll be saying that guns make shooting more likely!", "time": "6 years ago", "author": "Matt Charman", "channel": "UCjOTy4tdFoDTJMfbObEcUCQ", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLSSmwBjNC5q_Au7nsXAL7Jj0wVdJVMdXulM7z2-=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiMa1Woo6m3UngCoAEC", "text": "I don't believe in owls. Clearly a lie fabricated for Obama to peddle the liberal agenda.", "time": "6 years ago", "author": "World Champion Dabber", "channel": "UC01cGQIUhu-9c1Fvk_IUZTw", "votes": "161", "photo": "https://yt3.ggpht.com/ytc/AKedOLQFEkCvT3HzEZdlmgD-LMmdu7Mzje0p88_1JA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ughk5B-6Ins7WHgCoAEC", "text": "I've been watching LWT videos, procrastinating on my Climate Change Debate Project, and here I am.", "time": "6 years ago", "author": "Pranav Eswaran", "channel": "UCzFvk9lUU8nCldju6wMBtgA", "votes": "13", "photo": "https://yt3.ggpht.com/ytc/AKedOLT1Y5dgR6K5CeDfpxIKBn8dlrKxu1y5bzGaVQP4fis=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugjpx-zZpxR8cXgCoAEC", "text": "The climate is always changing....wayyyyy before humans.\n\n\n(notice how they don't say global warming anymore?)", "time": "6 years ago", "author": "bigwalt2990", "channel": "UCm5kxlFdE5Ve_qR6a2nK6fw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSLvoixqqeWqfOrshvmDcTuHzjtTJ3Epnx8UEBE=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgggbtkqmhLVhXgCoAEC", "text": "Fact is John, the earth has been colder and hotter thousands of years before humans started pumping gas into their Mercedes. Might want to do a little more reasearch before you start cramming things down our throats just because we watch your show.", "time": "6 years ago", "author": "TekReviews", "channel": "UCCxE3kVJsS-DfaU0RLzK6kg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRqVXKFo422WBFKvS54mePfAT8gpJDajWwMfQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggtG3MsRnhrpHgCoAEC", "text": "He did a video about people who get paid for research on Sugar say it doesn't harm us, usually are biased because they are paid for it. Climate Change Scientists who agree it's real are also paid for by Govt's and big corporations to do their \"research\" and of course are also going to say it's real. Go figure, they get paid for it and they agree! Biased, nah..", "time": "6 years ago", "author": "TekReviews", "channel": "UCCxE3kVJsS-DfaU0RLzK6kg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRqVXKFo422WBFKvS54mePfAT8gpJDajWwMfQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugi7p4eEEmZyWHgCoAEC", "text": "Too short moar plox", "time": "6 years ago", "author": "russneho", "channel": "UCVC5fXNbLoOKpLdsxhEY4jQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQ1T0rjdzbyRRrJh_pP3BO5_fx3UzNi_UbytjeV=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugif2kdGYKneG3gCoAEC.8ALVpkW7YeI8ASQDXCeYd2", "text": "+Person I was being sarcastic on that last bit but i guess that wasn't apparent. If someone doesn't believe in climate change they might as well be wearing a tinfoil hat. But i have it on good authority that the Loch Ness monster was behind 911 still digging.", "time": "5 years ago", "author": "Mr Dr Prof Patrick", "channel": "UCEcUb5jvpJUE9nTl_J2brxg", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLRFgONLpF92FCiWBm1QOcoFzbhjjcaDDqfVRZRE=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugif2kdGYKneG3gCoAEC.8ALVpkW7YeI8Jaani_FW77", "text": "Shut the fuck up. You can't even see your forehead.", "time": "4 years ago", "author": "Kung Fu Jesus", "channel": "UC9YG-w4Dc58Nc1AiCEYL8Ng", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQRxq62n_5afp0mPx8sIpPkSpFUzcmh5Et2lAi8=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiiYRjINpncYHgCoAEC.8A1K0XQTJgU8CRJr2EJOwY", "text": "+Jeshica Vargas Basically, democracy is stuck with the stupid voters.", "time": "5 years ago", "author": "Absurdist", "channel": "UCugjBr9gs7YOEOgiE2vaqXg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSKNviDi9W6yKtMixo9xCPZ7OjMOhQCHZpZ0Qyy=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiiYRjINpncYHgCoAEC.8A1K0XQTJgU8CRorHGE6Ei", "text": "+Absurdist :: So super hot puffin (JO) bringing awareness to the stupidlly obtuse is a must. Well done J. xoxoo", "time": "5 years ago", "author": "Jeshica Vargas", "channel": "UCTw0RO6ELFnoW5efHVo-jXg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSR_S7qaYZWtgDlcgFDVUG7A9DgGzeqokBuVU-X4A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgheFsSBS4w_sXgCoAEC.87BIqgmEJ5y88DSMOCWSwF", "text": "+Abhishek Krishnan Gravitational theory is still a theory.", "time": "5 years ago", "author": "Alex Gulino", "channel": "UCLh2BLL7QNBHxgzzMBb1ktg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLR_82CZpB1EaMC-_RwaWyJMewpUVbPL8rBuhorgcA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgheFsSBS4w_sXgCoAEC.87BIqgmEJ5y88DcTGZevNB", "text": "+Alex Gulino that's a point. But gravitation is more of an accepted theory. Why worldwide controversy on this?", "time": "5 years ago", "author": "AB", "channel": "UCLIAzC1TIGqus_Yz32Tt8OQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLTtSmk-dH1FeMVSMltbUTjh8MfJb5nGKZ2O6gkaQX0=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgheFsSBS4w_sXgCoAEC.87BIqgmEJ5y88F1Si7ET8q", "text": "because it's all tied to money/politics.  Oil/agricultural companies have a ridiculous amount of money and a lot (too many) politicians have highly paid jobs waiting for them at those companies or one of their shell companies with great benefits and no responsibility if they don't outright own lots of stock in them directly.  \n    There is an obscene amount of money in polluting the world and they all want their piece so they assume the next in line can get the job done after they've staked their claim.  It's a little bit of this mixed in with a very disheartening amount of corruption both thinly veiled and obvious...but no one does anything about it because a lot of it is legal.  \n    The only way it won't be is if the people stop voting for those people and their feet are held to the fire but they won't be because the media doesn't cover gross negligence in public office when big money is involved unless it comes out some other way first and even if it does there has to be an overhaul of the corrupt leaders in the system on a scale like we haven't seen since the revolution for this to be fixed even a little bit much less how it needs to be.  Anyway could go on forever off on a thousand tangents but I'll leave it at this.", "time": "5 years ago", "author": "Alex Gulino", "channel": "UCLh2BLL7QNBHxgzzMBb1ktg", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLR_82CZpB1EaMC-_RwaWyJMewpUVbPL8rBuhorgcA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgheFsSBS4w_sXgCoAEC.87BIqgmEJ5y8CBD0eH4Lv9", "text": "+Alex Gulino Do you even know what a theory is science is? There isn't anything above a theory in science.", "time": "5 years ago", "author": "John Doe", "channel": "UC-L9CkdKl6IWBG8MBuiiM5g", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQvKRajFh49uYQTTK18yk6VqwZlZcS8BI7Q0g=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggRasrigTp3CHgCoAEC.83QwpFzpIes7-_Et0N8bhj", "text": "+sergeantassassin3 But the change is there. We have measured a radical change over the last 100 years.\nAnd of course that's not Earth it self because as you say, it takes thousands or millions of years.\nI think that even if you consider the change that has happened over the last 100 years and you spread it out over the entire time homo sapiens have existed, you will still find it a very rapid change.", "time": "6 years ago", "author": "Emil Rais", "channel": "UCoNTzyL4TsInQcelZi9QV1A", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLS2SG7VIx_FbpVi0vaBxquoL-lWXUjSPCpatxIp=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggRasrigTp3CHgCoAEC.83QwpFzpIes7-h9bLTWwjl", "text": "Where do you get that number from?\nAll the graphs show a huge very visible change from the 1920's to the present day.\nThe notion that we as a species is too insignificant to affect the Earth is false.\nWe are hard on mother Earth when it comes to pollution and consumption. The way it presently is, is extremely unsustainable.", "time": "6 years ago", "author": "Emil Rais", "channel": "UCoNTzyL4TsInQcelZi9QV1A", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLS2SG7VIx_FbpVi0vaBxquoL-lWXUjSPCpatxIp=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggRasrigTp3CHgCoAEC.83QwpFzpIes70EobvFLP_7", "text": "+sergeantassassin3 Science, data, statistics...those things.", "time": "5 years ago", "author": "Richard Desjardin", "channel": "UCVSgALdluDIiQ-vQbfo2RgA", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLQRRnQHZW1P8lFunrpHyy_sl1suzcsVDEe-ORgfXQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggRasrigTp3CHgCoAEC.83QwpFzpIes86clfYQq81P", "text": " @Belle Hocson  Do you mean: Legitimate, funded research? Because no, I don't have that kind of money nor interest.\n\nIf you mean: Did I look up facts, statistics, etc? Again, no. To be fair, this weakens my supposition quite a bit, and I acknowledge this. However, I'm going off of what I remember from high school, with 0 research beforehand.\n\nAs far as I remember, these changes in temperature and humidity on a global scale were long and drawn out, not immediate. Now, once again, I'm not saying that we have absolutely no impact on the Earth, because that would be stupid. What I AM saying is that it's rather hard to believe that we're doing something as radical as global climate change in under 1000 years.\n\nIf we were to take humans completely out of the equation, it would take Mother Nature theoretically thousands of years to accomplish what others are proposing we've done in under a thousand. To me, it seems farfetched, almost fear-mongering.", "time": "5 years ago", "author": "sergeantassassin3", "channel": "UCtlbRx67joeYYWx1DVX712g", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSrxg3xfCmaui1pllgvmGw3kgXGkaj5lc0Gv441=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggRasrigTp3CHgCoAEC.83QwpFzpIes87vOk0I4c2X", "text": "+SuperCorrector1 While half a degree or a few degrees may not seem like much, that small change can affect the entire world: ecosystem, freezing and melting patterns, forest fires, storms, etc.", "time": "5 years ago", "author": "The Tesseract's Shadow", "channel": "UCp4PWBBhvPzEHeYFXSZLLcw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLTGigP-mKKIFEtMDsaMWLVUVRcGVXr_GFCjdJ1xkg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggRasrigTp3CHgCoAEC.83QwpFzpIes87xFBBIYKU0", "text": " @SuperCorrector1  What matters is how fast it changes, the ecosystem can't adapt fast enough to current climate change, which will cause life forms to go extinct.", "time": "5 years ago", "author": "The Tesseract's Shadow", "channel": "UCp4PWBBhvPzEHeYFXSZLLcw", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLTGigP-mKKIFEtMDsaMWLVUVRcGVXr_GFCjdJ1xkg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghRgCPk8mF4Q3gCoAEC.80mrvC-3jAr8DAAuJtVoPa", "text": "I get that this isn't serious (and it's actually kinda funny), but it's also sad. Some people actually think like this.", "time": "5 years ago", "author": "gingergamergirl98", "channel": "UCMxz-wkc_WEhh5gCE7R-p0w", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQmo6dIwugdKTpv0LSEXNJFqYEp46Wm3yN6zppu=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghRgCPk8mF4Q3gCoAEC.80mrvC-3jAr8DAC-Kpn92I", "text": " @gingergamergirl98  Aye, shame isn't it? It's very sad that this has kind of weirdly become part of the right/left argument when really it should be a very serious concern for us all, regardless of political views. ", "time": "5 years ago", "author": "Matt Charman", "channel": "UCjOTy4tdFoDTJMfbObEcUCQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSSmwBjNC5q_Au7nsXAL7Jj0wVdJVMdXulM7z2-=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiMa1Woo6m3UngCoAEC.8-IfiSjdqHA7-cYXCeS-sS", "text": " @ohjawillkommen  Your comment deserves more likes", "time": "6 years ago", "author": "Juzzy K", "channel": "UC68zVhPV-Wxmxol-Rgo0q7g", "votes": "5", "photo": "https://yt3.ggpht.com/ytc/AKedOLR7lPUp41FPwXdII2FlI8rbEK5LlndgxJaHQvb4Ew=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiMa1Woo6m3UngCoAEC.8-IfiSjdqHA71rYUBxHcxb", "text": "I gave him likes", "time": "6 years ago", "author": "Gigabic", "channel": "UCb6tt1YjoBhvxzGcVfSlRvg", "votes": "4", "photo": "https://yt3.ggpht.com/ytc/AKedOLRHLUQzSYDE3gW84-HUa1rkV2_AoQCI_L113jjK=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiMa1Woo6m3UngCoAEC.8-IfiSjdqHA86Vv4A0DBeM", "text": "+ohjawillkommen \nOwls are not what they seem.", "time": "5 years ago", "author": "Winston Knowitall", "channel": "UCezb95vDIojDDPTGOBPXVIQ", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLS_od1fL-r9dGHDqrw-V9KHpYuoNbDdIOSaR7lq=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiMa1Woo6m3UngCoAEC.8-IfiSjdqHA86kdd33SE65", "text": "+ohjawillkommen Tonights episode in .... THE TALKING DEAD: \"Arghhhrrr Climate Always Changes!", "time": "5 years ago", "author": "FireDunebuggy", "channel": "UCuSL4_1p7Gw9g1vRMqzuKNQ", "votes": "5", "photo": "https://yt3.ggpht.com/ytc/AKedOLQZus9VXJT_q9H9F8lv1mCc7ML895uAXX5HCLQBVA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiMa1Woo6m3UngCoAEC.8-IfiSjdqHA8BrgdwN-YTV", "text": "also known as \"not giving a hoot\"", "time": "5 years ago", "author": "mushnoodle", "channel": "UCmBrb4sx7NR3JJ32UpCazNQ", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLR6L80EZ4WMStpiJ2bVLPL0d9lwbpy0MvTykQiq=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugjpx-zZpxR8cXgCoAEC.7za07osHW-175sf-88HFVr", "text": "+bigwalt2990 It was called \"the greenhouse effect\" back in the 1970s, and that was the most accurate name for it.", "time": "5 years ago", "author": "suicune690", "channel": "UCXEACyZDI7F_pVio4dBdDDQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSJbjRwwCF1DevP6JROY2OVeb-vOzenliq-j2Ps=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugjpx-zZpxR8cXgCoAEC.7za07osHW-18DAEqNOEeeo", "text": "It's because inbred morons thought that global warming (aka 'an increase in the average global temperature' aka global climate change) meant temps would just rise literally everywhere (ie not understanding how weather works.) \n\nThat's why where I live, winters have been all fucked the past several years. Hardly any snow one year with much warmer than normal temps, heaps of snow with (very) below average temps, the past few years we've had polar vortices (which shouldn't be affecting the middle of the Great Plains), and this winter alone had hardly any snow to begin with, but we had snow earlier this month. It snowed in April. That's absurd.\n\nIt's not hard to find info about why average global temps rising will make some places colder, some warmer, some drier, some wetter. Look it up, instead of listening to 'scientists' that are bought and paid for by coal and oil companies who don't want to lose business.", "time": "5 years ago", "author": "gingergamergirl98", "channel": "UCMxz-wkc_WEhh5gCE7R-p0w", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLQmo6dIwugdKTpv0LSEXNJFqYEp46Wm3yN6zppu=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgggbtkqmhLVhXgCoAEC.7-H0Z7-CiT973Db_Y9BeQF", "text": " @TekReview's  you are sad sir!!!", "time": "6 years ago", "author": "CRAZY_ABE", "channel": "UCoRrDPhHKPxz4T9msXeMEow", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQZR3BzYF9tWji_yPCUVs5k4kwDP1JwuniF9w=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgggbtkqmhLVhXgCoAEC.7-H0Z7-CiT973DjwxCHTVv", "text": " @Abhijit Khapekar  Look up climate conditions from hundreds of years ago even a few thousand. Truth hurts doesn't it! They just announced last month the Ozone in the Northern Hemisphere is already nearly back to normal, 10 years after outlawing toxic chemical in Aerosol cans. Educate thine self sayeth me.", "time": "6 years ago", "author": "TekReviews", "channel": "UCCxE3kVJsS-DfaU0RLzK6kg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRqVXKFo422WBFKvS54mePfAT8gpJDajWwMfQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiTYyrosTlbdXgCoAEC", "text": "damn it, heat waves, yes! I want climate change! Fuck freezing cold ass winters! ", "time": "6 years ago", "author": "Imperator Megatron", "channel": "UC5-pMlz_lVeloco3825qPhQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSKMYjRQNIZleXr_6HIyYhrOt_4ZLE7vRAcsK-ygg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ughc7Rum3FNDH3gCoAEC", "text": "south park said it: one in four americans is retarded.", "time": "6 years ago", "author": "AK48smoker", "channel": "UCBWxaTiZRdrXY9T5JkG4nYQ", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLRxrfF_Dx210iiCycyD4I1HNe9s-r5JU6Y3kBqN=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC", "text": "It is Jan 09 2015 and that global warming is a real bitch--70% of the US population are trapped in a record deep freeze--about 80% in Japan--but limey fruit cake Jon Oliver says global warming is real so it must be true--I say deport has ass.", "time": "6 years ago", "author": "chad haire", "channel": "UCQM0aoCSLULHvge0BXcX9KA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQShcArS1Y-nHoFo77TJEowgKtCQTDKTe3z3xGyxg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghMXFxMljzxongCoAEC", "text": "The two party system is tearing America apart. ", "time": "6 years ago", "author": "Buddy Supreme Noodle Dreams.", "channel": "UCGS9FD-_CtyoNbALqPB-V4g", "votes": "9", "photo": "https://yt3.ggpht.com/ytc/AKedOLT5jM-I-WBzyhJlif8Teva5Vqdcs4fpGkh4Joh9=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggSesKSVkYXPngCoAEC", "text": "Very good piece though I disagree with him on arguing over facts. It does matter how many people open their eyes and realize climate change is a real threat so they actually get up and help other concerned individuals actually do something about it.", "time": "6 years ago", "author": "svscared", "channel": "UCHLBmoDN8NUBXEm75G6E8GQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQhzITnjFnwDZTVOJm2vCbmrLcs_GvGeNvClw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugh1aAiNcen8v3gCoAEC", "text": "When you are not an American, and see that neither in your country nor anywhere else but America climate change's existence is debated, you know it has turned political in that country.", "time": "6 years ago", "author": "Er G", "channel": "UCrP-Qo8bGIRjfBNHVh8jbYA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRHIzynxKjnUciblcAmT2sHBMq6XR2hDRu7ug=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJJEn3Kxj2u3gCoAEC", "text": "Damn polar bears they drift away from greenland to Iceland and eat my sheep", "time": "6 years ago", "author": "LongJohn88", "channel": "UCUC5XOKHwwrQScVwhZZGeNA", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLTXAVaj1YYAARfZxxFLqDMMGk_tlyuzx_7v3Ca5=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC", "text": "I won't deny climate change is here, I just really don't give a shit. It's nature. Nature changes all the time. And we're just part of nature. It's just that we realize that at some point, we humans will go extinct. And that's what bothers so many people when they're \"worrying about the earth.\" I won't say we aren't treating the earth badly either. I think that needs to change. We're all part of it and we should take care of that thing we're part of. But climate change and the possibility of going extinct should not be the sole reason for that. ", "time": "6 years ago", "author": "Fantastick Roze", "channel": "UCHkDoS7vGHz9iMJZhLELa2A", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLQxxcGhgLu84SoRefNO6KCsxBz35FfQ6A4pdyUw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiPN6dgrMAAr3gCoAEC", "text": "Meh, fuck 'em", "time": "6 years ago", "author": "akuffo96", "channel": "UC5FNrFcYw2P-h2aTnovwKjg", "votes": "30", "photo": "https://yt3.ggpht.com/ytc/AKedOLRrTW5WVP1UwfYm3pxggum91ihhkZdwhgib6A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugi_Rq5H2zY3ingCoAEC", "text": "Al gore should be put down for causing mass paranoia, though it IS what north america does better..", "time": "6 years ago", "author": "Willskull", "channel": "UC5jxT5VSexZHEy8NklsHn2Q", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSxaOQk9WmxwA6z-nRhmDSpdVsfyywbVY0D9ns1Tg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghpQsPMqpbLaHgCoAEC", "text": "Actually, climate warming isn't entirely a bad thing. If it wouldn't exist the Earth would be now in an ice age, or so my geology professor says.", "time": "6 years ago", "author": "Dominika K.", "channel": "UC16nDoiUFhXbj4-PNASaSzg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTXKv4OT29jPfYpqEEFdnQdnZ5gXKYHafhPig6w4A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugh8jvlcsns5JngCoAEC", "text": "its sad to think that john oliver might not read this.... but he should know that CNN lies and omits. a lot.", "time": "7 years ago", "author": "wiximar", "channel": "UCb7H_4Y-KnCD2xbMWVRLaWg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRvDeWNCi_AnmLwTYjjjrRzS7evtMKB-dR9zCUTGg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugje_Ifa_HYtC3gCoAEC", "text": "global warming -> climate change ->mmm what will be next? maybe global cooling (like it happened so many times before.. and OFC again caused by man with tons of political sh*t and nonsenses :D", "time": "7 years ago", "author": "Marek Pilař", "channel": "UCXyOjXUzIiqloGLiAzrEDTw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRTywEyITizhdHTxe6kGgFsKyYOcTelf_5GfQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugi6PcHxUsCei3gCoAEC", "text": "Would have liked to have seen more of this segment.", "time": "7 years ago", "author": "AthenaSchroedinger", "channel": "UCr6V7NRZtL8nFILO1gh0Fdg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLS_7pEO9Zmde2cCsEyoNXGJzTK4hwvJJARV_A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgjmF7jo1cVG43gCoAEC", "text": "i was going to say \"don't be that person.\" but would that person be for or against climate change.", "time": "7 years ago", "author": "West", "channel": "UC6uixPxnEj5MQ7GLgvey-kA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQ6dXy4uxCqCFKr_XaW-vHQZmeZTSGUHDoggg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghIFqleQcf29HgCoAEC", "text": "NOOO! don't cut me off... I want to see the conclusion ;_;", "time": "7 years ago", "author": "Kokocipher", "channel": "UC1KUZCWJ24VOOTGrOH-03vA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQOHZ_czWtDyLwr90cVmndyRTECAEdgfDDJM64O=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghyXcc7qLbbBXgCoAEC", "text": "Also, we can't STOP climate change. Nothing, NOTHING, lasts forever. It's a fact that climate changes even before. (Remember the Ice Age?) Anyway, the problem here is that we fvcktards made it CHANGE drastically to warm and cool to burning hot and frosting cold. So, yeah, that's the problem. We sped things up, now we can't turn back. If PEOPLE were to try and change this, maybe we could slow this again.\n\nHow? Well, remember the three r's. Well, what are we waiting for?", "time": "7 years ago", "author": "SecretMan TwentyFive", "channel": "UC3kgIZ2_D7zH5jZlJ0OInzg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQWgykB2yUzT4wMvHtBxpIlPlliiIAm270kBeZz=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugjpnl_SQccIQ3gCoAEC", "text": "But really, are people that too oblivious to not NOTICE these things? Well, RIGHT, those people who said they are skeptical have TOO much air conditioning and TOO much fat. Just saying.", "time": "7 years ago", "author": "SecretMan TwentyFive", "channel": "UC3kgIZ2_D7zH5jZlJ0OInzg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQWgykB2yUzT4wMvHtBxpIlPlliiIAm270kBeZz=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghatUqY8q3rPngCoAEC", "text": "There's something I've never understood. Because I know about Climate Change and the world getting hotter, I just don't believe that we caused Global Warming, It seems more like we're in an interglacial period.\nHowever, I like recycling; I like the idea of using less energy (better for my power bill); I like less CO2 emissions and lessening pollution. I don't think all of that will solve global warming, but that doesn't mean we shouldn't be doing it anyway! Unless you're a huge arsehole, why would you stop people from recycling and lowering energy costs?\nI guess I'm what you call a Climate Change Skeptic, but that doesn't mean I want to stop you from doing what you're doing, that makes no sense. Look . . .\nIf you're right and we do nothing; the world sucks for everyone.\nIf you're right and we work to fix it: yay, saved the world, high fiveI\nIf I'm right and we do nothing; congratulations, we're not all boiling to death, but there's still pollution all over the place and I have to pay for it.\nIf I'm right, but we work to \"fix it\" anyway, then not only will there be less waste and less costs, but I also get the benefit of going \"Ha! I told you so!\" when Winter disappears.", "time": "7 years ago", "author": "KelniusTV", "channel": "UCwoL050Hd9vlxVnDsjj6M9Q", "votes": "16", "photo": "https://yt3.ggpht.com/ytc/AKedOLTWo2A8UpKogDj9xN-de5OM96DtLJBPde4voCtk=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugjlmtc2PYMfrHgCoAEC", "text": "climate change is real but its not man made its natural, watch this documentary on utube,,, global warming the great swindle", "time": "7 years ago", "author": "Skadoosh", "channel": "UC-NCwd427JphZhGqhrIrlnw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQny6Dvd8gat81w65z-y1pN_RBTpeV8zecxAA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiTYyrosTlbdXgCoAEC.7-H0Z7-B1k_72OxZ8_81D6", "text": " @Евгений Касперович  Yeah that is what people are saying here in the USA \"Where is that Climate Change we just had 4 huge winter storms and my ass is freezing\".", "time": "6 years ago", "author": "TekReviews", "channel": "UCCxE3kVJsS-DfaU0RLzK6kg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRqVXKFo422WBFKvS54mePfAT8gpJDajWwMfQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ughc7Rum3FNDH3gCoAEC.7-H0Z7-Ff218CRKKS5eFHl", "text": "It could be your mum, your neighbor, your dog. It might even be you! :p", "time": "5 years ago", "author": "Absurdist", "channel": "UCugjBr9gs7YOEOgiE2vaqXg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSKNviDi9W6yKtMixo9xCPZ7OjMOhQCHZpZ0Qyy=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B7-jwx64dJSC", "text": "It's called CLIMATE change, not wheater change. It doesn't matter if this year would be the coldest ever, the average is still going up. Go to school for once, dumb American.", "time": "6 years ago", "author": "xXxTr0nxXx", "channel": "UC_HI85NRHLCLsUHE33Q7KCw", "votes": "5", "photo": "https://yt3.ggpht.com/ytc/AKedOLSedMxsfacec_v6FRm_N6dyE9QvjXcm_LBCWg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B7-jz4JZbH38", "text": " @xXxTr0nxXx  Fuck you- how could the Euro clowns ever won a war with the Nazi's ans Commies without the USA helping your ass? Fuck you", "time": "6 years ago", "author": "chad haire", "channel": "UCQM0aoCSLULHvge0BXcX9KA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQShcArS1Y-nHoFo77TJEowgKtCQTDKTe3z3xGyxg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B7-kaxW3azAH", "text": " @chad haire \nHow could we \"Euro Clown\" with the Nazis and Commies? You are clear about the fact that the Nazis originated in Germany, which also is in Europe. Europe isn't a country, so you can't say Europe won the war. And Hitler only fell, because of Hitlers stupid plans in Russia, where the Red Army turned the war. You Americans just came in to take the glory.", "time": "6 years ago", "author": "xXxTr0nxXx", "channel": "UC_HI85NRHLCLsUHE33Q7KCw", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLSedMxsfacec_v6FRm_N6dyE9QvjXcm_LBCWg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B7-keBB-om2A", "text": " @xXxTr0nxXx  The Russians couldn't have taken a shit right without American convoys & supplies, trucks, tanks, planes, food...all you Euro's are lame asses without America.  You clowns fuck up & we bail you out--again & again.", "time": "6 years ago", "author": "chad haire", "channel": "UCQM0aoCSLULHvge0BXcX9KA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQShcArS1Y-nHoFo77TJEowgKtCQTDKTe3z3xGyxg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B7-mBczdh5X0", "text": "Your making Americans look bad by confirming all stereotypes other Westerners have of Americans. Not only is your usage of anecdotal evidence to make an argument about climate change childishly retarded and evident of a lack of education, your overinflation of the US influence on the outcome of World War 2 is staggeringly chauvinistic. I urge you to first of all look up some proper information of Global Warming, and then look up some numbers comparing the USSR war effort and the Eastern Front with the US war effort and the Western Front. If you failed to get educated in your school system, it is not too late to start yourself.", "time": "6 years ago", "author": "SgtTeeh", "channel": "UCaHasTniEzv8J6vRQ8QGvgg", "votes": "5", "photo": "https://yt3.ggpht.com/ytc/AKedOLTXkkrDffiOrp6VFj8fUq8MSfg8r44Dtj_iBA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B7-n5Bg1mUXn", "text": " @SgtTeeh  It was called Global warming for 20 years--until they couldn't explain why the planet has actually cooled 1.25 degrees over the past 20 years so they changed the name to \"climate change\" so no matter what change takes place they will claim to be right.  The US Govt has spent billions promoting Global warming hoaxes but not spent one dollar on the NON global warming side.  FRAUD.  John Oliver & Piers Morgan need their Limey ass kicked out of this country--although I suspect the Euro clowns don't want them back LOL", "time": "6 years ago", "author": "chad haire", "channel": "UCQM0aoCSLULHvge0BXcX9KA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQShcArS1Y-nHoFo77TJEowgKtCQTDKTe3z3xGyxg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B74oB13xRGhB", "text": " @*****  That's the thing about the internet, it provides a medium for idiots like Chad to spew their ridiculous opinions at everyone, when people are this stupid, i don't even bother arguing with them, it's a waste of time.", "time": "6 years ago", "author": "Juzzy K", "channel": "UC68zVhPV-Wxmxol-Rgo0q7g", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLR7lPUp41FPwXdII2FlI8rbEK5LlndgxJaHQvb4Ew=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B74plBG1J9p3", "text": " @Juzzy K  If you believe global warming is real then you are the idiot--a brainwashed one at that.", "time": "6 years ago", "author": "chad haire", "channel": "UCQM0aoCSLULHvge0BXcX9KA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQShcArS1Y-nHoFo77TJEowgKtCQTDKTe3z3xGyxg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B74qHsjRgV3n", "text": "\"When people are this stupid, i don't even bother arguing with them, it's a waste of time\".", "time": "6 years ago", "author": "Juzzy K", "channel": "UC68zVhPV-Wxmxol-Rgo0q7g", "votes": "4", "photo": "https://yt3.ggpht.com/ytc/AKedOLR7lPUp41FPwXdII2FlI8rbEK5LlndgxJaHQvb4Ew=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B75_6agnP70o", "text": " @Juzzy K  That's a good policy to live by. \"When people are this stupid, I don't even bother arguing with them. It's a waste of time.\"", "time": "6 years ago", "author": "vortex", "channel": "UCHvl9Z6Cv6icOtFUMkuyGQw", "votes": "3", "photo": "https://yt3.ggpht.com/bp9Dqpn3hNcoUf8_4OJwmVnFLGMQpc2l48tYTYndQWM8AFq_fDW-Pz6XhDDKtJ8PeV-0fPAvyQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B78E3pkzfdK5", "text": " @chad haire  I know you're speaking English, but all I can hear is \"HERP DE DERP DERP DEEEEEEERP!\"", "time": "6 years ago", "author": "jokerswild00", "channel": "UCHmQZBuC6AKMG9KyQaAK00Q", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLTqry3plLFpEKnn1B_4LuI3zHQAoS-eANKWYn78=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B78EijkfpvVY", "text": " @jokerswild00  That is John Oliver talking out his ass.  We should deport all the clowns.  And you wanna talk shit Homie stop hiding behind fake troll names you chicken shit cowards.", "time": "6 years ago", "author": "chad haire", "channel": "UCQM0aoCSLULHvge0BXcX9KA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQShcArS1Y-nHoFo77TJEowgKtCQTDKTe3z3xGyxg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B78pS37UFYGU", "text": "+chad haire You know, while half the country may be freezing its ass off, the other half is sitting on top of Satan's boiler room. Here in California, it's unusual news when there aren't reports of half the state being on fire because some fucktard outside of Bakersfield threw a lit cigarette out his window, causing the hill it landed on to explode into one giant brush fire. Our drought is so bad that the entire state is abuzz that we MIGHT get as much as 4 inches of rain on September 19. That will probably been more than it's rained here for the last five years. It's so bad that it rained for two weeks straight a few years back, and it was nowhere NEAR coming close to helping us.", "time": "6 years ago", "author": "Guarding Dark", "channel": "UCTg_svdtftUsaWkRplhxp9Q", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRvu9lKZrMaNaiiQF2w6riq5mI2JQF_hhUSNRW87g=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B78qeUkKLpLp", "text": "+Bel-Shamharoth You people in CA had 50 years to build dams and water storage but the left winger environment kooks said NO--it might upset wildlife. So now you are paying the price, and somehow it is global warming to blame.  NO it is the environmentalists dummy!!!!", "time": "6 years ago", "author": "chad haire", "channel": "UCQM0aoCSLULHvge0BXcX9KA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQShcArS1Y-nHoFo77TJEowgKtCQTDKTe3z3xGyxg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B78qf3oGWnTR", "text": " @chad haire  we have dams. But noone is upkeeping them. Plus the fact that this whole are is a desert to begin with,  but its still the most populous state. The problem isnt that we didnt buold enough dams, its the fact that we get pretty much no rainfall. It rains maybe 5 times a year in the area where I live and even then ot only rains for a few hours at a time. Were lucky if the clouds stay more than a few days. And my point was not that we have a drought because of global warming. It's that weather is not an indication of climate, as someone else pointed out. Just because it's cold in some areas does not mean the climate isn't warming up.", "time": "6 years ago", "author": "Guarding Dark", "channel": "UCTg_svdtftUsaWkRplhxp9Q", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRvu9lKZrMaNaiiQF2w6riq5mI2JQF_hhUSNRW87g=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B78qfWZ8zZQq", "text": "+Bel-Shamharoth It is all a scam.  They show you the ice thats melting in the north but dont tell you that ice in the south has  actually increased.  In fact satellite data shows that overall global ice has increased 5%!", "time": "6 years ago", "author": "chad haire", "channel": "UCQM0aoCSLULHvge0BXcX9KA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQShcArS1Y-nHoFo77TJEowgKtCQTDKTe3z3xGyxg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B78qhmuwf24r", "text": "A scam? To get money out of you? No one's asking you to pay for anything. All we need is to stop being dickbags to the environment. And yeah maybe it's gaining sea ice, but it's losing land ice. Satellites will show the ice expanding the sea extent but not thinning on the land, especially since it takes a lot more ice to thin across all of Antarctica than it does to expand the sea borders by 5%. Or at least it wont be able to show it as easily. My guess is that you just can't believe that humans can have that kind of impact on the environment, because of course we can't; snow still forms, therefore average temperatures across a planet that is proven to keep heat in can't possibly be heating up. And I know I'm not going to convince you otherwise, so good day.", "time": "6 years ago", "author": "Guarding Dark", "channel": "UCTg_svdtftUsaWkRplhxp9Q", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLRvu9lKZrMaNaiiQF2w6riq5mI2JQF_hhUSNRW87g=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B78qjtrDODGy", "text": "+Bel-Shamharoth You are a fool.  When AL Gore left office he was worth about $1 million.  Since then he has made over $100 million off the global warming scam, and his cronies split at least $900 million.  And most by taking TAXPAYER MONEY so don't tell me nobody is asking me to pay for anything.  I, and you, already have paid dummy!  They set up all kinds of BS \"environmental\" companies like solar and the like, then get their pals in Washington to give  government \"loans\".  If the company does well, they make money.  If the company goes broke (most do) they keep the money.\nThis is what keeps Al Gore and his pals in huge mansions that use more electric than a school, and he flies around in Gulfstream jets sucking more fuel in one trip than a car does in one year.  In the meantime people like you keep falling for the BS.  IT IS A SCAM & IS TAKING YOUR MONEY.  WAKE UP and stop being a sheep!", "time": "6 years ago", "author": "chad haire", "channel": "UCQM0aoCSLULHvge0BXcX9KA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQShcArS1Y-nHoFo77TJEowgKtCQTDKTe3z3xGyxg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B78qngPfpyLU", "text": " @chad haire  For one thing, solar energy is profitable and helps the environment. Nothing wrong there. And he files planes around because there are no other forms of transportation that can do that. Granted he probably spends  a lot of money and fuel to go on pleasure trips, but still. not much we can do about him. And I doubt you can prove any of this, especially those figures, without going to some conspiracy theorist website, so until you do I have no reason to believe you. also, no need to resort to name calling, asshat. The loan system is a fault of the government, not of environmental issues. The fact that were doing shit to the environment is just that, a fact. You can prove it by going to pretty much any roadside and looking for the rubbish on the side of the road. Or go to a major city and see the smog. So you can't really say environment change is BS. Climate change may have fuzzier proof, which I doubt, but again, since I doubt you'll actually do a lot of research into it, we can just leave it at that. Also the fact that you used both \"WAKE UP\" and \"stop being a sheep\" in the same sentence, I'm convinced you are a conspiracy nut and/or a troll. so I won't waste any more of my time on you.", "time": "6 years ago", "author": "Guarding Dark", "channel": "UCTg_svdtftUsaWkRplhxp9Q", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRvu9lKZrMaNaiiQF2w6riq5mI2JQF_hhUSNRW87g=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B78qpbjPnNxK", "text": "+Bel-Shamharoth We know you voted for Obama--twice.  Admit it!  Bet you are a member of the Jon oliver fan club.  SHEEP!  Baaaaaaaaaa", "time": "6 years ago", "author": "chad haire", "channel": "UCQM0aoCSLULHvge0BXcX9KA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQShcArS1Y-nHoFo77TJEowgKtCQTDKTe3z3xGyxg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B78qpneenrLj", "text": " @chad haire  Sure kid. Whatever helps you sleep at night.", "time": "6 years ago", "author": "Guarding Dark", "channel": "UCTg_svdtftUsaWkRplhxp9Q", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRvu9lKZrMaNaiiQF2w6riq5mI2JQF_hhUSNRW87g=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B78qtlf7nlOE", "text": " @chad haire  Dude, why are you still going on about this? Just shut your mouth and accept the fact that this is an uphill battle, and one that you're never going to win.", "time": "6 years ago", "author": "vortex", "channel": "UCHvl9Z6Cv6icOtFUMkuyGQw", "votes": "1", "photo": "https://yt3.ggpht.com/bp9Dqpn3hNcoUf8_4OJwmVnFLGMQpc2l48tYTYndQWM8AFq_fDW-Pz6XhDDKtJ8PeV-0fPAvyQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B78sBgn0Wi1t", "text": "+Scarlett Phantom I won before the idiot appeared and before that double idiot Jon oliver made this BS video.", "time": "6 years ago", "author": "chad haire", "channel": "UCQM0aoCSLULHvge0BXcX9KA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQShcArS1Y-nHoFo77TJEowgKtCQTDKTe3z3xGyxg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B78t2cwDcNUI", "text": " @Scarlett Phantom  Don't feed the troll. Your hate only makes it stronger.", "time": "6 years ago", "author": "Guarding Dark", "channel": "UCTg_svdtftUsaWkRplhxp9Q", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRvu9lKZrMaNaiiQF2w6riq5mI2JQF_hhUSNRW87g=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggxLHrp_l9oE3gCoAEC.7-H0Z7-NC6B8DAFa8PNy4d", "text": "It was renamed because inbred morons thought that global warming (aka 'an increase in the average global temperature' aka global climate change) meant temps would just rise literally everywhere (ie not understanding how weather works.) That's why where I live, winters have been all fucked the past several years. Hardly any snow one year with much warmer than normal temps, heaps of snow with (very) below average temps, the past few years we've had polar vortices (which shouldn't be affecting the middle of the Great Plains), and this winter alone had hardly any snow to begin with, but we had snow earlier this month. It snowed in April. That's absurd.\n\nIt's not hard to find info about why average global temps rising will make some places colder, some warmer, some drier, some wetter. Look it up, instead of listening to 'scientists' that are bought and paid for by coal and oil companies who don't want to lose business.", "time": "5 years ago", "author": "gingergamergirl98", "channel": "UCMxz-wkc_WEhh5gCE7R-p0w", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQmo6dIwugdKTpv0LSEXNJFqYEp46Wm3yN6zppu=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE73C47_rRKs1", "text": "I think you misunderstand that climate change is occuring because of humans. Our pollution is killing environments left and right. Yes the climate with change naturally, but we are causing it it to change unnaturally. That is the problem.", "time": "6 years ago", "author": "31FilmTalk", "channel": "UCMy9H3HV06j2-xyQyBJUijw", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLRElDcxlUlhoAF2S_FAMnbDKFeAnmy3VlQ_L00ekw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE73Mdc2LyTFP", "text": " @*****  Humans are part of nature. So though things are changing really fast right now, it can't be unnatural because everything in existence is natural.", "time": "6 years ago", "author": "Fantastick Roze", "channel": "UCHkDoS7vGHz9iMJZhLELa2A", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQxxcGhgLu84SoRefNO6KCsxBz35FfQ6A4pdyUw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE73NhViiUWAP", "text": " @Fantastick Roze   Industry is not natural. Pollution is not natural. They are man-made, not nature-made. ", "time": "6 years ago", "author": "31FilmTalk", "channel": "UCMy9H3HV06j2-xyQyBJUijw", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLRElDcxlUlhoAF2S_FAMnbDKFeAnmy3VlQ_L00ekw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE73OarnDvI9a", "text": "Okay okay so what is a car that blows black smoke? Do you call that natural? factories in china that making them at the top of countries that are producing pollution? You call that natural? Last time i check they are man made and can't be called nature made. ", "time": "6 years ago", "author": "Ian Dableo", "channel": "UC0QaQ_sAmuqfPPDcbra8UtQ", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLRMRKSL00dYgzmKtFxUCu9zjyHZZlFaH9S2nMkm0Q=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE73P0_K5ePcK", "text": "Dude you're not listening at all. Man is part of nature. Man is born from nature and will return to nature when he dies. So everything made by man is natural too. Doesn't mean it's good. Nature doesn't just do good things. Look at all the animals killing each other over territories. Look at all the poisonous snakes killing harmless little plant-eaters. Nature has also taught us that animals' strong sides eventually become their weaknesses. Like leopards being so fast that they can always hunt down their prey, but eating all of the available prey too quickly in the process. Humans do that too. Humans are developing so fast, and it's really great for us. But the effects of this quick development is gonna bite us in the ass really soon. And then we go extinct. That's how nature runs its course.", "time": "6 years ago", "author": "Fantastick Roze", "channel": "UCHkDoS7vGHz9iMJZhLELa2A", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQxxcGhgLu84SoRefNO6KCsxBz35FfQ6A4pdyUw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE73Q1Uo5XbmC", "text": "You to fail to understand that we as humans have achieved a higher plain of thinking, thus putting us on top of the food chain by a long shot. We have ascended past nature. Big cities like New York and Chicago are not \"nature\". Businesses, economy, money, industry, pollution, those are man made concepts we made on top of nature, not with nature. Hell, we could fake nature in a biodome if we wanted to. It saddens me that you don't know the difference. If we built it, we can fix it too. ", "time": "6 years ago", "author": "31FilmTalk", "channel": "UCMy9H3HV06j2-xyQyBJUijw", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLRElDcxlUlhoAF2S_FAMnbDKFeAnmy3VlQ_L00ekw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE73RHdnBW2Fz", "text": "You guys still aren't getting what I'm saying. Yes, climate change exists, and it's mainly caused by humans. That just doesn't mean it's not natural. Everything in existence is natural. The problem is that humanity is trying everything in its power to go against nature, which is not possible. I don't give a crap about climate change itself. It's happening and there's nothing we can do about it now. Humans may go extinct, along with many other species, but the earth will go on and create new life. Just like it did before. I do care about the earth and about nature. I am doing everything in my power to work with nature. It really hurts me when I see how much people hurt the animals and the trees without even caring. I can't even pick a flower without saying I'm sorry, and I only do that when I need to. And I could definitely never hurt an animal, unless it's a matter of life and death. So don't think of me as some moron who could care less about what happens to the earth. I care. I just don't see climate change as a bad thing.", "time": "6 years ago", "author": "Fantastick Roze", "channel": "UCHkDoS7vGHz9iMJZhLELa2A", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQxxcGhgLu84SoRefNO6KCsxBz35FfQ6A4pdyUw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE73RJz3vT24N", "text": " @Fantastick Roze  but we are way more intelligent than animals we have a higher plain of thinking so why not use our intelligence in saving our planet", "time": "6 years ago", "author": "Ian Dableo", "channel": "UC0QaQ_sAmuqfPPDcbra8UtQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRMRKSL00dYgzmKtFxUCu9zjyHZZlFaH9S2nMkm0Q=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE73ReddbMegD", "text": " @Ian Dableo \nYes, why not waste it with writing comments on Youtube.", "time": "6 years ago", "author": "xXxTr0nxXx", "channel": "UC_HI85NRHLCLsUHE33Q7KCw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSedMxsfacec_v6FRm_N6dyE9QvjXcm_LBCWg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE73RrwqjR_Rq", "text": " @***** \nI will not read your entire comment unless you read my entire comment. I've been very clear about the fact that we should take good care of the earth. You are a very selective reader and are just looking for reasons to be angry with me and I'm not going to continue with this until you calm down and actually listen to me.", "time": "6 years ago", "author": "Fantastick Roze", "channel": "UCHkDoS7vGHz9iMJZhLELa2A", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQxxcGhgLu84SoRefNO6KCsxBz35FfQ6A4pdyUw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE73RsEs4vilN", "text": " @Ian Dableo \nI wouldn't say we're that much more intelligent than animals. But we should work together to make this world a better place. The earth doesn't need saving though. The earth can take care of itself. It's more about saving ourselves, really. Because if we keep going like this, we'll either all kill each other or disrupt the earth so much that she kills us.", "time": "6 years ago", "author": "Fantastick Roze", "channel": "UCHkDoS7vGHz9iMJZhLELa2A", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQxxcGhgLu84SoRefNO6KCsxBz35FfQ6A4pdyUw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE73SRiG-NoJz", "text": " @Fantastick Roze  \"I wouldn't say we're that much more intelligent than animals...\", are you shitting me? What other animal developed science, math, built computers and can write millions of lines of code, learn different languages on their own, travel to fucking space!? ", "time": "6 years ago", "author": "31FilmTalk", "channel": "UCMy9H3HV06j2-xyQyBJUijw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRElDcxlUlhoAF2S_FAMnbDKFeAnmy3VlQ_L00ekw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE73Tur6prjHO", "text": "You do not care about our species way of life being compromised by worsening environmental conditions which will kill far more people than all wars combined? Unlike the previous comments I think I understand your take on this, but I find it exceedingly nihilistic and I am glad few people share the sentiment. If not this, what do you care about?", "time": "6 years ago", "author": "SgtTeeh", "channel": "UCaHasTniEzv8J6vRQ8QGvgg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTXkkrDffiOrp6VFj8fUq8MSfg8r44Dtj_iBA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE73UlWt4sNXj", "text": " @SgtTeeh \nEnvironmental conditions aren't worsening. They're just changing. And it might be bad for us, which I highly doubt, due to the adaptability of our species, but that doesn't make it bad in general. That's why I don't really care about it anymore. Whatever happens, happens. I care about being happy and sharing that happiness with the world. ", "time": "6 years ago", "author": "Fantastick Roze", "channel": "UCHkDoS7vGHz9iMJZhLELa2A", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQxxcGhgLu84SoRefNO6KCsxBz35FfQ6A4pdyUw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE73UlnPkco5A", "text": " @***** \nAnd is that the definition of intelligence? In a way, some animals are much more intelligent than we are, in my opinion.", "time": "6 years ago", "author": "Fantastick Roze", "channel": "UCHkDoS7vGHz9iMJZhLELa2A", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQxxcGhgLu84SoRefNO6KCsxBz35FfQ6A4pdyUw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE73Wcwa7UVMQ", "text": " @Fantastick Roze \nThe thing about changing environmental conditions is that people settled in locations where they have been most favorable, thus if they change then the conditions where millions of people live usually do worsen. It is fairly uncontested that agricultural conditions especially in Africa will worsen and people will not have the resources to relocate, causing a widespread reduction in quality of live for hundreds of millions and increased famine. Whatever happens, happens? Climate change doesn't have to happen though, or at least it does not have to be as bad if we consider it a problem and act to limit humanity's effect on it. If you care about sharing happiness, you should care about climate change, as it will directly affect the happiness of hundreds of millions Africans and indirectly affect the happiness of most of the population.\n\nI have no doubt our species will survive but it is gonna suck anyway, especially if you are born in Africa which more and more humans are.", "time": "6 years ago", "author": "SgtTeeh", "channel": "UCaHasTniEzv8J6vRQ8QGvgg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTXkkrDffiOrp6VFj8fUq8MSfg8r44Dtj_iBA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE73X5zREamHK", "text": " @SgtTeeh \nLike I said, humans are very adaptable. We still exists after thousands of years and a lot of different climates. I don't know what will happen when the climate changes, but I don't think it will be bad for all of us. In the worst case scenario humans will have a tough time for a while, and then find ways to deal with it and build a new society. And I don't think that's very bad, since that could be very good for other life on this planet. Climate change is pretty much inevitable now, so there isn't much we can do about it now. We can start being good to the earth. It's never too late for that. We just shouldn't do that because of selfish reasons. Right now, people who say they care about the earth usually just care about themselves. They want to look good or they want to keep the earth from doing what needs to be done, for fear it will lead to their death. That's also something. Death isn't neccesarily bad. Death is just part of life, and it's neccesary for life to exist. Everything you eat dies, so that you can live. That includes plants. All death leads to new life. That's why I don't fear death. I just don't want to die before I get to live the way I want.", "time": "6 years ago", "author": "Fantastick Roze", "channel": "UCHkDoS7vGHz9iMJZhLELa2A", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQxxcGhgLu84SoRefNO6KCsxBz35FfQ6A4pdyUw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE73z2rouTWVc", "text": " @Fantastick Roze  There were actually times when whole civilisations colapsed because of climate and environmental issues. Do we want that to happen again? And especially now at the age of globalization this would have terrible, terrible aftermath.", "time": "6 years ago", "author": "FuriousHillman", "channel": "UCFSoacBb1mWWAQfPmRr_B-w", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRkFoMapj5dmd1qzW3cqEik_2_w0rtzzul1nw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE74-cdz4mxVo", "text": " @FuriousHillman \nI don't fear death or destruction. If this society collapses, it's because it has to. It's happened before and it will happen again, I'm very sure of that. I don't fear what's inevitable.", "time": "6 years ago", "author": "Fantastick Roze", "channel": "UCHkDoS7vGHz9iMJZhLELa2A", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQxxcGhgLu84SoRefNO6KCsxBz35FfQ6A4pdyUw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE74-fFWNv6uB", "text": " @Fantastick Roze  I see your point. My point of view on the other hand is, that we should try our best to do the best decisions and adapt as much as we can. Even if we fail in the end, next generations can learn from our successes and mistakes. ", "time": "6 years ago", "author": "FuriousHillman", "channel": "UCFSoacBb1mWWAQfPmRr_B-w", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRkFoMapj5dmd1qzW3cqEik_2_w0rtzzul1nw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE74-gJfX4NGl", "text": " @FuriousHillman \nThat's what I think too. I'm not saying we should treat the earth like shit, not at all. I try my best to live with the earth, and not against it. I think that's best for all life on earth. I just think a lot of people only care about the earth because they're selfish and afraid. And I think there should be a better reason than that to be a good person.", "time": "6 years ago", "author": "Fantastick Roze", "channel": "UCHkDoS7vGHz9iMJZhLELa2A", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQxxcGhgLu84SoRefNO6KCsxBz35FfQ6A4pdyUw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE74ruWuDj5Pu", "text": "I'm of the opinion that the human race should try to continue existing for as long as possible. I agree that biological life will continue after we die out. It's just a question if we continue existing, and as a human, the prospect of humans living is a good one. ", "time": "6 years ago", "author": "Etomia", "channel": "UC2T0shXr0TTKWv2riumnaqg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQaxpXMECCzrVxQOZLy-zMpGivygBuw3DiKPuJm=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE76lUS6_RsFD", "text": " @Fantastick Roze  John needs to look at the temperature records. The Earth was damn hot and damn cold thousands of years before humans started pumping gasoline in their cars in the 1900s. People in America are saying \"Where's this climate change, we just had huge snow storms for the last 4 months\".", "time": "6 years ago", "author": "TekReviews", "channel": "UCCxE3kVJsS-DfaU0RLzK6kg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRqVXKFo422WBFKvS54mePfAT8gpJDajWwMfQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE76tSEq8sUmQ", "text": " @*****  A factory that produces pollution didn't just spring up on its own. Manmade. ", "time": "6 years ago", "author": "31FilmTalk", "channel": "UCMy9H3HV06j2-xyQyBJUijw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRElDcxlUlhoAF2S_FAMnbDKFeAnmy3VlQ_L00ekw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE76tUZnKPiLJ", "text": " @*****  What Kool Aid are you drinking? A Coal Plant is not NATURAL that's MAN MADE. You obviously have no idea what NATURE means. Get a Dictionary", "time": "6 years ago", "author": "TekReviews", "channel": "UCCxE3kVJsS-DfaU0RLzK6kg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRqVXKFo422WBFKvS54mePfAT8gpJDajWwMfQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghDAc7we-52t3gCoAEC.7-H0Z7-DHGE76tcGsEF7tX", "text": " @*****  You keep smoking whatever you been smoking. La La Land needs a Leader.", "time": "6 years ago", "author": "TekReviews", "channel": "UCCxE3kVJsS-DfaU0RLzK6kg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRqVXKFo422WBFKvS54mePfAT8gpJDajWwMfQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiPN6dgrMAAr3gCoAEC.7-H0Z7-PaOw8UmgBNzTSqF", "text": "- Trump 2017 (who ever you want him to direct that statement to, you decide)", "time": "4 years ago", "author": "Vanessa Ibarra", "channel": "UCDfDz3hRXoeDwHkYvzOSnSw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRuLOl2HlbHhZQBulwKEB_E1xrEkBWlyYeYiWTmoQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghatUqY8q3rPngCoAEC.7-H0Z7-SG0d7-OJ8PiQ_Rp", "text": "That's a decent position. The thing that irritates me most about deniers (rather than skeptics like yourself) is their cult-like belief that anthropogenic climate change is a sinister \"socialist\" plot. It's merely concerned individuals, backed by data, who wish to build a better future. ", "time": "7 years ago", "author": "77cicero77", "channel": "UC56bTZwDWK-y0--vTRVi7XQ", "votes": "11", "photo": "https://yt3.ggpht.com/ytc/AKedOLQCAAYasM_F-LTHkz2u8nOqmqn1yZErplcK0w=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghatUqY8q3rPngCoAEC.7-H0Z7-SG0d7-aEsbLp1eH", "text": "Actually no, we can measure CO2 levels that have been in the atmosphere back for decades, and CO2 levels didn't start their nearly vertical climb until the industrial revolution started.", "time": "7 years ago", "author": "evilkingstanley", "channel": "UCqV1T4hY9s1JmlE-EKdAeyg", "votes": "11", "photo": "https://yt3.ggpht.com/ytc/AKedOLTEchvY7XIH0-f80ISxcRw9VVVFjbmVltW7UQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghatUqY8q3rPngCoAEC.7-H0Z7-SG0d7-bdB27qwQF", "text": " @evilkingstanley , cool story.", "time": "7 years ago", "author": "KelniusTV", "channel": "UCwoL050Hd9vlxVnDsjj6M9Q", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTWo2A8UpKogDj9xN-de5OM96DtLJBPde4voCtk=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghatUqY8q3rPngCoAEC.7-H0Z7-SG0d7329IwYrB2M", "text": "I think that whether it's real or not, and the effects of climate change are already showing, we should take care of ourselves and mother nature. People often think climate change not being real will exclude them from the responsibility they have to look after our great Mother. I think that's why there are so many \"skeptics.\"", "time": "6 years ago", "author": "Fantastick Roze", "channel": "UCHkDoS7vGHz9iMJZhLELa2A", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQxxcGhgLu84SoRefNO6KCsxBz35FfQ6A4pdyUw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghatUqY8q3rPngCoAEC.7-H0Z7-SG0d73BKm6PimHP", "text": "You not \"believing\" in something still has nothing to do with anything. If you think you know better than 97% of climate experts who have studied this more extensively than you ever can, be prepared to lay down some very convincing evidence.", "time": "6 years ago", "author": "Nichiyou", "channel": "UC4hq9jcGjK5fuW2ax9cYDdw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLR68td2xRu3Oe4LshGP5p-KedGEPqRqeC2_nynSlA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghatUqY8q3rPngCoAEC.7-H0Z7-SG0d73C--93id0k", "text": " @howtoplanaparty  Don't know what magical \"those\" who control the funding of the entirety of climatologists you're talking about, let alone who'd benefit from it. Big oil companies on the other hand...", "time": "6 years ago", "author": "Nichiyou", "channel": "UC4hq9jcGjK5fuW2ax9cYDdw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLR68td2xRu3Oe4LshGP5p-KedGEPqRqeC2_nynSlA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghatUqY8q3rPngCoAEC.7-H0Z7-SG0d73C1uwDj8KO", "text": " @howtoplanaparty  \"Do research\", what a classic \"I'm talking out of my ass\" answer. Are you going to call me a sheep next?", "time": "6 years ago", "author": "Nichiyou", "channel": "UC4hq9jcGjK5fuW2ax9cYDdw", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLR68td2xRu3Oe4LshGP5p-KedGEPqRqeC2_nynSlA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghatUqY8q3rPngCoAEC.7-H0Z7-SG0d74CPvOkDhla", "text": "I do believe in man-made climate change, but I like the way you're mind works. It's nice to see someone on the other side of this issue take a common sense approach to it.", "time": "6 years ago", "author": "Kristi Kinch", "channel": "UCGIzlGm9Cf0VAVtdXaxDyAQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlYfl8lK3oMomjiirUN5nnMgoAoTzGTIXSlrYY=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghatUqY8q3rPngCoAEC.7-H0Z7-SG0d7AXcMJSppQ9", "text": " @KelniusTV  The Climate Scientists who agree get paid by govt's and its another way for Energy Companies to scare people and make lots of money. Look at Al Gore he started scaring people and making Climate Change a big word and then he got richer and richer from all his Energy companies he owns stock in. Climate Scientists are getting paid for their \"research\" millions of dollars from govt's and other groups. Non Climate Scientists don't get paid a dime, they do it all on their own. The Earth record which he ignores as do most of these bafoons shows that the Earth has natural cycles where it gets COLD as hell and HOTTER then hell every 300 years or so. We already had a little ice age in Europe in the early 1900s and he forgot how cold it got in Europe last year that everything was frozen solid, cars, etc and people had to dig out of snow covering their entire house in some European countries. Funny thing is those European countries who whine about Climate Change, they have laws that restrict how many if any Electric Cars their own citizens are even allowed to drive. If they were that serious about it they wouldn't be so anal about electric vehicles.", "time": "6 years ago", "author": "TekReviews", "channel": "UCCxE3kVJsS-DfaU0RLzK6kg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRqVXKFo422WBFKvS54mePfAT8gpJDajWwMfQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghatUqY8q3rPngCoAEC.7-H0Z7-SG0d7AXyyN_jX8e", "text": " @*****  Truth hurts doesn't it. You talk like a 12 year old. Thunder Cat? Nice cartoon, maybe you should stop watching cartoons and go to school.", "time": "6 years ago", "author": "TekReviews", "channel": "UCCxE3kVJsS-DfaU0RLzK6kg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRqVXKFo422WBFKvS54mePfAT8gpJDajWwMfQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghatUqY8q3rPngCoAEC.7-H0Z7-SG0d7AY5HA3i_xI", "text": " @*****  Don't pull percentages out of your ass. I suggest you talk to your Mother that way, not me.", "time": "6 years ago", "author": "TekReviews", "channel": "UCCxE3kVJsS-DfaU0RLzK6kg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRqVXKFo422WBFKvS54mePfAT8gpJDajWwMfQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghatUqY8q3rPngCoAEC.7-H0Z7-SG0d7AYUYdFrcBb", "text": "This is even less relevant than the destroy the world crap . . . all this is is an attempt at \"poisoning the well\" (a logical fallacy). I don't care if Al Gore is the devil himself, that doesn't make recycling a bad thing.\nIf someone has been deceptive, you can hang, draw and quarter them on your own time. But the fact remains, that no matter who says it, recycling is good practice, energy reduction is good practice & if you're polluting the place just to spite \"climate change scientists\", you're a jackass.", "time": "6 years ago", "author": "KelniusTV", "channel": "UCwoL050Hd9vlxVnDsjj6M9Q", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLTWo2A8UpKogDj9xN-de5OM96DtLJBPde4voCtk=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghatUqY8q3rPngCoAEC.7-H0Z7-SG0d8yf-gCRv8Rs", "text": "Global Warming has always existed and it is yet not in an abnormal state at all. However, humans push the scales to heights that are unbearable for our current ecological system what will eventually lead to dramatic climatic changes, which will heavily affect our ecology in a bad way. What doesn't mean everything will die out. Nature has been known to be able to adapt very well to many climatic conditions. The question is if humans can, too and it won't help that certain animals and plants that we need will die out. But maybe this is just the next step of evolution.", "time": "2 years ago", "author": "Jambi", "channel": "UCIeeiDNKDps6GzrBkbxB45w", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRE7GjVMO5mgeXNNGNKPA35SFBTvjaBISag0Eku7Q=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugjlmtc2PYMfrHgCoAEC.7-H0Z7-JC7w7Eaj6CSMcH9", "text": "No, it's caused by man. We output more CO2 than all the volcanoes and natural fires combined.", "time": "6 years ago", "author": "Gigabic", "channel": "UCb6tt1YjoBhvxzGcVfSlRvg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRHLUQzSYDE3gW84-HUa1rkV2_AoQCI_L113jjK=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggO7DCrw9_j0ngCoAEC", "text": "\"The good part about science is that it's true whether or not you believe in it.\" -Neil DeGrasse Tyson", "time": "7 years ago", "author": "TheWabbajackX", "channel": "UCaagb5OcVNB9XauJy90etcg", "votes": "62", "photo": "https://yt3.ggpht.com/ytc/AKedOLSnWWBj7IxT8zUWsmqKMX6ulZtHSIJpbONYIpX4=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgjudZo5-p-eyHgCoAEC", "text": "for those who see this and doubt the existence and problem of climate change, look at this pie chart representing a recent meta analysis of nearly 14000 peer reviewed papers from 1991-2012. As you can see 99% of paper support climate change theory\n\nhttp://www.treehugger.com/climate-change/pie-chart-13950-peer-reviewed-scientific-articles-earths-climate-finds-24-rejecting-global-warming.html\n(this particular website was just the first one I could find with the chart conveniently placed on it)\n\nClimate change is a fact, and for those who think it's not a big deal, check out xkcd's recent comic showing that the impact of climate change IS significant and the difference in temperature at the end of the century, if things don't change, will be the same as the last ice age (though increased temperature rather than decreased, hence GLOBAL WARMING)", "time": "7 years ago", "author": "Phar Ph", "channel": "UCbnF47q9u6ukHe0lua7irxQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSjXm8LhYz2IaXIf-n1BoN10VrcKLFNERLWqbp1=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghWSKdazxHjQHgCoAEC", "text": "There is fact and the people who denies it. ", "time": "7 years ago", "author": "TheZoeBig", "channel": "UCav7jdMj57u1zvsFeivDAng", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTO6YjfL2V1dVYbP8rCn2uZ0UbzWenhic_0Zq4s=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiKmwm80RQLpXgCoAEC", "text": "For all the goodness that HBO doles out on the reg, it's Last Week Tonight that makes me want it the most.", "time": "7 years ago", "author": "Benin Badyal", "channel": "UCKTK0P8Oue2WNDeum5-k7iw", "votes": "5", "photo": "https://yt3.ggpht.com/ytc/AKedOLT40oiFC7aJGSJ-XbdLYjcW1l8SeewI-4dLRt9C=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugipq1dNdmuay3gCoAEC", "text": "Saying global warming doesn't exist because it was cold this last winter is like saying the sun doesn't exist because last night it got dark.", "time": "7 years ago", "author": "camwyn256", "channel": "UCJIKJ4KvHBtUlvn2b3Hml-w", "votes": "106", "photo": "https://yt3.ggpht.com/ytc/AKedOLQo2z5NYkqFE2CqId1CcVacIJTNZsKJQ3K-3xkYEw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggHoTYrm2v6J3gCoAEC", "text": "A+ troll work by the last few commenters.  I'm seriously impressed.  Heroes.", "time": "7 years ago", "author": "John Ryan", "channel": "UCgd3_h8CsfghiYUIfomIYGQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQr3yQBPEz44NjJpQf5wyAcw50mSQMz1me8Ug=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgizdXk3HkEW6XgCoAEC", "text": "1 in 4 Americans believe that climate change is a myth. And 3 out of 4 Americans don't have severe brain damage. And in a Democracy, majority rules :D", "time": "7 years ago", "author": "Lily & Mikaila Orchard", "channel": "UCAQ7357VoOQZTeRGhMa4r-A", "votes": "33", "photo": "https://yt3.ggpht.com/dS7vrZxEbTS3Z1wBJLmRNikdKmKezimYLpAZUnzT7uBrxnhz-uGJDyh6X3BnNIjc-_BaeqFIYjs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugho3Kau4dp14ngCoAEC", "text": "Yea but consider this, climate change deniers - do we have time to wash the shit out of your hair after we pull your heads out of your asses? Aka who the fuck cares what you have to say like come on really guys", "time": "7 years ago", "author": "JackieTheCaveman", "channel": "UCUurrfmtq56mooT803Rfq2A", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSNrH9NTQUVpAzRPhxFWcpzH5AbYKLazZi4Ww=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggPADV8AViI6ngCoAEC", "text": "Global warming and climate change are not the same thing.  One is real and the other is a scare tactic to push green budget agendas.  Or ya know, you guys could just keep looking at the last 50 years of data only, like uneducated laymen like John Oliver do.", "time": "7 years ago", "author": "mazack00", "channel": "UCs6rHSQbWIiQXAKkKMR9wsw", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLSEXSZiy89UeNAIhlGg1FCCL6ZSnrdp-nr1fW5X=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggAJ_O8JOW9c3gCoAEC", "text": "the fuck is he talking about. temperatures are have not risen in 18years", "time": "7 years ago", "author": "zort", "channel": "UCL00LOx6qjfIBvyCHTnEBFQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRhtPm8jshUg8a-i8VnwCS_PcZDQWKvbi5a1g=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugj8N94RLvUF5XgCoAEC", "text": "You guys might want to get educated on the real science behind climate change.\n\nThe deniers are not a bunch of people just wanting to pollute and make money, \nWatch YouTube channel the \"suspicious observer's\".\n\nReal science, no scare tactics, just real non theoretical, observable science.\n\nGod bless you", "time": "7 years ago", "author": "Rev55", "channel": "UCMadKEZSQRVPzgK1xNvWLhA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQuC44q8-Holf_lzB71PRme05MpxmDfnLHiag=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiUMb3aPgNsSHgCoAEC", "text": "You guys might want to get educated on the real science behind climate change.\n\nThe deniers are not a bunch of people just wanting to pollute and make money, \nWatch YouTube channel the \"suspicious observer's\".\n\nReal science, no scare tactics, just real non theoretical, observable science.\n\nGod bless you", "time": "7 years ago", "author": "Rev55", "channel": "UCMadKEZSQRVPzgK1xNvWLhA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQuC44q8-Holf_lzB71PRme05MpxmDfnLHiag=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC", "text": "Who funds the scientist? how do you seriously plan on stopping it?  do you really think its a good idea for America to do all the reducing while India and China are on the rise? do you really fucking think in your bird brains china has any plans on \"reducing\" emissions.  WAKE THE FUCK UP&AGENDA 21 is not a conspiracy theory its FACT. ", "time": "7 years ago", "author": "Lamprey Milt", "channel": "UCWTuRno7e3QsTiUaEVd1SfA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLT6VXm0UDuik7iQf7uyhO5GDRokg2qEdd6Oe8NG8A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggVGqXdVfhMnXgCoAEC", "text": "I wonder if John Oliver would've gotten the Colbert Report time slot if he stayed a few more months.", "time": "7 years ago", "author": "rurutu M", "channel": "UCP0VM8yfvPl9dB1CdfYb-hw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRyxSFkguX1B7yqAa7Cx6mZtvOSlLXZ3-VXORntUQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgizcZgO7R1g3ngCoAEC", "text": "This is hilarious. And very pointed. Awesome.", "time": "7 years ago", "author": "Kedbuka", "channel": "UC4Xq0DSWBA_LN4NogQ5rooQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTTc433L6DMNEmNokilCi5uDNgodSaxyYvAhaXG=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgjtvuMcMbLZZ3gCoAEC", "text": "Bill Nye brought me here.", "time": "7 years ago", "author": "BioHazard", "channel": "UC0qK6GKmYT-1ni8wjkV9y3Q", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLS7XN9-ROsXxLv9DBcDgq_-_v0D4Fgulpptsr_T=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugjpj4WfFzKDingCoAEC", "text": "I might have to start watching this show now. This is pretty epic. ", "time": "7 years ago", "author": "Michael Washington", "channel": "UC-sNHrtxK6X_hWczW5bX63g", "votes": "19", "photo": "https://yt3.ggpht.com/ytc/AKedOLRgYCaRCSnPWw2GZwmtJJ0XeNGu2DD3vBsMeObMplU=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiTudLeHMCuK3gCoAEC", "text": "Seriously, everyone knows that the only figures and poles published related to the american public are cherry picked to show them as the most retarded idiots on the planet, so why do Americans, or any organization put any stock in said metrics? Its crap, facts are the only thing one need rely on, not opinion or belief.", "time": "7 years ago", "author": "kaosgoblin", "channel": "UCR4FY-MfUXYW2oWoswcvB9w", "votes": "12", "photo": "https://yt3.ggpht.com/ytc/AKedOLR4S2P89zHvcau1GDWR74KpeyaakDbUqLkg4ZDb=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC", "text": " The existence of hats is obviously just another government scheme to distract us from Benghazi! Don't believe what they say, hats are a lie! You're all gullible Obama-loving sheep if you believe there really are hats!!", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "204", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgjrMgPwgru06XgCoAEC", "text": "We still are debating whether the people believe in climate change. Since when do you suppose to ask the population about a science? ", "time": "7 years ago", "author": "Edwin Wan", "channel": "UCagmv5I0D0OPrWYnWAsVRWA", "votes": "9", "photo": "https://yt3.ggpht.com/ytc/AKedOLQqm1gu_cVzDQ0-TB4NtIL7kzkW9nQkFLsv5aiSzA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggO7DCrw9_j0ngCoAEC.7-H0Z7-IV8-94RkAWJzMkJ", "text": "And, perhaps with more comedic potential: \"Reality is that which, when you stop believing in it, doesn't go away\" -- Philip K. Dick", "time": "1 year ago", "author": "Pablo Repetto", "channel": "UCz3cm0OPY1x5JJZdPEsuZoQ", "votes": "6", "photo": "https://yt3.ggpht.com/ytc/AKedOLTUNXlpyj4eKHpZsGSjnNr3VIX4Aa_bIBTx5Q=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgizdXk3HkEW6XgCoAEC.7-H0Z7-5LOF95ZlR34Px8x", "text": "Lily Orchard Written before the 2016 election, written with optimism. :(", "time": "1 year ago", "author": "Jesse Hammer", "channel": "UCMniNAsov_DBlOHSt709Z2g", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSlsxKut8nHuvdiTwCaKt_F_4dMa19zdh78RMWL=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggAJ_O8JOW9c3gCoAEC.7-H0Z7-R3ur7GivjqtYk3G", "text": "Umm... They have...", "time": "6 years ago", "author": "Gigabic", "channel": "UCb6tt1YjoBhvxzGcVfSlRvg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRHLUQzSYDE3gW84-HUa1rkV2_AoQCI_L113jjK=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugj8N94RLvUF5XgCoAEC.7-H0Z7-DtQp7ClgwhhdYPT", "text": " @Rev55  Scientists who think Climate Change is bs don't even get paid a dime, they do it on their own. Climate Change supporters get huge sums even millions of dollars from govt's and other groups. If they just said \"Well, the Earth has a natural cycle every 300 years or so, it gets hotter then hell and colder then hell\" they would lose a lot of money. I doubt they care what their grandkids have to deal with as long as they get enough cash to drive that Mercedes car around. Even European countries are two faced, they say they worry about Climate Change but have laws prohibiting people to have Electric Cars and even Solar Power.", "time": "6 years ago", "author": "TekReviews", "channel": "UCCxE3kVJsS-DfaU0RLzK6kg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRqVXKFo422WBFKvS54mePfAT8gpJDajWwMfQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugj8N94RLvUF5XgCoAEC.7-H0Z7-DtQp7CsGkdqzaWG", "text": " @TekReview's  yes those people are called PPROFESSIONAL ACTIVIST there only doing and \"finding\" stuff because if they find NOTHING they dont get funding.\n\nits cold today HA! PROFF\nits hot today HA! ALSO PROFF\nflooded in some place MORE PROFF\ntheres a drought over there LOOK! PROFF\n\nits asinine ", "time": "6 years ago", "author": "Rev55", "channel": "UCMadKEZSQRVPzgK1xNvWLhA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQuC44q8-Holf_lzB71PRme05MpxmDfnLHiag=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugj8N94RLvUF5XgCoAEC.7-H0Z7-DtQp7CtBgLhbwF3", "text": " @Rev55  Yep, greed is greed no matter what color these bozo's want to paint it. Just look at scientific data, every 300 years the Earth gets hotter then hell or it gets colder then hell. We already had 2 mini ice ages, one in the early 1900s in Europe, and in 2013 Europe froze so cold everything was solid ice. But they forget that, unless you lived in Sweden where your house was buried in snow up to the roof and ice blocks were everywhere.", "time": "6 years ago", "author": "TekReviews", "channel": "UCCxE3kVJsS-DfaU0RLzK6kg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRqVXKFo422WBFKvS54mePfAT8gpJDajWwMfQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugj8N94RLvUF5XgCoAEC.7-H0Z7-DtQp7DeQGmrpB2Y", "text": " @TekReview's  I would never trust unfunded research. An unfunded scientist is one who doesn't have the materials or ability to accurately analyze their issue. What I don't get is when people say that those who are funded by the government lie to support climate change.... how does that make any sense? Many high ranking officials in the government stand to profit from oil and gas sales. The republican party is now in charge of Congress, and their official stance is in denial of climate change. So why would the government want to fund pro-climate change research? The answer is, they don't. The government supports factual evidence collection, and the government, unlike private foundations, has degrees of separation between the funding and the science to keep it clean and factual.", "time": "6 years ago", "author": "Tristan Neal", "channel": "UCyV40yWjTTx6gbgKWWB3uDA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRgQCy6X77aJhkmWvox_UX8ndecSZf-O-9QUugAhg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugj8N94RLvUF5XgCoAEC.7-H0Z7-DtQp7DebJoGXSMD", "text": " @Tristan Neal  Your totally clueless. Billionaires control shit. They already give millions to scientists for one sided views. Keep drinking that piss water dude, it is working.", "time": "6 years ago", "author": "TekReviews", "channel": "UCCxE3kVJsS-DfaU0RLzK6kg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRqVXKFo422WBFKvS54mePfAT8gpJDajWwMfQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugj8N94RLvUF5XgCoAEC.7-H0Z7-DtQp8YdZvtPBEgk", "text": "Rev55 it's funny how you claim people need to get educated about \"real science\" then say God bless you, maybe you need to educate yourself about \"real things that exist, not made up things that don't.\"", "time": "3 years ago (edited)", "author": "Pablino Talbot", "channel": "UC3T6ovTvYOa1jmHsGAvDJLg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLRh_qIPR_-_P3nspzXAcsM3ItNMPnXwlnmErA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiUMb3aPgNsSHgCoAEC.7-H0Z7-BYyt70vvxEyBuyz", "text": "You might want to be educated. Look at this pie chart from a meta analysis on the climate change data from the last two decades.\n\nhttp://www.treehugger.com/climate-change/pie-chart-13950-peer-reviewed-scientific-articles-earths-climate-finds-24-rejecting-global-warming.html\n\nNotice how 99% of studies support climate change.\n\nQuit spreading misinformation", "time": "7 years ago", "author": "Phar Ph", "channel": "UCbnF47q9u6ukHe0lua7irxQ", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLSjXm8LhYz2IaXIf-n1BoN10VrcKLFNERLWqbp1=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN7-oy2hTOxQq", "text": "fucktard. India and China have not created this problem,that was the West, and mainly the USA. but India, has already a CO2 tax on national level. is investing in renewable energy. despite coal being much cheaper for them....\nChina is planning to implement a CO2 tax in the next few years. and gets NOW already almost 20% of their electricity from renewable sources.\n\nwhile you were dwellign in ignorance and Exxon sponsored myths. the rest of the world started solving the problem, even developing countries are already on board.......\n\ndon0t you think its a tiny bit arrogant of you to make such disgusting claims about India and China?\nand most of CHinas CO2 emission are because we from the west let our cheap mass products be produced in China......\nand you love the cheap prices....\n\nso shut the fuck up and get informed , moron.", "time": "7 years ago", "author": "Aanthanur DC", "channel": "UC6hkrY1YaXh7OGvkcDejpdA", "votes": "7", "photo": "https://yt3.ggpht.com/ytc/AKedOLRlX97u7_s9K5un-S17ahJ2JgeJnkgkt3y63PtggA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN7-pvtFGV5zp", "text": "i know its americas fault...exxon myths corporate greed...fuck off you dingbat....enjoy smoking your hippy grass and watch jon oliver.\n\nyes china's govt does what its want to its people cause its a communist govt.  So it will tax and fuck the peasant poor man even more....You knowwww.....China that grows there fresh renewable produce in human feces and garbage. Lmfao", "time": "7 years ago", "author": "Lamprey Milt", "channel": "UCWTuRno7e3QsTiUaEVd1SfA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLT6VXm0UDuik7iQf7uyhO5GDRokg2qEdd6Oe8NG8A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN7-qMtjc4jMY", "text": " @Lamprey Milt \n ignorant moron....", "time": "7 years ago", "author": "Aanthanur DC", "channel": "UC6hkrY1YaXh7OGvkcDejpdA", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLRlX97u7_s9K5un-S17ahJ2JgeJnkgkt3y63PtggA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN7-qOEv63xct", "text": "How buddy?  nobody cares about climate change. Its a load of shit. I been hearing about it for 20 years.  None of the prediction came true.\n\nIts a way for governments to STEAL more money.\n\nWhats the 1 thing that is free?  Air and guess what there trying to tax that also.", "time": "7 years ago", "author": "Lamprey Milt", "channel": "UCWTuRno7e3QsTiUaEVd1SfA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLT6VXm0UDuik7iQf7uyhO5GDRokg2qEdd6Oe8NG8A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN707HAnHsy8m", "text": " @Lamprey Milt \n Troll", "time": "7 years ago", "author": "JeanRain17", "channel": "UC7accR6QMlRew2gOFZaumkA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRttCAk_IP3_n2VoFW_jl912970W2qFj6bvghdy=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN70M-RuHowIs", "text": "what you just said can basicaly be summed up as\n\"they are still doing it so why shouldnt we\"\nit is the weakest and most pathetic shit i have ever heard", "time": "7 years ago", "author": "gregsmw", "channel": "UCWMvaY0eZ8ly1PTTfxA9EFg", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLSLNR0eHlEDLLpJr46Vo5tAjml1LU4hJ8-omw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN70MuclL3fRe", "text": "yeah. Why the fuck should we shoot ourselves in the foot? to let china have its share in destroying the planet? So the people who put obozo in power rake in the $$$ and fuck the middle class in the ass with no KY?\n\nBut seriously we have some bigger issues. I dont think people realize wtf is going on with this immigration.  Those 60k who are being held at the border are from countries that make Somalia look like a water park of gum drop smiles.  These \"kids\" have seen and done some violent shit. And they are going to be here to stay.", "time": "7 years ago", "author": "Lamprey Milt", "channel": "UCWTuRno7e3QsTiUaEVd1SfA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLT6VXm0UDuik7iQf7uyhO5GDRokg2qEdd6Oe8NG8A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN70eeaKoMVtE", "text": "Does taxing emissions actually solve the problem?", "time": "7 years ago", "author": "Ben Adams", "channel": "UCXriJGjYNPZG4UMJSdIYZQA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSpBOTCJqSrLWvaMDEqdWj1TYu5Cyn5jdkNug=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN70elsdmbpNb", "text": "i know...its bizarre thinking.", "time": "7 years ago", "author": "Lamprey Milt", "channel": "UCWTuRno7e3QsTiUaEVd1SfA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLT6VXm0UDuik7iQf7uyhO5GDRokg2qEdd6Oe8NG8A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN72_RCkRe7WW", "text": " @Lamprey Milt  Immigration is the least of your problems. If the planet was a toxic wasteland, there wouldn't be a place to put anyone. Some people just don't get the big picture.\n\nAnd taxing emissions curves the problem rather than solve it. Since Americans love money so much, it's bound to have a small if not significant impact. At least it's something, it's always better than nothing at all.", "time": "7 years ago", "author": "GanemA", "channel": "UCP0owCyNMnWiOLSjJj2T9yg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQFlsUU7XsitMlaK7k2JyaJ3QiyBlDtu3daWp7B=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN72fixy46CWL", "text": " @Lamprey Milt  failed to see the big picture again.\n\nWe're talking about the world here? Not a single country, but the entire world. I don't know if you recognize that America is on the same planet as everyone else, but if we all collectively work to destroy the planet, we're all fucked. What you're essentially saying is \"We're not number one in fucking this planet over, so it's ok.\" It doesn't change anything, we're still fucking the planet over.\n\nAnd yes, I stand by my point that America loves money. We throw lawsuits around like no tomorrow, we sell a monumental number of weapons to other countries, and our politicians absolutely love the off-the-books fundraising. The Chinese took influence from Western capitalism, so you can take that example back and shove it up your ass.", "time": "7 years ago", "author": "GanemA", "channel": "UCP0owCyNMnWiOLSjJj2T9yg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQFlsUU7XsitMlaK7k2JyaJ3QiyBlDtu3daWp7B=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN72gb4rYjpnq", "text": "buddy I think you fucking dont. Go enjoy being taxed on breathing or taken a shit at public restroom you useful idiot.", "time": "7 years ago", "author": "Lamprey Milt", "channel": "UCWTuRno7e3QsTiUaEVd1SfA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLT6VXm0UDuik7iQf7uyhO5GDRokg2qEdd6Oe8NG8A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN72gbDIzVwku", "text": "yes in dreamland the whole world will do whats right...its called Agenda 21. Which includes depopulation and  1 World socialistic government.", "time": "7 years ago", "author": "Lamprey Milt", "channel": "UCWTuRno7e3QsTiUaEVd1SfA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLT6VXm0UDuik7iQf7uyhO5GDRokg2qEdd6Oe8NG8A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN72h6VO5G2Sr", "text": "Again warning everyone Lamprey is a troll don't waste your time", "time": "7 years ago", "author": "JeanRain17", "channel": "UC7accR6QMlRew2gOFZaumkA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRttCAk_IP3_n2VoFW_jl912970W2qFj6bvghdy=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN72hAN4gdQ76", "text": "jean use common sense its a way for more money to go to the ultra wealthy and fucking everyone else like you who is the useful idiot to spew the bullshit...john oliver is a stooge of government along with stewert oreily hannity mahr etc etc", "time": "7 years ago", "author": "Lamprey Milt", "channel": "UCWTuRno7e3QsTiUaEVd1SfA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLT6VXm0UDuik7iQf7uyhO5GDRokg2qEdd6Oe8NG8A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN72hBWW5GyjC", "text": "See people don't talk like this ^", "time": "7 years ago", "author": "JeanRain17", "channel": "UC7accR6QMlRew2gOFZaumkA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRttCAk_IP3_n2VoFW_jl912970W2qFj6bvghdy=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN74uo-SUS6Ap", "text": "Actually, China is going to start reducing to. In any case, if aeveybody waits until somebody els does something, well, you know.\nSomebody has to be the first one in the pool. We have not been. We were the only nation to refuse to sign the kyoto protocol. Meanwhile, Indonesia, Germany and Holland are making huge strides with solar. The real question is: are we going to be the ones who fall behind?", "time": "6 years ago", "author": "Opinunate ted", "channel": "UCNYjpoGVWUp7m2cFlCOiamg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTVMuKRjM4IFoyR4CFS87jJmuhxqOAXofDoGw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN74v1m9K8eUt", "text": "Cause these regulations will destroy businesses. Also 12,000 Mayors did in fact sign on to Kyoto.", "time": "6 years ago", "author": "Lamprey Milt", "channel": "UCWTuRno7e3QsTiUaEVd1SfA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLT6VXm0UDuik7iQf7uyhO5GDRokg2qEdd6Oe8NG8A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN76tJittkQuO", "text": "Cause 'm posting on a video where the majority of viewers are mostly guys who blaze with born to lose tattoos eating dominos pizza at 2am using the word Fucking inbetween every other word,", "time": "6 years ago", "author": "Lamprey Milt", "channel": "UCWTuRno7e3QsTiUaEVd1SfA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLT6VXm0UDuik7iQf7uyhO5GDRokg2qEdd6Oe8NG8A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN76uQK5tOh3v", "text": " @Lamprey Milt  Yes, these regulations will destroy businesses. Because, you know, businesses are the most important thing in the world as opposed to, I don't know, mankind? Seems like a legitimate point.", "time": "6 years ago", "author": "GanemA", "channel": "UCP0owCyNMnWiOLSjJj2T9yg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQFlsUU7XsitMlaK7k2JyaJ3QiyBlDtu3daWp7B=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiJyW_SVF0pUngCoAEC.7-H0Z7-K2YN76uybuFl-8d", "text": "I need more money to eat you knucklehead. Do 3rd world countries have regulations? No...why cause they cant fucking afforded it.", "time": "6 years ago", "author": "Lamprey Milt", "channel": "UCWTuRno7e3QsTiUaEVd1SfA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLT6VXm0UDuik7iQf7uyhO5GDRokg2qEdd6Oe8NG8A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggVGqXdVfhMnXgCoAEC.7-H0Z7-OgPl7Co-wjIfoAC", "text": " @rurutu M  I wonder why we keep having to hire foreigners to do American tv shows. The new guy is from South Africa, way around the globe. Like nobody in the USA was available?", "time": "6 years ago", "author": "TekReviews", "channel": "UCCxE3kVJsS-DfaU0RLzK6kg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRqVXKFo422WBFKvS54mePfAT8gpJDajWwMfQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiTudLeHMCuK3gCoAEC.7-H0Z7-IPxy7-HD5UHoH27", "text": "Can you elaborate on your thoughts?", "time": "7 years ago", "author": "Marvin G", "channel": "UCrv1RiNorX6CNxseR07t0EQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSp9WXgBZzd49U22fHxbiH3kuiX_O46Y-r7Ug=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiTudLeHMCuK3gCoAEC.7-H0Z7-IPxy7-I57Yeg2gX", "text": "He doesn't need to elaborate when he has facts.", "time": "7 years ago", "author": "Jaden Kendall", "channel": "UCT8ceJXr-l9dj7YEVkPeUBA", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLTdMPMkC3F73HT8E5hbZhIlkjGLRlfftDHqOg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiTudLeHMCuK3gCoAEC.7-H0Z7-IPxy7-LlRFhMg7o", "text": "Stanislaw Lem is a published Pole...", "time": "7 years ago", "author": "opportunerain", "channel": "UC7T0y5IZ151Nwle7skWub8g", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLRIM_0YIFOKoz7uoHzCmtDEfD2EnFY1QicBDw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-IVGHkpbSR", "text": "shut the fuck up liberal scumbag", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-IuszkcwbV", "text": " @jedenasty10  Oh look, a conservative with no sense of humor. Meh, that's a tautology anyway. Did my comment remind you too much of your own drivel? Sorry pal, deal with it.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "26", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-IvUFfm3uN", "text": " @haiggoh  No, your comment reminded me of all you leftist fuckheads putting a gun to peoples heads all the time and telling them whats good for them. Get fucked in hell you evil scumbag.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-IwioP2Nse", "text": " @jedenasty10  Reality check, when was the last time someone did point a gun at you to make you do something you deem \"un-conservative\"? Spare me with your paranoid fantasies.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "22", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-IxlsX9i69", "text": " @haiggoh  are you kidding me?\nI'm being threatened with a gun on daily basis, Im being robbed of my money so that some leftist bureaucrats can waste it, and god forbid I decide not to do that and Im being put in jail at a gunpoint. Its even enough that I dont put my seat-belt on and Ill be forced to pay money, if I dont, here comes the gun again.\nIts pretty arrogant of you to ignore that fact.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-J0GZFiTMx", "text": " @jedenasty10  I think you are confusing the very existence of government, laws and taxes (which have been there ever since the USA was founded) with liberalism. If you want to live in anarchy where you don't have to abide by any laws and pay no taxes, go to a third world country of your choice and live there if you don't like American democracy.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "9", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-J3E1yR2Mm", "text": " @haiggoh  Except, none of the third world countries are anarchic.\nAnarcho-capitalist and libertarians all agree on one thing: every socialist is an enemy of humanity and freedom.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-J3tKvSQrH", "text": " @jedenasty10  republicans endorse laws and taxes as well. Don't even pretend that the GOP shares your extremist anarchic views. I don't see myself as a socialist by the way.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "7", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-J71DEFUO-", "text": " @haiggoh \nIm not even anarchist. and defninitely not republican, I hate those bastards", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-J88KdLGIE", "text": " @jedenasty10  Then we have at least something in common. You shouldn't just hate the left then, you should oppose both parties. Unfortunately, with the current system in the US, it's virtually impossible for a third party to get into congress. I don't know why people aren't focusing their efforts on getting rid of the idiotic two party system, all it does is divide the country and halt political progress over some idiotic hissyfit that shuts the government down with no results whatsoever.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "6", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-JFaopN107", "text": " @haiggoh \nI do oppose both of them, but leftists I hate with passion.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-JKVrgF4wO", "text": " @jedenasty10  The comittments of the political left are not what you think they are. All men are created equal and therefore should have equal opportunities, that's what it's about. What's wrong with that? Also, coming back to climate change, this shouldn't be a political issue at all. Facts are not debatable. What should be the discussion is what to do about it. That should be a bipartisan discussion because it has nothing to do with left or right.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "6", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-JOIAS9aHp", "text": " @haiggoh  I have a problem when you point a gun to my face and take $200 away from me only so you can wast $150 of it on bribes and buoracracy, and than the other $50 trying to fix some problem  and in most cases only making it even worse.\nI believe we are all born equal with freedom and responsibility. I compleatly support you having your own opinion and even if mine is different, I would never resort to using violence to make you act the way it pleases me. If you want to give your money to people who were born with less, youre free to do so, I might even do that with you. What I'm not going to do however is force you to do that at a gunpoint.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-JUE9UFDJW", "text": " @jedenasty10 \nI'm not pointing a gun at anyone and law enforcement shouldn't do that either unless they are in danger. You act as if the feds are knocking at your door on a daily basis. You are describing a totalitarian fantasy version of a police state which has nothing in common with actual life in the US. I'm just against police violence as you are, but I think you are completely overdramatizing the problem. I have never been threatened with a gun by a police officer, have you? And again, I get that you don't like that there are laws and a government and taxes, but that's how the nation was founded, taxes and laws have always existed as long as the US existed. The founding fathers didn't want the US to be some sort of anarchic state where there is no law and order and where everyone can do what they want and not pay taxes to the state. That's simply not an option and it can never work in practice. I'm all for freedom and liberty, but you can't expect the government to stop doing anything. That won't make anything better either.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-MH-8jMzap", "text": " @haiggoh  Everyone is unhappy with their government, and I'm just sitting here eating poutine.", "time": "7 years ago", "author": "Sage Lee", "channel": "UCyQ3HKPrakHUNTYT7e3uswA", "votes": "6", "photo": "https://yt3.ggpht.com/ytc/AKedOLTeW7wlRgkhLZszX4G_XrwfwhdeBitPhYK351-R=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-e0F5l0x1Z", "text": " @haiggoh \nI dont expect goverment to stop doing anything, I want people to realize that goverment is nothing but a burden and get rid of it.\nFeds arent knocking on my doors every day but every rule they put in motion is a violence\nthreat against me, essentially its a death threat. If I dont obey by their rules, if I dont pay enough to them, armed people are going to come to my house and demand money, if I dont pay them, theyre going to try to lock me up, if I resist enough theyre going to shoot me.\nDont tell me im overdramatizing anything cause im just telling it how it is.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-e2YC1QHgt", "text": " @jedenasty10  If you pay your taxes like any other law abiding citizen has done ever since the nation was founded, you won't have any trouble with the police. No tax-free state in the history of mankind has ever managed to sustain itself, it's a construct of wishful thinking, it doesn't work. Anarchy ultimately results in lawless chaos and neglection of infrastructure, education etc and so on. You can dream on about a government-free world, it won't happen and it's probably for the best. Instead of rejecting the very idea of government and taxes that every republic in the world relies on you should instead think about how the government can be fixed to serve the people as they are supposed to. Fighting corruption should be the number 1 priority rather than just complaining about everything and everyone.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-e3HD58QV2", "text": " @haiggoh \nIm pretty sure you meant to write \"pay half of what you make like any good slave did since the beginning of slavery. \"\nIf u gotta collect taxes they should only go for inner and outer defense. Government controling education is disgusting, and its the reason we cant have nice things.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-e6Fok2PMM", "text": " @jedenasty10 \nGovernment is not controlling education, it is offering education. Anyone can go to a private school if they prefer to do that. Not everyone is so fortunate to be able to afford that though, so the alternative would be poor people not being able to send their kids to school whatsoever, so welcome back to the dark ages of medieval illiteracy if that's what you would prefer. And taxation is not slavery. The money is not stolen from you, you benefit from the investments that the government makes with your money. In WW2 they raised the income taxes to 95% for the rich. 95!! And yet here we are and people are complaining about the 35% we have today, not to imagine what people would say about raising them as high as they did back then to fix the deficit. Yet if those tax raises hadn't happened you'd probably be speaking German now. Taxes are necessary. And no, not only for defense, even though that certainly is one of the most expensive parts of the budget, certainly.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-e82PVd3LO", "text": " @haiggoh \nNo, even the private schools need to teach exactly what the government wants them to teach. Its very anti-competition and anti-progress.\nThe money IS taken away from me, if I wouldn't be threatened with violence and death I would not pay it. I benefit some from the money they take away from me, but mostly I loose freedom to all the regulations making it even harder to start a business or do anything really.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-f7c3bgXp9", "text": " @jedenasty10  Of course you can't call yourself a school if you for example teach alchemy instead of chemistry or something, there have to be certain national curriculum standards. Otherwise all degrees would become meaningless because you can't compare them against each other. But beyond that private school do have many liberties to put stuff into the curriculum you wouldn't find in public schools.\n\nExactly, you wouldn't pay your taxes if tax evasion was legal and so would everyone. There would be no taxpayers whatsoever if law enforcement didn't persecute tax evasion. And they won't storm your house and shoot you as you portray you, you would get letters and eventually you'd be put on trial in court and you could end up getting some jail time depending on how much tax money you have refused to pay. I don't know what other alternative you suggest to make people pay their taxes.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-fA0eekN5L", "text": " @haiggoh  it shouldn't be up to government to decide what I can and cannot call school. Does goverment decide what we can and cannot call a cellphone? no. and thats why cellphones are evolving so fast as opposed to education system.\n\nwho said I need an alternative to making people pay taxes?\nits like living in usa during slavery and saying \"well what other alternatives you suggest for picking cotton?\"\n\nSlavery is just as immoral as a bunch of political elites deciding how you should live your life and much money you need to give them and than threaten you with guns if you don't pay.\n\nAgain, Im not trying to say that police shoots people every day for taxes, but people pay because as you said, otherwise they might get time in jail. If someone resists geting put in jail and pulls out his gun hes gonna get shot, so yes, it is a threat of death.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-qNwwHYjbK", "text": " @jedenasty10 \n how old are you? 14?\n\ncomparing taxes to slavery..... you are just disgusting", "time": "7 years ago", "author": "Aanthanur DC", "channel": "UC6hkrY1YaXh7OGvkcDejpdA", "votes": "4", "photo": "https://yt3.ggpht.com/ytc/AKedOLRlX97u7_s9K5un-S17ahJ2JgeJnkgkt3y63PtggA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7-qhHcMTy5t", "text": " @Aanthanur DC  nope", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw705OL2dFblu", "text": "+jedenasty10 lol you say some funny stuff. 😂", "time": "7 years ago", "author": "Fernando Herrera", "channel": "UClXCvyEULjfzoBXnVj6n1oQ", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLQvllo6Rni3VKm2XVuzqOQMm0tpCBkm2ZJpyNDYmw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw705Q5yzo3SU", "text": " @Fernando Herrera  like what? commie", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw705QGPSOllR", "text": " @jedenasty10 \nlike calling people you don't even know communist for no reason just because they disagree with your opinion.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "3", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw705thiOktJg", "text": " @haiggoh \nI hovered over his name and there was a quote praising socialism.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw706W5rGUMnU", "text": " @jedenasty10  democratic socialism and Stalinist/Maoist  communism or even Marxist communism for that matter are very different and I think you must be aware of that.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "4", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw706d3CxaWxb", "text": " @haiggoh  they are a little different, but it doesnt matter because every socialist is an enemy of humanity, doesnt matter of its mao, stalin, hitler, bush or obama.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw706fJYayTuT", "text": " @jedenasty10  Hitler and the Nazis were racist right wingers conservative to the bone. They put liberals, social democrats, and marxists/communists into concentration camps.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw706ftoRxGT2", "text": " @haiggoh  yea cause hitler believed that his form of socialism is superior to the other kinds. Just because someone doesnt like communists doesn't mean he is a right winger, there is no logic in that.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw70G25DnZ2x0", "text": " @jedenasty10  you are one crazy thing.", "time": "7 years ago", "author": "Fernando Herrera", "channel": "UClXCvyEULjfzoBXnVj6n1oQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQvllo6Rni3VKm2XVuzqOQMm0tpCBkm2ZJpyNDYmw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw70G3Sb2byHw", "text": " @Fernando Herrera  at least im not a fun of stalin, hitler, and other socialists.\n1 year of socialism is worse to a country than 2 years of war.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw70G3wYi63kh", "text": " @jedenasty10  well that was a big load of unsupported crap. I sure feel sorry for Denmark. I heard they are real sad over their with all that worse than war socialism!", "time": "7 years ago", "author": "Fernando Herrera", "channel": "UClXCvyEULjfzoBXnVj6n1oQ", "votes": "5", "photo": "https://yt3.ggpht.com/ytc/AKedOLQvllo6Rni3VKm2XVuzqOQMm0tpCBkm2ZJpyNDYmw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw70G5OyLOqUt", "text": " @jedenasty10  I'm sure you already do! You spend your time spreading words of love and hope right? Capitalism has failed, a mixed system that calls for our gov. to uphold it's constitutional duty will be put in place over time. That duty being to promote the general welfare of the people and to defend the nation. Even if it means defending it from the scum that is Wall Street and our banking system itself. ", "time": "7 years ago", "author": "Fernando Herrera", "channel": "UClXCvyEULjfzoBXnVj6n1oQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQvllo6Rni3VKm2XVuzqOQMm0tpCBkm2ZJpyNDYmw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw70G6FvXMVPS", "text": " @Fernando Herrera \nwhen has capitalism failed?\nwe need to get rid of FED, that's obvious, and people in wall street are only helped by the government, cause they've got enough money to lobby the right bills. capitalism means power to the people, not to politicians and rich elites helping each other.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw70G6bH7_yOi", "text": " @jedenasty10  history would disagree with you. The Great Depression is a perfect example. And with our economy shifting from a manufacturing economy to a creative economy as it did during the Great Depression but from an agriculture economy to a manufacturing economy, we need government to work for us now more than ever. Don't know if that's happening anytime soon, so for now, the transition is going to be painful.", "time": "7 years ago", "author": "Fernando Herrera", "channel": "UClXCvyEULjfzoBXnVj6n1oQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQvllo6Rni3VKm2XVuzqOQMm0tpCBkm2ZJpyNDYmw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw70G7MWiI3jq", "text": " @Fernando Herrera \nWe need government to leave us the fuck alone, just like we ever did.\nand how is America going to shift to a creative economy with the population being idiots raised in public schools?\nalso, what do u mean by that transition? transition to what exactly?", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw70GB3fiSTxm", "text": " @jedenasty10  http://www.forbes.com/sites/stevedenning/2012/01/31/is-the-us-in-a-phase-change-to-the-creative-economy/ ", "time": "7 years ago", "author": "Fernando Herrera", "channel": "UClXCvyEULjfzoBXnVj6n1oQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQvllo6Rni3VKm2XVuzqOQMm0tpCBkm2ZJpyNDYmw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw70Ghxztq4Ej", "text": " @Fernando Herrera  As a dane, that one made me snicker. Also, please note: Your competing in the special olympics at present my friend. Nothing you can will change that one, either its a troll or its too ignorant to change its mind.", "time": "7 years ago", "author": "Lars L", "channel": "UCcVVkS5Y3KLCJzL9XKzQ3Dw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQ0r9cNz5_nVXGMwiej60Pi6fp85MHvAfe1_A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw70HNT9j0x3n", "text": " @Fernando Herrera \nwhat a load of bullshit. also its funny how it seems like u based all your opinions about economy from a single forbes article.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw70HnHuetz5S", "text": " @jedenasty10  on Google Scholar look up creative economy or shift economy or something along those lines. He isn't original in what he is saying. I am curious though what you have to say about the actual content of the article.", "time": "7 years ago", "author": "Fernando Herrera", "channel": "UClXCvyEULjfzoBXnVj6n1oQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQvllo6Rni3VKm2XVuzqOQMm0tpCBkm2ZJpyNDYmw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw70HnQpqCKK1", "text": " @Fernando Herrera \nHe won't read it because he doesn't like his biased views to be challenged.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw70IFF64CWhZ", "text": " @haiggoh  and what I was showing him isn't liberal or conservative. It pretty much says the approach to our economy that the democrats and the republicans are trying to take is wrong.", "time": "7 years ago", "author": "Fernando Herrera", "channel": "UClXCvyEULjfzoBXnVj6n1oQ", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLQvllo6Rni3VKm2XVuzqOQMm0tpCBkm2ZJpyNDYmw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw70IGM3xcnTd", "text": " @Fernando Herrera  I'll read it, sounds interesting. And it's based on the work of a nobel prize winner too, as I can see. He should know what he's talking about I would assume.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw70IG_ukH8B6", "text": " @haiggoh  it's a theory, but one by a reputable man. Worth thinking about for sure.", "time": "7 years ago", "author": "Fernando Herrera", "channel": "UClXCvyEULjfzoBXnVj6n1oQ", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQvllo6Rni3VKm2XVuzqOQMm0tpCBkm2ZJpyNDYmw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw71I9K9oQVTw", "text": "Wake up sheeple! Open your eyes and take off your fedoras! ", "time": "7 years ago", "author": "Kevin Nestler", "channel": "UCqNdTI2nxzCZ-ArsPI_ueFg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQ3Wxt-dl2alBGsmz-gMT8dbMUlmQ5nDKtqAaviiA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw71I9ppxR8bN", "text": " @jedenasty10  This man, ladies and gents, is the definition of an idiot. You truly are just regurgitating the ridiculous dribble of others, aren't you? Chill dude. It was a joke. If you love your freedom of speech so much, than try not to flip your lid every time someone uses that freedom.", "time": "7 years ago", "author": "Kevin Nestler", "channel": "UCqNdTI2nxzCZ-ArsPI_ueFg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQ3Wxt-dl2alBGsmz-gMT8dbMUlmQ5nDKtqAaviiA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw71J5YeMO0Ci", "text": " @Kevin James \nwhat? you dont like when people call you names without giving any arguments? than perhaps you should read your own last comment.\ncheers", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw71JoOVhdsK8", "text": "He was calling you an idiot based on everything you said in this thread and how you get riled up about bullshit. You called him a pedo based on, well nothing. So its not the same.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "4", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw71JozuvEUei", "text": " @haiggoh  it would be different if he would have started with \"you are an idiot because...\" and than followed up with an argument.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw71yaVMVDGKV", "text": " @jedenasty10  Sounds reasonable. You are an idiot because you think the IRS is threatening you with a gun.", "time": "7 years ago", "author": "MrTortillasoup", "channel": "UCLdLrhXSF8m32tWl1IHMCOQ", "votes": "5", "photo": "https://yt3.ggpht.com/ytc/AKedOLShMHgZLtNjdaXxqh_76CYY3sNW9vfdEXWmZw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw71zF2u6BuQS", "text": "I think you may have watched to much fox news mate, simply insert anything not right wing (the lefties for example) into the following sentence and you have yourself a cnn/fox news quote:\n\n\"The....hate our freedom, the hate our way of life, they hate this country and their movement can all be compared to that of (insert random dictator)\"", "time": "7 years ago", "author": "EngiYoutube", "channel": "UCSh4D1VmvvBpPu8eIo5WlFA", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLTuOoT-xUpcs1C4-ZOZFGVeeq2ktxHk3wiaKA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw72-TZFOVyNP", "text": " @MrTortillasoup \numm whats going to happen when you dont pay ur taxes? theyre gonna send an armed guy to your place to try to get your moneyto try to lock you up. if you resist and pull out your own gun, they might shoot you and kill you. is that not how it works?", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw72-g_H6ushU", "text": " @jedenasty10  What's your suggestion to fix that? Order policemen NOT to defend their lives when a resident pulls a gun? You can't be serious.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw72-rVCGJCGS", "text": " @haiggoh \nNo. my sugesstion is that this whole situation when armed people come to your house to take you away because you didnt pay \"youre share\" is sick. And btw. do you expect me NOT to defend my life when armed people come to my house to enslave me? just because I didnt pey them as much of my own money as they would like?", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw720BHZQp3D-", "text": " @jedenasty10  It's your duty as an American citizen to pay your share and the federal government has a constitutional right to collect taxes (you might want to read the constitution some day, it's enlightening). If they stopped doing that, the USA would probably not even exist anymore at least not as a sovereign state. Do you like your money more than your freedom? Without fedaral taxes you'd now be living under German or Russian occupation, I wonder how much you would have liked that.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw720JeC9eAc6", "text": " @haiggoh  lol\nyou want to tell me that government takes away half of what I make in order to make me free? war is peace and freedom is slavery, right?\nalso where did you get the idea that without political elites and their minions robbing me off my money America would be occupied by Germans? Right now america is occupied by the goverment, can you imagin how many families would still be alive if america didnt use your tax dollars to invade other countries?", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw720T7B90ReQ", "text": " @jedenasty10  Nobody needs to make you free, you already live in America which means you have a lot more freedom than basically any other place in the world. But of course you're still not satisfied, you want to hoard your riches and not share a single dime of it it to the benefit of your country. You're not much of a patriot, are you?\n\nAmerica is not occupied by the government, this country was founded as a republic. Without a sovereign government it would still be a British colony. Blame the founding fathers that they decided America needs a federal government instead of living in total anarchy (which seems to be what you'd prefer).\n\nAnd yes I'm also against America invading countries like Iraq, but in WW2, if the US hadn't joined, Hitler might have won the war and don't think he wouldn't have had any intentions to conquer or annihilate America. Learn your history.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw720Vahcxu1H", "text": " @haiggoh \nIf my master takes away 100% of my profits its slavery, right?\nhow about if its 95%? is it still slavery? how about 70% or how about 50%?\nsurf class in Russia was considered to be pretty much slaves and yet they only had to share 15% of what they made.\nHow come now with all the science and technology government needs to make us work first half of every year just to pay taxes?\nI reccomend you watch \"the story of your enslavement\" here on youtube.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw720acNhPypJ", "text": " @jedenasty10  I won't watch your propaganda bs and suggest you get a grip of reality and stop drinking the conspiracy theory coolaid. America was founded as a democratic republic. In a republic the citizens are represented by the politicians they vote. The govt. is not a foreign entity that takes away your money and keeps it. Politicians administrate the money they collect from the citizens and spend it to the benefit of the nation, such as defense, retirement pensions, water and waste disposal, roads, public transport, fire departments, etc. Without all these expenditures a state collapses quicker than you can say \"from my cold dead hands\". The govt spends your tax money to your own benefit and therefore it is not akin to slavery in any way, no matter how you spin it. By choosing to live in America you agreed to keeping American laws and abiding by the constitution. Like it or not, but that's how things are.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw720cUOeQu5_", "text": " @haiggoh \nby choosing to be born in America you mean? Its not conspiracy theory its pure logic and philosophy. Defense, retirement, water, roads etc can all be done by private corporations voluntarily instead of being forced by armed people to pay up. thats how the mob works. would you rather have armed people walk into your place of business and force you to pay for protection, or do your research and pick security firm which suits your needs best?", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw720oe7UUD4Z", "text": " @jedenasty10  No by choosing to stay. You can leave any day now. Many Arab countries don't have income tax, let's see how much more freedom you have there since keeping your riches together is apparently all you care about. I bet you'd like their sharia law. I mean who cares right, at least they don't \"enslave\" you.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw720pEu_67dj", "text": " @jedenasty10  Ok but snide remarks aside, what you are suggesting is a fantasy wonderland libertarian utopia that can never exist in reality. No country in the world has no government and everything privatized.\n\nThe \"free market\" can't solve all problems without government regulation. Without the FDA, we'd probably all have cancer by now since no for profit corporation would ever go through the hassle of properly testing their product. The health of the customers is of little concern when a quick buck can be made. And that's just one of many examples, privatizing drinking water is very problematic for similar reasons.\n\nThe problem is people are egoistic assholes. Are you honestly trying to tell me you'd pay your share to pay a company to fix roads? I bet you wouldn't give a shit. Everything would decay. Garbage would lie around on the street because everyone's too cheap to pay for neighbourhood waste disposal.\n\nAnd don't even get me started on the privatization of the prison system, that is already bad enough as it is now. Incarcerating people should never be a for-profit business.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw721_UnPLmF7", "text": " @haiggoh \n\"people are egoistic assholes\" thats precisely why socialism doesn't work and free market does. If i want to make money with my corporation all Im thinking about is how to satisfy my customers better than the competition. The problems start when you take those \"egoistic assholes\" and put them in charge of telling other people how to live their lives.\nUnless you believe that somehow the ruling class is free of being \"egoistic assholes\" but im pretty sure you know its not true.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw721vYXMdQlg", "text": " @jedenasty10  By taking away all power from the government, you are not giving it to the people but actually to multinational corporations, who in turn become the real oligarchic ruling class. It's a form of survival of the richest where the poor get treated like dirt. Without the government to limit the power of those corporations and keep them in check we, the people, are at their mercy. Do you think those corporations are interested in sustaining a free market? No, they are only interested in maximizing their gains. Hence they strive for eliminating competition by abusing monopolist power to destroy small businesses, by merging with the competition and by forming cartels to keep the prices up. Without unions, employees would also gradually lose their rights and become slaves to the wage. If you think we live in slavery now, you should see REAL industrial capitalism like the Chinese sweatshop workers live through daily. Your libertarian \"small government\" utopia would quickly turn into a monopolist oligarchy nightmare.", "time": "7 years ago", "author": "haiggoh", "channel": "UCHmbBYyHR4SXfA8lPv0aMHw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQlz_uGmL2jD9_3QY5CIdpf9dI3WeEtxJ2Nt3qs=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw724ofARpyHa", "text": " @haiggoh \ncorporations are going to do what exactly?\nall that corporations can do for you is to give you choice. do you want to buy my product or not? do you want to work for me or you dont?\nIf you dont like one corporation just walk over to the next one. You are so scared of corporations that you rationalize armed people taking away half of your stuff so that somehow monopolies don't happen.\nBut evidently you have no idea where they come from.\nRiddle me this: why does it cost a million dollars in new york for a license to drive a taxi cab? to keep corporations in check and make sure no monopolies will happen? or maybe so that existing ones will prosper and competition will never even begin to grow?\nWhen you gather a bunch of people, put them in offices and give them power to make rules which corporations and humans have to abide than you create a doorway for monopolies.\nYou know what investment is most beneficial for big corporations? lobbying. Paying politicians enough money to make sure that those politicians will pass laws which will keep the competition down.\nDo you really think corporations spent millions and millions of dollars on political campaigns so that the same politicians will keep them in check?", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw72QtPeerMuO", "text": "LOL!!!! ITs a conspiracy to make us believe hats exist!!!! OMG>..lOL!\n\nGrabs fedora...", "time": "7 years ago", "author": "jetpaq", "channel": "UCdoSz6yRS0aGRGPfW31B-DQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRU-TrDqTJz7bH0-lXeEJ9ewCnCCsGGsYK9RmkO=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw7329mZISjpV", "text": " @jedenasty10  Probably late as hell, but I noticed you said earlier (long time earlier) that \"every socialist is an enemy of humanity and freedom.\". I'd just like to point out that Socialism is actually a great method of government, because it let's the government own business enterprises to keep the country's treasury and economic system in check. Not to mention it's better than a bunch of corrupt politicians doing whatever your \"corporations\" want in order to get a bigger pay check. You also say \"all that corporations can do for you is give you choice.\", that may be true for the small business's, but the big ones can decide to do anything they want because they have the money and power to do so. I'm not even going to say it's just one party that has fallen to this morbid corruption. I used to be Liberal, until I noticed that Obama appointed AT&T's Lobbyist as the \"U.S. Federal Communications Commission\", giving them the power to have a complete monopoly and defy Net Neutrality Laws. This country one of the most corrupt places on the Earth, and what's worse is hardly any one cares about the current issues. I mean we're still debating on facts like Climate Change for God's sakes. Not to mention this country isn't even \"free\", there are people like Gays and Atheists, who are still denied rights, because they have a different sexuality preference or they don't believe in something they find improbable. I'm not saying to adopt their ways, just let them have the same rights as everyone else, and end the corruption of these corruptions, because their hold on our country is far more severe than what meets the eye. \"A.M.E.R.I.C.A. Home of the \"free\", the sick, and depraved.\" - Motionless in White", "time": "7 years ago", "author": "Jeremy Stire", "channel": "UC--RkXUYIW9vQqGdfhlaDJw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLT0YOmYk96D0ZgrkhAhJY-BgmUq6xQimsQNig=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw732BehHCQi8", "text": " @Jeremy Stire \ndude what?\n\"Not to mention it's better than a bunch of corrupt politicians doing whatever your \"corporations\" want in order to get a bigger pay check.\"\nthats EXACTLY what socialism is.\n\"I used to be Liberal, until I noticed that Obama appointed AT&T's Lobbyist as the \"U.S. Federal Communications Commission\", giving them the power to have a complete monopoly and defy Net Neutrality Laws.\"\nagain, in free market economy shit like that would be impossible. Free market = market free of government intervention, market free of lobbying.\nalso, what kind of rights are atheists denied in america?", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw732DOnLyhqW", "text": "First off, no that's not what socialism is. Socialism is where the government owns 20% or less of the business in the country. Not where the companies have the politicians in their pocket. Second off, free market economy wouldn't solve that problem because the government will always have at least some control over everything, and sure enough that portion will be corrupted. As for the Atheist rights, I'm denied my civil rights every day. I'm not allowed to get a job at certain places, I made Eagle Scout in Boy Scouts, only for them to tell me that I was no longer apart of their association, because I'm Atheist. Oh and let's not forget how my life is threatened every day by extremist Christians, Muslims, or whatever religion they belong to. Also I know you didn't ask about it, but gay rights are also infringed upon, they can't even getting fucking married to the person they love in certain states or show affection in public at times.", "time": "7 years ago", "author": "Jeremy Stire", "channel": "UC--RkXUYIW9vQqGdfhlaDJw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLT0YOmYk96D0ZgrkhAhJY-BgmUq6xQimsQNig=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw732FEuDus1N", "text": " @Jeremy Stire \nwhere did you get that 20%? socialism is where politicians make rules about how the market should work, those are the same politicians who get bribed by corporations to change rules in their favor.\nYou are not denied any rights as an atheist, you want to deny people rights to hire whoever they please. As for gays, why do you think it should be government who decides who can and cannot get married? In libertarian free-market society different churches would decide that, and gays could create their own church if they wanted to.", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw732IJyCUlDm", "text": "Yes, but it's the states that give out the marriage licenses which they refuse to do so in the case of homosexuals and other sexual aspected people. BTW, I apologize you were correct about socialism and you've broadened my mind on the subject of it. So thank you for that.", "time": "7 years ago", "author": "Jeremy Stire", "channel": "UC--RkXUYIW9vQqGdfhlaDJw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLT0YOmYk96D0ZgrkhAhJY-BgmUq6xQimsQNig=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw732IwUym2IC", "text": " @Jeremy Stire \nWell thank you for thinking :)", "time": "7 years ago", "author": "WSTYD OBRZYDZENIE HAŃBA I DEGENERACJA", "channel": "UCwfzyxPzLmQR8Z3trbSD1oA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSExUgHQVe603EuK3zJCc0kOR1DQrbHxokeVDld=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw732KD0TPguW", "text": "No problem, we all need to be thinking so that we may all keep our minds educated so that maybe we change things that are wrong with this world.", "time": "7 years ago", "author": "Jeremy Stire", "channel": "UC--RkXUYIW9vQqGdfhlaDJw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLT0YOmYk96D0ZgrkhAhJY-BgmUq6xQimsQNig=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw76CdO4XI9OC", "text": "Are there hats in this video game Plays TF2 for 3000 hours later I WANT ALL THE HATS ALL OF THEM REAL OR NOT. ", "time": "6 years ago", "author": "Technocracy", "channel": "UCO7zZ-TJJvDhMUbOhU--EBQ", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLRmZUwWVTnWyaKc3cZLHGkSUCc29x8qOkxBYWycAg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw76FxDFhw7tY", "text": "I Hate you so much. I Hat-e you so much!", "time": "6 years ago", "author": "Kenjinn", "channel": "UCs6jQqJ1YI8Pbu7t53Fpr2g", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLR39ZF5eTZnBiCGLxZ6S8ECxA7D_jk5h4iEKmEo=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggL9laf6ZpfEHgCoAEC.7-H0Z7-1uYw8ORVQpxM-zM", "text": "haiggoh global warming is a lie, trump created it to throw people of from the fact that he is a PUSSY GRABBER", "time": "4 years ago", "author": "The Proclaimed", "channel": "UC-PFC1vej5mHCljhvWj5phQ", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLQkbMDqUYzVylFRrKBWWgFnKTUYLgXW3O9KK96A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UggicXBi2_d-s3gCoAEC", "text": "Do polar bears exist?", "time": "7 years ago", "author": "OptimusWombat", "channel": "UCPzrMNroA7i_fHCszTauZDQ", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLS3dLIULRcauk2Oqw_QO7MW2_GHCU7CgdirOw=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugjgx7uBczQBcngCoAEC", "text": "That polar bear is screwed.", "time": "7 years ago", "author": "Queue Snake", "channel": "UCFgts06oI_0mK3Z_1TZumDg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSYqhFrwuXTg84ctrB_0BWenDm2b-2IJs80ag=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgjJx8hSsydZO3gCoAEC", "text": "I take issue with the moral implications of hats.\n\nHats:  are they still relevant in the digital age, and should we stop using mercuric nitrate to simulate period accurate hat-making techniques to go with 19th century steam punk comicon costumes?", "time": "7 years ago", "author": "Queue Snake", "channel": "UCFgts06oI_0mK3Z_1TZumDg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLSYqhFrwuXTg84ctrB_0BWenDm2b-2IJs80ag=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgjgwAFEFP-6CngCoAEC", "text": "wha wha wait what? I thought this was a youtube thing. You know, because of convenience and crap. So, no? no.. ok.. Where's that \"subscribed\" button. Oh! There it is. Bye!", "time": "7 years ago", "author": "Joe Machado", "channel": "UCMdHFonyWBYQ2rQtWDs2Tsw", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLQj6aWyOYJDRi098i-i8wswFcDkcAJj4Yr7T4O-Mg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgjsoWI2VDCO1ngCoAEC", "text": "I was a little nervous at first that Oliver's show wouldn't be as funny as the Daily Show because he wouldn't have the same writing staff, but from the first couple episodes, I have to say that John is doing a great job.\n\nWell done HBO!  Your additional monthly fee is well worth it due to original content like this.", "time": "7 years ago", "author": "JosephM1750", "channel": "UCQENjzj0ruj-u1ddm4JFgYg", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLT3q6YoSVpzVQGDye4CW00aylX9avzhshsP7A=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghSa9NaGRlIcngCoAEC", "text": "12th comment woooo", "time": "7 years ago", "author": "REAPER", "channel": "UCZaUFIVk5bCr4PICvOZ8yUQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRr7H03Q6vqZlF4v5B1wIrttuv40osVHUzeIpL1=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgjaewxRf_UWc3gCoAEC", "text": "Putting whole episodes online will help you gain subscribers, which in turn help you get advertisers, which get YOU money. There will always be people advertising you on the TV, where the majority of people will watch you, but on YouTube, you can ignore all copyright laws and complex things, which will help you in the long term. Think about it this way. You can comfortably say that the Jimmy Fallon YouTube channel gets around 1000000 views a month, and assuming that a person gets 1 dollar per 5000 views(which is a lot lower than most people tend to believe), then the channel gets around 40000 dollars a year. Now, if you get 1000000 views every video, then you would get 160000 a year. Of course you won't start out with that sort of money, but the channel will progress. ", "time": "7 years ago", "author": "Arshan Goudarzi", "channel": "UCwyhhK9S8HSP-nroRNm-6GA", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLTLEL-v43QZuR6RWCJhZOAxYL0uErTM_UwzA1eF=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgizZz_xmuVQTXgCoAEC", "text": "....", "time": "7 years ago", "author": "samedens1", "channel": "UCXVOI85hTKOBho70cG19jFA", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLTBVs6x0Svf7mZJw6XxEjGm-RCTZUAmIfZlMe-K=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UghtaJYsPCVRy3gCoAEC", "text": "Hey LastWeekTonight, Can you put a link in the description of the video linking to the website or where we may find the entire video?", "time": "7 years ago", "author": "Wonda Women", "channel": "UCW2IJ30pXNrYKxpyLH7fs6g", "votes": "2", "photo": "https://yt3.ggpht.com/ytc/AKedOLQiQJ4F_ueaI4x0mc0GM8qZilKnkcNuIXeIK4qu=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiXP2Gv5Iodn3gCoAEC", "text": "Are there hats? you decide", "time": "7 years ago", "author": "CrypticMind", "channel": "UC0HGOO3K-1ZrHq67DOlNF5w", "votes": "69", "photo": "https://yt3.ggpht.com/ytc/AKedOLQ29m6Lcjln-QsXb-DBRpEswfZdCmXYVCiTcmFB=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgievsGr26QCzHgCoAEC", "text": "Where can one get the full version?", "time": "7 years ago", "author": "Mike Reed", "channel": "UCXRhWSV82Ehe-KjyfF2bNkg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLS02RWZeyla0-_wj0B1C0nC5c5XXo18eOP3=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugj5d17RAoy-lngCoAEC", "text": "Fuck you Chris and I can say that because I own a FUCKING MOUNTAIN ", "time": "7 years ago", "author": "Damien Burns", "channel": "UC4DsLFU_TLZ-SLEH8DrX-xg", "votes": "4", "photo": "https://yt3.ggpht.com/ytc/AKedOLSUjsbNirqoiOLF0wVXNmFqpO_aWI-PsdVeUqDU=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugg8ywy4qh3Wv3gCoAEC", "text": "This is funny but, depressing when you look at the statistics.", "time": "7 years ago", "author": "Kiska", "channel": "UCedG97OPYbFntCP1FmRs_VQ", "votes": "5", "photo": "https://yt3.ggpht.com/ytc/AKedOLQDJUIo16ynoLwIAOVIm9yrcYNMcKIwAYP26gq1=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugi2rgR7ywf-PngCoAEC", "text": "I love it", "time": "7 years ago", "author": "Mark Brown", "channel": "UCuhIuc-WwblWD5_B7K7_1RQ", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLROHdBd35l8RGLJUQBfunYHrhpHJkv8I_-BpK5TRsM=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugjgx7uBczQBcngCoAEC.7-H0Z7-7ban7GoBGS9OdR6", "text": "RIP in peace, polar bear", "time": "6 years ago", "author": "Gigabic", "channel": "UCb6tt1YjoBhvxzGcVfSlRvg", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRHLUQzSYDE3gW84-HUa1rkV2_AoQCI_L113jjK=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgjaewxRf_UWc3gCoAEC.7-H0Z7-PzSA7-H3wPfRMNA", "text": "If they put the whole episode online then last week tonight no longer draws in subs for HBO which is the only reason they fund shows. Theyre releasing parts of the show online to generate interest and maybe gain more people subscribing to HBO which in the end will likely make more money then youtube will.", "time": "7 years ago", "author": "Joel Lowe", "channel": "UCqmqHpi5FqWSnhs_NWfWgmg", "votes": "4", "photo": "https://yt3.ggpht.com/ytc/AKedOLS7t6Zg57Z7VrFhEWBwWzpJWjjizR_n13I8AQ=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgjaewxRf_UWc3gCoAEC.7-H0Z7-PzSA7-IdsfvWn7Y", "text": "I'm going to just torrent the show if I can't watch it online. I don't have television in my home. ", "time": "7 years ago", "author": "Michael Washington", "channel": "UC-sNHrtxK6X_hWczW5bX63g", "votes": "0", "photo": "https://yt3.ggpht.com/ytc/AKedOLRgYCaRCSnPWw2GZwmtJJ0XeNGu2DD3vBsMeObMplU=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiXP2Gv5Iodn3gCoAEC.7-H0Z7-FUQ972xKFtJ8EGq", "text": "No?", "time": "7 years ago", "author": "CVArnaldo", "channel": "UC4fmOC8Cl4iHDpv8wIV4PMA", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLQ_MjfORu4iqx5eP61aB_-5J_lMoJvBpysb=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiXP2Gv5Iodn3gCoAEC.7-H0Z7-FUQ9774Hc1j_l5M", "text": "Guess we have to teach the controversy.", "time": "6 years ago", "author": "tritoneangel80", "channel": "UCf679wnU9kPszG4AyMgbTZw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLSsCURfh8huqfF3X_af_wl5kRv1Dh5ZO1hP2g=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "UgiXP2Gv5Iodn3gCoAEC.7-H0Z7-FUQ98f67l9GECLe", "text": "CrypticMind , They will soon be extinct. We should be careful.", "time": "3 years ago", "author": "S.I.V.", "channel": "UC9LQ0edmqeAvQf_n4afZJTw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLT74v_jOYoHDKRRLvtUOY-qbpo8znVSAUPc2BUGuA=s176-c-k-c0x00ffffff-no-rj", "heart": false}
{"cid": "Ugj5d17RAoy-lngCoAEC.7-H0Z7-CzDc7-H5whlRr-a", "text": "Here friend, d'you wanna mountain? I got Andes, Himalayas, Rockies, anything you want. I've got Appalachians going cheap, I'll do you a special deal, come onnnnn, come onnnnn, I'm DYING here, I need to sell. I've got a wife and baby. I lost my arm in a freak yachting accident. Please!", "time": "7 years ago", "author": "Peter Johnson", "channel": "UCdjiAwHth9ZD8NOfdvPC5aw", "votes": "1", "photo": "https://yt3.ggpht.com/ytc/AKedOLTXgbNGKSFFSNtFNmZvL_b3TrOuzmmeMsBJnwLoOg=s176-c-k-c0x00ffffff-no-rj", "heart": false}
